////////////////////////////////////////////////////////////////////////////////
// Функции и процедуры обеспечения формирования бухгалтерских отчетов.
//  
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Функция ПолучитьСписокМакетовОформления() Экспорт
	
	СписокМакетовОформления = Новый СписокЗначений;
	
	Для Каждого ОбщийМакет Из Метаданные.ОбщиеМакеты Цикл
		Если ОбщийМакет.ТипМакета = Метаданные.СвойстваОбъектов.ТипМакета.МакетОформленияКомпоновкиДанных Тогда
			СписокМакетовОформления.Добавить(ОбщийМакет.Имя, ОбщийМакет.Синоним);
		КонецЕсли;
	КонецЦикла;
	
	СписокМакетовОформления.Добавить("БезОформления", "Без оформления");
	СписокМакетовОформления.Добавить("Основной"     , "Основной");
	СписокМакетовОформления.Добавить("Яркий"        , "Яркий");
	СписокМакетовОформления.Добавить("Море"         , "Море");
	СписокМакетовОформления.Добавить("Арктика"      , "Арктика");
	СписокМакетовОформления.Добавить("Зеленый"      , "Зеленый");
	СписокМакетовОформления.Добавить("Античный"     , "Античный");
	
	Возврат СписокМакетовОформления;
	
КонецФункции

Функция ПолучитьТекстОрганизация(Организация = Неопределено, ВключатьОбособленныеПодразделения = Ложь) Экспорт
	
	
	ТекстОрганизации = "";
	
	Если ЗначениеЗаполнено(Организация) Тогда
		
		Попытка
				
			СведенияОбОрганизации = ОбщегоНазначенияБПВызовСервера.СведенияОЮрФизЛице(Организация);
			Текст = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,");
			Если ПустаяСтрока(Текст) Тогда
				Текст = СведенияОбОрганизации.Представление;
			КонецЕсли;
			
			ТекстОрганизации = ТекстОрганизации + Текст + ";"; 
				
		Исключение
			// Запись в журнал регистрации не требуется
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат Лев(ТекстОрганизации, СтрДлина(ТекстОрганизации) - 1);
	
КонецФункции

// Получает данные из регистра сведений Настройки отчетов
//
// Параметры:
//  ОбъектОтчет  - СправочникСсылка.ИдентификаторыОбъектовМетаданных - Отчет для отбора
//
// Возвращаемое значение:
//   Структура   - настройки отчета
//
Функция ПолучитьНастройкиОтчета(ОбъектОтчет) Экспорт
	
	НастройкиОтчета = Новый Структура;
	НастройкиОтчета.Вставить("ВыводитьМестоДляШтампа", Ложь);
	
	НаборЗаписей = РегистрыСведений.НастройкиОтчетов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОбъектОтчет.Установить(ОбъектОтчет);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда 
		ЗаполнитьЗначенияСвойств(НастройкиОтчета, НаборЗаписей[0]);
	КонецЕсли;	
	
	Возврат НастройкиОтчета;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

