
////////////////////////////////////////////////////////////////////////////////
// ОбменСБанкамиКлиентПереопределяемый: механизм обмена электронными документами с банками.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Открывает форму разбора банковской выписки.
//
// Параметры:
//   СообщениеОбмена - ДокументСсылка.СообщениеОбменСБанками - сообщение с выпиской банка.
//
Процедура РазобратьВыпискуБанка(СообщениеОбмена) Экспорт
	Перем СсылкаНаХранилище, Организация, НастройкаОбмена, МассивСчетов;

	_ДемоОбменСБанкамиВызовСервера.ПолучитьДанныеВыпискиБанкаТекстовыйФормат(
		СообщениеОбмена, СсылкаНаХранилище, МассивСчетов, Организация, НастройкаОбмена);
	Если НЕ ЗначениеЗаполнено(СсылкаНаХранилище) Тогда
		Возврат;
	КонецЕсли;
	
	Параметры = Новый Структура();
	Параметры.Вставить("ЭлектроннаяВыпискаБанка", СообщениеОбмена);
	Параметры.Вставить("ФайлСсылка", СсылкаНаХранилище);
	Параметры.Вставить("Организация", Организация);
	Параметры.Вставить("МассивСчетов", МассивСчетов);
	Параметры.Вставить("НастройкаОбмена", НастройкаОбмена);
	
	ОткрытьФорму("Обработка._ДемоРазборБанковскойВыписки.Форма.Форма", Параметры);
КонецПроцедуры


#КонецОбласти
