////////////////////////////////////////////////////////////////////////////////
// ОбменСБанкамиКлиентПереопределяемый: механизм обмена электронными документами с банками.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Разбирает переданный текстовый файл выписки.
//
// Параметры:
//  СообщениеОбмена - ДокументСсылка.СообщенияОбменСБанками - электронный документ.
//  ФайлСсылка - Строка - ссылка на временное хранилище.
//  Организация - ОпределяемыйТип.Организация - организация.
//  МассивСчетов - Массив - содержит ссылки на счета организации.
//  НастройкаОбмена - СправочникСсылка.НастройкиОбменСБанками - текущая настройка обмена с банком.
//
Процедура РазобратьФайлВыписки(СообщениеОбмена, ФайлСсылка, Организация, МассивСчетов, НастройкаОбмена) Экспорт
	
	Параметры = Новый Структура();
	Параметры.Вставить("ЭлектроннаяВыпискаБанка", СообщениеОбмена);
	Параметры.Вставить("ФайлСсылка", ФайлСсылка);
	Параметры.Вставить("Организация", Организация);
	Параметры.Вставить("МассивСчетов", МассивСчетов);
	Параметры.Вставить("НастройкаОбмена", НастройкаОбмена);
	
	ОткрытьФорму("Обработка._ДемоРазборБанковскойВыписки.Форма.Форма", Параметры);
	
КонецПроцедуры

#КонецОбласти