#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Процедура - Заполнить по умолчанию
// Выполняет первоночальное заполнение
Процедура ЗаполнитьПоУмолчанию() Экспорт 
	МассивЭлементов = Новый Массив();
	МассивЭлементов.Добавить("Материалы");
	МассивЭлементов.Добавить("Зарплата");
	МассивЭлементов.Добавить("ГСМ");
	МассивЭлементов.Добавить("Электроэнергия");
	МассивЭлементов.Добавить("Отчисления на соцстрах");
	МассивЭлементов.Добавить("Амортизация");
	МассивЭлементов.Добавить("Связь");
	МассивЭлементов.Добавить("Комуслуги");
	МассивЭлементов.Добавить("Прочие");
	
	Для Каждого СтрокаМассива Из МассивЭлементов Цикл 
		СправочникОбъект = Справочники.ВидыЗатрат.СоздатьЭлемент();
		СправочникОбъект.Наименование = СтрокаМассива;				
		
		БухгалтерскийУчетКлиентСервер.ЗаписатьСправочникОбъект(СправочникОбъект);
	КонецЦикла;
КонецПроцедуры // ЗаполнитьПоУмолчанию()	

#КонецОбласти

#КонецЕсли