#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Настройки размещения в панели отчетов.
//
// Параметры:
//   Настройки - Коллекция - Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации()
//   НастройкиОтчета - СтрокаДереваЗначений - Настройки размещения всех вариантов отчета.
//       см. "Реквизиты для изменения" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
// Описание:
//   См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Вспомогательные методы:
//   НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//   ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина/Ложь); // Отчет поддерживает только этот режим.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;

	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Основной");
	НастройкиВарианта.Описание = НСтр("ru = 'Свод по ТМЗ.'");
	
	// Скрытие варианта отчета настройкой пользователя.
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Вариант2");
	НастройкиВарианта.Описание = НСтр("ru = 'Остатки'");
	НастройкиВарианта.ВидимостьПоУмолчанию = Истина;

	// Скрытие варианта отчета настройкой пользователя.
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Вариант3");
	НастройкиВарианта.Описание = НСтр("ru = 'Поступление'");
	НастройкиВарианта.ВидимостьПоУмолчанию = Истина;

	// Скрытие варианта отчета настройкой пользователя.
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Вариант4");
	НастройкиВарианта.Описание = НСтр("ru = 'Реализация'");
	НастройкиВарианта.ВидимостьПоУмолчанию = Истина;

	// Скрытие варианта отчета настройкой пользователя.
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Вариант5");
	НастройкиВарианта.Описание = НСтр("ru = 'Карточка ТМЗ'");
	НастройкиВарианта.ВидимостьПоУмолчанию = Истина;

	// Скрытие варианта отчета настройкой пользователя.
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Вариант6");
	НастройкиВарианта.Описание = НСтр("ru = 'Ведомость расхода'");
	НастройкиВарианта.ВидимостьПоУмолчанию = Истина;

КонецПроцедуры

#КонецОбласти

#КонецЕсли