#Область ОбработчикиСобытийФормы

// Процедура - При создании на сервере
//
// Параметры:
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Запись.Период) Тогда 
		Запись.Период = НачалоМесяца(ТекущаяДата());
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(Запись.Организация) Тогда 
		Запись.Организация = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьЗначениеНастройки("ОсновнаяОрганизация");
	КонецЕсли;
	
	// Это не новая запись
	Если ЗначениеЗаполнено(Запись.СчетУчетаРасчетовПФР) Тогда 
		ТолькоПросмотр = Истина;
	КонецЕсли;	

КонецПроцедуры

// Процедура - При открытии
//
// Параметры:
//  Отказ	 - 	 - 
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Установить видимость и доступность элементов формы
	УстановитьВидимостьДоступностьЭлементов();
		
	УстановитьЭлементОтбораСписка();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	УстановитьЭлементОтбораСписка();
КонецПроцедуры

&НаКлиенте
Процедура ПределыПоПодразделениямПриИзменении(Элемент)
	// Установить видимость и доступность элементов формы
	УстановитьВидимостьДоступностьЭлементов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВключитьВозможностьРедактирования(Команда)
	
	ТолькоПросмотр = Ложь;
	Элементы.ФормаВключитьВозможностьРедактирования.Доступность = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Процедура устанавливает видимость и доступность элементов.
//
Процедура УстановитьВидимостьДоступностьЭлементов()
	Элементы.СтраницаПределыПоПодразделениям.Видимость = Запись.ПределыПоПодразделениям;
КонецПроцедуры // УстановитьВидимостьДоступностьЭлементов()

// Процедура устанавливает отбор в динамическом списке
//
// Параметры:
//  Список  - ДинамическийСписок - список, в котором устанавливается отбор
//  ЗначениеОтбора  - Дата - значение отбора
//
&НаКлиенте
Процедура УстановитьЭлементОтбораСписка()
	РаботаСОтборамиКлиентСервер.УстановитьЭлементОтбораСписка(ПределыПоПодразделениямСписок, "Период", Запись.Период, Истина);
	РаботаСОтборамиКлиентСервер.УстановитьЭлементОтбораСписка(ПределыПоПодразделениямСписок, "Организация", Запись.Организация, Истина);
КонецПроцедуры // УстановитьЭлементОтбораСписка()

#КонецОбласти
