#Область ОбработчикиСобытийФормы

// Процедура - При создании на сервере
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьДанныеОСтавке();
КонецПроцедуры

// Процедура - Обработка оповещения
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ИзмененаСтавкаНДС" Тогда 
		ЗаполнитьДанныеОСтавке();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура - Заполнить данные о ставке
//
&НаСервере
Процедура ЗаполнитьДанныеОСтавке()
	Период = ТекущаяДатаСеанса();
	СтавкаПлательщикНДС = УчетНДСВызовСервера.ПолучитьСтавкуНСП(ТекущаяДатаСеанса(), ПредопределенноеЗначение("Справочник.СтавкиНДС.Стандарт"), Объект.Ссылка);
	ПериодСтавкиПлательщикНДС = Период;
	
	СтавкаНеПлательщикНДС = УчетНДСВызовСервера.ПолучитьСтавкуНСП(ТекущаяДатаСеанса(), ПредопределенноеЗначение("Справочник.СтавкиНДС.БезНДС"), Объект.Ссылка);
	ПериодСтавкиНеПлательщикНДС = Период;
КонецПроцедуры // ЗаполнитьДанныеОСтавке()

#КонецОбласти
