#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ВыполнитьЗакрытиеМесяца(СтруктураПараметров, АдресХранилища) Экспорт
	Если ТипЗнч(СтруктураПараметров) = Тип("Структура") 
		И СтруктураПараметров.Свойство("Ссылка") Тогда 
		ДокументОбъект = СтруктураПараметров.Ссылка.ПолучитьОбъект();
	Иначе 
		Возврат;
	КонецЕсли;	
	
	НачатьТранзакцию();
	
	Попытка
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		ДокументОбъект.Записать(); // Покажем пользователю
	Исключение
		ОтменитьТранзакцию();

		ТекстСообщения = НСтр("ru='Не удалось завершить проведение документа.
			|Техническая информация об ошибке: %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));	
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Не удалось завершить проведение документа по причине: %1'"), ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
		
		Возврат;
	КонецПопытки;
	
	АдресХранилища = ПоместитьВоВременноеХранилище(ДокументОбъект.Ссылка, АдресХранилища);

	ЗафиксироватьТранзакцию();
КонецПроцедуры // ВыполнитьЗакрытиеМесяца()    

// Процедура - Рассчитать налоги по зарплате
// Производит расчет налогов и помещает во временные таблицы для дальнейшего проведения
//
Процедура РассчитатьНалогиПоЗарплате(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	// 0. Получение Графика работы сотрудников
	//<< Определим сотрудников, кто отработал менее 15 дней для исключения вычетов при расчете ПН
	//0.1 Получение  сотрудников, уволенных на начало
	//0.2 Получение сотрудников принятых/уволенных в теч. текущего месяца >>

	// 1. Получение статусов сотрудников и ставок налогов по этим статусам
	// 2. Подготовка расчетной базы- начисления
	// 3. Расчет налогов с сотрудников
	// 4. Расчет проф.взноса- так как может быть за минусом налогов
	// 4. Расчет налогов с организации
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
		//Сотрудники
		"ВЫБРАТЬ
		|	СотрудникиСрезПоследних.ФизЛицо КАК ФизЛицо,
		|	СотрудникиСрезПоследних.Подразделение,
		|	СотрудникиСрезПоследних.ГрафикРаботы
		|ПОМЕСТИТЬ ВременнаяТаблицаСотрудники
		|ИЗ
		|	РегистрСведений.Сотрудники.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Физлицо В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВременнаяТаблицаНачисленияЗаМесяц.ФизЛицо
		|					ИЗ
		|						ВременнаяТаблицаНачисленияЗаМесяц КАК ВременнаяТаблицаНачисленияЗаМесяц)) КАК СотрудникиСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СотрудникиСрезПоследних.ФизЛицо КАК ФизЛицо,
		|	ЛОЖЬ КАК Больше15дней
		|ПОМЕСТИТЬ ВременнаяТаблицаУволенныеНаНачало
		|ИЗ
		|	РегистрСведений.Сотрудники.СрезПоследних(
		|			ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ), СЕКУНДА, -1),
		|			Организация = &Организация
		|				И Физлицо В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВременнаяТаблицаНачисленияЗаМесяц.ФизЛицо
		|					ИЗ
		|						ВременнаяТаблицаНачисленияЗаМесяц КАК ВременнаяТаблицаНачисленияЗаМесяц)) КАК СотрудникиСрезПоследних
		|ГДЕ
		|	СотрудникиСрезПоследних.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СотрудникиСрезПоследних.ФизЛицо КАК ФизЛицо,
		|	ВЫБОР
		|		КОГДА СотрудникиСрезПоследних.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Прием)
		|				И ДЕНЬ(СотрудникиСрезПоследних.Период) <= 15
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ВЫБОР
		|				КОГДА СотрудникиСрезПоследних.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)
		|						И ДЕНЬ(СотрудникиСрезПоследних.Период) >= 15
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ
		|	КОНЕЦ КАК Больше15дней
		|ПОМЕСТИТЬ ВременнаяТаблицаОтработаноДней
		|ИЗ
		|	РегистрСведений.Сотрудники.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Физлицо В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВременнаяТаблицаНачисленияЗаМесяц.ФизЛицо
		|					ИЗ
		|						ВременнаяТаблицаНачисленияЗаМесяц КАК ВременнаяТаблицаНачисленияЗаМесяц)) КАК СотрудникиСрезПоследних
		|ГДЕ
		|	(СотрудникиСрезПоследних.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)
		|			ИЛИ СотрудникиСрезПоследних.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.прием))
		|	И СотрудникиСрезПоследних.Период МЕЖДУ НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ) И КОНЕЦПЕРИОДА(&Период, МЕСЯЦ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтатусыСотрудниковСрезПоследних.Физлицо КАК ФизЛицо,
		|	СтатусыСотрудниковСрезПоследних.Статус КАК Статус,
		|	СтатусыСотрудниковСрезПоследних.Статус.Категория КАК Категория,
		|	ВЫБОР
		|		КОГДА СтатусыСотрудниковСрезПоследних.Статус.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииСотрудников.ИностранныеГраждане)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК КатегорияИностранныеГраждане,
		|	ЕСТЬNULL(ВременнаяТаблицаОтработаноДней.Больше15дней, ЕСТЬNULL(ВременнаяТаблицаУволенныеНаНачало.Больше15дней, ИСТИНА)) КАК Больше15дней,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВременнаяТаблицаОтработаноДней.Больше15дней, ЕСТЬNULL(ВременнаяТаблицаУволенныеНаНачало.Больше15дней, ИСТИНА))
		|			ТОГДА СтатусыСотрудниковСрезПоследних.ДопВычет * 100
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ДопВычет,
		|	СтавкиНалоговЗаработнойПлатыСрезПоследних.СтавкаПФР,
		|	СтавкиНалоговЗаработнойПлатыСрезПоследних.СтавкаГНПФР,
		|	СтавкиНалоговЗаработнойПлатыСрезПоследних.СтавкаПН,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВременнаяТаблицаОтработаноДней.Больше15дней, ЕСТЬNULL(ВременнаяТаблицаУволенныеНаНачало.Больше15дней, ИСТИНА))
		|			ТОГДА СтавкиНалоговЗаработнойПлатыСрезПоследних.Вычеты
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Вычеты,
		|	СтавкиНалоговЗаработнойПлатыСрезПоследних.СтавкаПФФ,
		|	СтавкиНалоговЗаработнойПлатыСрезПоследних.СтавкаМСФ,
		|	СтавкиНалоговЗаработнойПлатыСрезПоследних.СтавкаФОТФ,
		|	СтавкиНалоговЗаработнойПлатыСрезПоследних.НеВычитатьПФ,
		|	СтавкиНалоговЗаработнойПлатыСрезПоследних.СтавкаМСР
		|ПОМЕСТИТЬ ВременнаяТаблицаСтатусы
		|ИЗ
		|	РегистрСведений.СтатусыСотрудников.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Физлицо В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВременнаяТаблицаНачисленияЗаМесяц.ФизЛицо
		|					ИЗ
		|						ВременнаяТаблицаНачисленияЗаМесяц КАК ВременнаяТаблицаНачисленияЗаМесяц)) КАК СтатусыСотрудниковСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНалоговЗаработнойПлаты.СрезПоследних(&Период, ) КАК СтавкиНалоговЗаработнойПлатыСрезПоследних
		|		ПО СтатусыСотрудниковСрезПоследних.Статус = СтавкиНалоговЗаработнойПлатыСрезПоследних.Статус
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаОтработаноДней КАК ВременнаяТаблицаОтработаноДней
		|		ПО СтатусыСотрудниковСрезПоследних.Физлицо = ВременнаяТаблицаОтработаноДней.ФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаУволенныеНаНачало КАК ВременнаяТаблицаУволенныеНаНачало
		|		ПО СтатусыСотрудниковСрезПоследних.Физлицо = ВременнаяТаблицаУволенныеНаНачало.ФизЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаНачисленияЗаМесяц.ФизЛицо КАК ФизЛицо,
		|	СУММА(ВременнаяТаблицаНачисленияЗаМесяц.ОтработаноДней) КАК ОтработаноДней,
		|	СУММА(ВременнаяТаблицаНачисленияЗаМесяц.Результат) КАК СуммаНачислено,
		|	СУММА(ВЫБОР
		|			КОГДА ВременнаяТаблицаНачисленияЗаМесяц.ВидРасчетаОблагаетсяСФ
		|				ТОГДА ВременнаяТаблицаНачисленияЗаМесяц.Результат
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК РасчетнаяБазаСФ,
		|	СУММА(ВЫБОР
		|			КОГДА ВременнаяТаблицаНачисленияЗаМесяц.ВидРасчетаОблагаетсяПН
		|				ТОГДА ВременнаяТаблицаНачисленияЗаМесяц.Результат
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК РасчетнаяБазаПН,
		|	СУММА(ВЫБОР
		|			КОГДА ВременнаяТаблицаНачисленияЗаМесяц.ВидРасчетаОблагаетсяПрофВзнос
		|				ТОГДА ВременнаяТаблицаНачисленияЗаМесяц.Результат
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК РасчетнаяБазаПрофВзнос
		|ПОМЕСТИТЬ ВременнаяТаблицаДанныеДляРасчетаНалогов
		|ИЗ
		|	ВременнаяТаблицаНачисленияЗаМесяц КАК ВременнаяТаблицаНачисленияЗаМесяц
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаНачисленияЗаМесяц.ФизЛицо
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ФизЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаДанныеДляРасчетаНалогов.ФизЛицо КАК ФизЛицо,
		|	ВременнаяТаблицаДанныеДляРасчетаНалогов.СуммаНачислено КАК СуммаНачислено,
		|	ВременнаяТаблицаДанныеДляРасчетаНалогов.РасчетнаяБазаСФ КАК РасчетнаяБазаСФ,
		|	ВременнаяТаблицаДанныеДляРасчетаНалогов.РасчетнаяБазаПН КАК РасчетнаяБазаПН,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА ЕСТЬNULL(ВременнаяТаблицаСтатусы.СтавкаПФР, 0) = 0
		|				ТОГДА 0
		|			ИНАЧЕ ВременнаяТаблицаДанныеДляРасчетаНалогов.РасчетнаяБазаСФ * ВременнаяТаблицаСтатусы.СтавкаПФР / 100
		|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК ПФР,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА ЕСТЬNULL(ВременнаяТаблицаСтатусы.СтавкаГНПФР, 0) = 0
		|				ТОГДА 0
		|			ИНАЧЕ ВременнаяТаблицаДанныеДляРасчетаНалогов.РасчетнаяБазаСФ * ВременнаяТаблицаСтатусы.СтавкаГНПФР / 100
		|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК ГНПФР,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА ЕСТЬNULL(ВременнаяТаблицаСтатусы.СтавкаПН, 0) = 0
		|					ИЛИ ЕСТЬNULL(ВременнаяТаблицаСтатусы.КатегорияИностранныеГраждане, ЛОЖЬ)
		|				ТОГДА 0
		|			ИНАЧЕ (ВременнаяТаблицаДанныеДляРасчетаНалогов.РасчетнаяБазаПН - (ВЫРАЗИТЬ(ВременнаяТаблицаДанныеДляРасчетаНалогов.РасчетнаяБазаСФ * ВременнаяТаблицаСтатусы.СтавкаПФР / 100 КАК ЧИСЛО(15, 2))) - (ВЫРАЗИТЬ(ВременнаяТаблицаДанныеДляРасчетаНалогов.РасчетнаяБазаСФ * ВременнаяТаблицаСтатусы.СтавкаГНПФР / 100 КАК ЧИСЛО(15, 2))) - ВременнаяТаблицаСтатусы.Вычеты * 100 - ВременнаяТаблицаСтатусы.ДопВычет) * ВременнаяТаблицаСтатусы.СтавкаПН / 100
		|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК ПН,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА ЕСТЬNULL(ВременнаяТаблицаСтатусы.СтавкаМСР, 0) = 0
		|				ТОГДА 0
		|			ИНАЧЕ ВременнаяТаблицаДанныеДляРасчетаНалогов.РасчетнаяБазаСФ * ВременнаяТаблицаСтатусы.СтавкаМСР / 100
		|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК МСР,
		|	ВЫРАЗИТЬ((ВременнаяТаблицаДанныеДляРасчетаНалогов.РасчетнаяБазаПрофВзнос - ВЫБОР
		|			КОГДА ЕСТЬNULL(ВременнаяТаблицаПрофвзносы.ПрофВзносЗаВычетомПФРиГНПФР, ЛОЖЬ)
		|				ТОГДА (ВЫРАЗИТЬ(ВЫБОР
		|							КОГДА ЕСТЬNULL(ВременнаяТаблицаСтатусы.СтавкаПФР, 0) = 0
		|								ТОГДА 0
		|							ИНАЧЕ ВременнаяТаблицаДанныеДляРасчетаНалогов.РасчетнаяБазаСФ * ВременнаяТаблицаСтатусы.СтавкаПФР / 100
		|						КОНЕЦ КАК ЧИСЛО(15, 2))) + (ВЫРАЗИТЬ(ВЫБОР
		|							КОГДА ЕСТЬNULL(ВременнаяТаблицаСтатусы.СтавкаГНПФР, 0) = 0
		|								ТОГДА 0
		|							ИНАЧЕ ВременнаяТаблицаДанныеДляРасчетаНалогов.РасчетнаяБазаСФ * ВременнаяТаблицаСтатусы.СтавкаГНПФР / 100
		|						КОНЕЦ КАК ЧИСЛО(15, 2)))
		|			ИНАЧЕ 0
		|		КОНЕЦ - ВЫБОР
		|			КОГДА ЕСТЬNULL(ВременнаяТаблицаПрофвзносы.ПрофВзносЗаВычетомПН, ЛОЖЬ)
		|				ТОГДА ВЫРАЗИТЬ(ВЫБОР
		|							КОГДА ЕСТЬNULL(ВременнаяТаблицаСтатусы.СтавкаПН, 0) = 0
		|								ТОГДА 0
		|							ИНАЧЕ (ВременнаяТаблицаДанныеДляРасчетаНалогов.РасчетнаяБазаПН - ВЫБОР
		|									КОГДА ЕСТЬNULL(ВременнаяТаблицаСтатусы.СтавкаПФР, 0) = 0
		|										ТОГДА 0
		|									ИНАЧЕ ВременнаяТаблицаДанныеДляРасчетаНалогов.РасчетнаяБазаСФ * ВременнаяТаблицаСтатусы.СтавкаПФР / 100
		|								КОНЕЦ - ВЫБОР
		|									КОГДА ЕСТЬNULL(ВременнаяТаблицаСтатусы.СтавкаГНПФР, 0) = 0
		|										ТОГДА 0
		|									ИНАЧЕ ВременнаяТаблицаДанныеДляРасчетаНалогов.РасчетнаяБазаСФ * ВременнаяТаблицаСтатусы.СтавкаГНПФР / 100
		|								КОНЕЦ - ЕСТЬNULL(ВременнаяТаблицаСтатусы.Вычеты, 0) * 100 - ВременнаяТаблицаСтатусы.ДопВычет) * ВременнаяТаблицаСтатусы.СтавкаПН / 100
		|						КОНЕЦ КАК ЧИСЛО(15, 2))
		|			ИНАЧЕ 0
		|		КОНЕЦ) * ЕСТЬNULL(ВременнаяТаблицаПрофвзносы.СтавкаПрофВзнос, 0) / 100 КАК ЧИСЛО(15, 2)) КАК ПрофВзнос,
		|	ВременнаяТаблицаСтатусы.Вычеты КАК Вычеты,
		|	ВременнаяТаблицаСтатусы.ДопВычет КАК ДопВычет,
		|	ВременнаяТаблицаДанныеДляРасчетаНалогов.ОтработаноДней КАК ОтработаноДней,
		|	ВременнаяТаблицаПрофвзносы.ВидНалогаПрофвзнос КАК ВидНалогаПрофВзнос
		|ПОМЕСТИТЬ ВременнаяТаблицаНалоги
		|ИЗ
		|	ВременнаяТаблицаДанныеДляРасчетаНалогов КАК ВременнаяТаблицаДанныеДляРасчетаНалогов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСтатусы КАК ВременнаяТаблицаСтатусы
		|		ПО ВременнаяТаблицаДанныеДляРасчетаНалогов.ФизЛицо = ВременнаяТаблицаСтатусы.ФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаПрофвзносы КАК ВременнаяТаблицаПрофвзносы
		|		ПО ВременнаяТаблицаДанныеДляРасчетаНалогов.ФизЛицо = ВременнаяТаблицаПрофвзносы.ФизЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаНачисленияЗаМесяц.ФизЛицо КАК ФизЛицо,
		|	ВременнаяТаблицаНачисленияЗаМесяц.СчетУчетаЗатрат,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаНачисленияЗаМесяц.СтатьяЗатратСоцОтчисления = ЗНАЧЕНИЕ(Справочник.СтатьиЗатратИДоходов.ПустаяСсылка)
		|			ТОГДА ВременнаяТаблицаНачисленияЗаМесяц.СтатьяЗатрат
		|		ИНАЧЕ ВременнаяТаблицаНачисленияЗаМесяц.СтатьяЗатратСоцОтчисления
		|	КОНЕЦ КАК СтатьяЗатрат,
		|	СУММА(ВременнаяТаблицаНачисленияЗаМесяц.Результат) КАК РасчетнаяБазаСФ,
		|	СУММА(ВЫРАЗИТЬ(ВЫБОР
		|				КОГДА ЕСТЬNULL(ВременнаяТаблицаСтатусы.СтавкаПФФ, 0) = 0
		|					ТОГДА 0
		|				ИНАЧЕ ВременнаяТаблицаНачисленияЗаМесяц.Результат * ВременнаяТаблицаСтатусы.СтавкаПФФ / 100
		|			КОНЕЦ КАК ЧИСЛО(15, 2))) КАК ПФФ,
		|	СУММА(ВЫРАЗИТЬ(ВЫБОР
		|				КОГДА ЕСТЬNULL(ВременнаяТаблицаСтатусы.СтавкаМСФ, 0) = 0
		|					ТОГДА 0
		|				ИНАЧЕ ВременнаяТаблицаНачисленияЗаМесяц.Результат * ВременнаяТаблицаСтатусы.СтавкаМСФ / 100
		|			КОНЕЦ КАК ЧИСЛО(15, 2))) КАК МСФ,
		|	СУММА(ВЫРАЗИТЬ(ВЫБОР
		|				КОГДА ЕСТЬNULL(ВременнаяТаблицаСтатусы.СтавкаФОТФ, 0) = 0
		|					ТОГДА 0
		|				ИНАЧЕ ВременнаяТаблицаНачисленияЗаМесяц.Результат * ВременнаяТаблицаСтатусы.СтавкаФОТФ / 100
		|			КОНЕЦ КАК ЧИСЛО(15, 2))) КАК ФОТФ
		|ПОМЕСТИТЬ ВременнаяТаблицаНалогиСОрганизации
		|ИЗ
		|	ВременнаяТаблицаНачисленияЗаМесяц КАК ВременнаяТаблицаНачисленияЗаМесяц
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСтатусы КАК ВременнаяТаблицаСтатусы
		|		ПО ВременнаяТаблицаНачисленияЗаМесяц.ФизЛицо = ВременнаяТаблицаСтатусы.ФизЛицо
		|ГДЕ
		|	ВременнаяТаблицаНачисленияЗаМесяц.ВидРасчетаОблагаетсяСФ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаНачисленияЗаМесяц.ФизЛицо,
		|	ВременнаяТаблицаНачисленияЗаМесяц.СчетУчетаЗатрат,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаНачисленияЗаМесяц.СтатьяЗатратСоцОтчисления = ЗНАЧЕНИЕ(Справочник.СтатьиЗатратИДоходов.ПустаяСсылка)
		|			ТОГДА ВременнаяТаблицаНачисленияЗаМесяц.СтатьяЗатрат
		|		ИНАЧЕ ВременнаяТаблицаНачисленияЗаМесяц.СтатьяЗатратСоцОтчисления
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВременнаяТаблицаДанныеДляРасчетаНалогов";
	Запрос.УстановитьПараметр("Период", СтруктураДополнительныеСвойства.ДляПроведения.Дата);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	
	Запрос.Выполнить();
КонецПроцедуры // РассчитатьНалогиПоЗарплате()

// Процедура - Рассчитать плановые удержания
//
Процедура РассчитатьПлановыеУдержания(СтруктураДополнительныеСвойства, ДокументОбъект) 
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВременнаяТаблицаНалоги.ФизЛицо КАК ФизЛицо,
		|	СУММА(ВременнаяТаблицаНалоги.ПФР) КАК ПФР,
		|	СУММА(ВременнаяТаблицаНалоги.ГНПФР) КАК ГНПФР,
		|	СУММА(ВременнаяТаблицаНалоги.ПН) КАК ПН,
		|	СУММА(ВременнаяТаблицаНалоги.ПрофВзнос) КАК ПрофВзнос
		|ПОМЕСТИТЬ ВременнаяТаблицаНалогиВременно
		|ИЗ
		|	ВременнаяТаблицаНалоги КАК ВременнаяТаблицаНалоги
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаНалоги.ФизЛицо
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ФизЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПлановыеУдержанияСрезПоследних.ФизЛицо,
		|	ПлановыеУдержанияСрезПоследних.ВидРасчета,
		|	ПлановыеУдержанияСрезПоследних.Размер,
		|	ВЫБОР
		|		КОГДА ПлановыеУдержанияСрезПоследних.ВидРасчета.РасчетЗаМинусомСФ
		|			ТОГДА ЕСТЬNULL(ВременнаяТаблицаНалогиВременно.ПФР, 0) + ЕСТЬNULL(ВременнаяТаблицаНалогиВременно.ГНПФР, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ + ВЫБОР
		|		КОГДА ПлановыеУдержанияСрезПоследних.ВидРасчета.РасчетЗаМинусомПН
		|			ТОГДА ЕСТЬNULL(ВременнаяТаблицаНалогиВременно.ПН, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ + ВЫБОР
		|		КОГДА ПлановыеУдержанияСрезПоследних.ВидРасчета.РасчетЗаМинусомПрофВзнос
		|			ТОГДА ЕСТЬNULL(ВременнаяТаблицаНалогиВременно.ПрофВзнос, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК РазмерВычета
		|ИЗ
		|	РегистрСведений.ПлановыеУдержания.СрезПоследних(&Период, Организация = &Организация) КАК ПлановыеУдержанияСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаНалогиВременно КАК ВременнаяТаблицаНалогиВременно
		|		ПО ПлановыеУдержанияСрезПоследних.ФизЛицо = ВременнаяТаблицаНалогиВременно.ФизЛицо
		|ГДЕ
		|	ПлановыеУдержанияСрезПоследних.Актуальность
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВременнаяТаблицаНалогиВременно";
	Запрос.УстановитьПараметр("Период", КонецМесяца(СтруктураДополнительныеСвойства.ДляПроведения.Дата));
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда 
		// Добавление в инициализацию пустой таблицы
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 0
			|	ВременнаяТаблицаУдержанияЗаМесяц.ФизЛицо,
			|	ВременнаяТаблицаУдержанияЗаМесяц.ВидРасчета,
			|	ВременнаяТаблицаУдержанияЗаМесяц.СчетУчета,
			|	0 КАК Размер,
			|	0 КАК Результат
			|ПОМЕСТИТЬ ВременнаяТаблицаУдержания
			|ИЗ
			|	ВременнаяТаблицаУдержанияЗаМесяц КАК ВременнаяТаблицаУдержанияЗаМесяц";
		Запрос.Выполнить();
		
		Возврат;
	КонецЕсли;	
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаТабличнойЧасти = ДокументОбъект.Удержания.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаУдержания.ФизЛицо,
		|	ВременнаяТаблицаУдержания.ВидРасчета,
		|	ВременнаяТаблицаУдержания.Размер,
		|	ВременнаяТаблицаУдержания.РазмерВычета,
		|	ВременнаяТаблицаУдержания.Результат
		|ПОМЕСТИТЬ ВременнаяТаблицаУдержания
		|ИЗ
		|	&ВременнаяТаблицаУдержания КАК ВременнаяТаблицаУдержания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ) КАК ПериодРегистрации,
		|	НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ) КАК БазовыйПериодНачало,
		|	КОНЕЦПЕРИОДА(&Дата, ДЕНЬ) КАК БазовыйПериодКонец,
		|	ТаблицаДокумента.ВидРасчета,
		|	&Организация КАК Организация,
		|	ТаблицаДокумента.ФизЛицо,
		|	ТаблицаДокумента.Размер,
		|	ТаблицаДокумента.РазмерВычета,
		|	ТаблицаДокумента.Результат
		|ИЗ
		|	ВременнаяТаблицаУдержания КАК ТаблицаДокумента";
	Запрос.УстановитьПараметр("Дата", КонецМесяца(СтруктураДополнительныеСвойства.ДляПроведения.Дата));
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ВременнаяТаблицаУдержания", ДокументОбъект.Удержания.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУдержания", РезультатЗапроса.Выгрузить());
	
	// Подготовка наборов записей.
	БухгалтерскийУчетСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ДокументОбъект);
	
	// Отражение в разделах учета.
	БухгалтерскийУчетСервер.ОтразитьУдержания(ДокументОбъект.ДополнительныеСвойства, ДокументОбъект.Движения, Ложь);

	// Запись наборов записей.
	БухгалтерскийУчетСервер.ЗаписатьНаборыЗаписей(ДокументОбъект);

	Ошибки = Неопределено;
	ПроведениеРасчетовПоЗарплатеСервер.РассчитатьЗаписиРегистраРасчета("Удержания", ДокументОбъект.Движения.Удержания, ДокументОбъект.Удержания, Ошибки);
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
	
	// Подготовка наборов записей
	БухгалтерскийУчетСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ДокументОбъект);
	
	// Запись наборов записей
	БухгалтерскийУчетСервер.ЗаписатьНаборыЗаписей(ДокументОбъект);
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Удалить("ВременнаяТаблицаУдержания");

	// Добавление в инициализацию
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаДокумента.ФизЛицо,
		|	ТаблицаДокумента.ВидРасчета,
		|	ТаблицаДокумента.Размер,
		|	ТаблицаДокумента.Результат
		|ПОМЕСТИТЬ ВременнаяТаблицаУдержанияВременно
		|ИЗ
		|	&ВременнаяТаблицаУдержания КАК ТаблицаДокумента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаУдержанияВременно.ФизЛицо,
		|	ВременнаяТаблицаУдержанияВременно.ВидРасчета,
		|	ВременнаяТаблицаУдержанияВременно.ВидРасчета.СчетУчета КАК СчетУчета,
		|	ВременнаяТаблицаУдержанияВременно.Размер,
		|	ВременнаяТаблицаУдержанияВременно.Результат
		|ПОМЕСТИТЬ ВременнаяТаблицаУдержания
		|ИЗ
		|	ВременнаяТаблицаУдержанияВременно КАК ВременнаяТаблицаУдержанияВременно
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВременнаяТаблицаУдержанияВременно";
	Запрос.УстановитьПараметр("ВременнаяТаблицаУдержания", ДокументОбъект.Удержания);
	Запрос.Выполнить();
КонецПроцедуры // РассчитатьПлановыеУдержания()

#КонецОбласти
	
#Область ПроцедурыПроведенияДокумента

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаХозрасчетный(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	    // Начисления
		"ВЫБРАТЬ
		|	1 КАК Порядок,
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаНачисленияЗаМесяц.СчетУчетаЗатрат КАК СчетДт,
		|	&СчетУчета КАК СчетКт,
		|	ВременнаяТаблицаНачисленияЗаМесяц.СтатьяЗатрат КАК СубконтоДт1,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
		|	ВременнаяТаблицаНачисленияЗаМесяц.ФизЛицо КАК СубконтоКт1,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
		|	ВременнаяТаблицаНачисленияЗаМесяц.ВидРасчета КАК СубконтоКт3,
		|	СУММА(ВременнаяТаблицаНачисленияЗаМесяц.Результат) КАК Сумма,
		|	&ВалютаРегламентированногоУчета КАК ВалютаДт,
		|	СУММА(ВременнаяТаблицаНачисленияЗаМесяц.Результат) КАК ВалютнаяСуммаДт,
		|	&ВалютаРегламентированногоУчета КАК ВалютаКт,
		|	СУММА(ВременнаяТаблицаНачисленияЗаМесяц.Результат) КАК ВалютнаяСуммаКт,
		|	""Начисление заработной платы"" КАК Содержание
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаНачисленияЗаМесяц КАК ВременнаяТаблицаНачисленияЗаМесяц
		|		ПО (ИСТИНА)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаНачисленияЗаМесяц.ОтложенноеОтражение,
		|	ВременнаяТаблицаНачисленияЗаМесяц.СчетУчетаЗатрат,
		|	ВременнаяТаблицаНачисленияЗаМесяц.ФизЛицо,
		|	ВременнаяТаблицаНачисленияЗаМесяц.ВидРасчета,
		|	ВременнаяТаблицаНачисленияЗаМесяц.СтатьяЗатрат
		|
		|	ИМЕЮЩИЕ
		|		НЕ СУММА(ВременнаяТаблицаНачисленияЗаМесяц.Результат) = 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		// ПФФ
		|ВЫБРАТЬ
		|	2,
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаНалогиСОрганизации.СчетУчетаЗатрат,
		|	&СчетУчетаРасчетовПФФ,
		|	ВременнаяТаблицаНалогиСОрганизации.СтатьяЗатрат,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	СУММА(ВременнаяТаблицаНалогиСОрганизации.ПФФ),
		|	&ВалютаРегламентированногоУчета,
		|	СУММА(ВременнаяТаблицаНалогиСОрганизации.ПФФ),
		|	&ВалютаРегламентированногоУчета,
		|	СУММА(ВременнаяТаблицаНалогиСОрганизации.ПФФ),
		|	""Начисление взносов по пенсионным отчислениям с фирмы""
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаНалогиСОрганизации КАК ВременнаяТаблицаНалогиСОрганизации
		|		ПО (ИСТИНА)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаНалогиСОрганизации.СчетУчетаЗатрат,
		|	ВременнаяТаблицаНалогиСОрганизации.СтатьяЗатрат
		|
		|	ИМЕЮЩИЕ
		|		НЕ СУММА(ВременнаяТаблицаНалогиСОрганизации.ПФФ) = 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		// МСФ
		|ВЫБРАТЬ
		|	3,
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаНалогиСОрганизации.СчетУчетаЗатрат,
		|	&СчетУчетаРасчетовМСФ,
		|	ВременнаяТаблицаНалогиСОрганизации.СтатьяЗатрат,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	СУММА(ВременнаяТаблицаНалогиСОрганизации.МСФ),
		|	&ВалютаРегламентированногоУчета,
		|	СУММА(ВременнаяТаблицаНалогиСОрганизации.МСФ),
		|	&ВалютаРегламентированногоУчета,
		|	СУММА(ВременнаяТаблицаНалогиСОрганизации.МСФ),
		|	""Начисление взносов по медицинскому страхованию с фирмы""
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаНалогиСОрганизации КАК ВременнаяТаблицаНалогиСОрганизации
		|		ПО (ИСТИНА)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаНалогиСОрганизации.СчетУчетаЗатрат,
		|	ВременнаяТаблицаНалогиСОрганизации.СтатьяЗатрат
		|
		|	ИМЕЮЩИЕ
		|		НЕ СУММА(ВременнаяТаблицаНалогиСОрганизации.МСФ) = 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		// ФОТФ
		|ВЫБРАТЬ
		|	4,
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаНалогиСОрганизации.СчетУчетаЗатрат,
		|	&СчетУчетаРасчетовФОТФ,
		|	ВременнаяТаблицаНалогиСОрганизации.СтатьяЗатрат,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	СУММА(ВременнаяТаблицаНалогиСОрганизации.ФОТФ),
		|	&ВалютаРегламентированногоУчета,
		|	СУММА(ВременнаяТаблицаНалогиСОрганизации.ФОТФ),
		|	&ВалютаРегламентированногоУчета,
		|	СУММА(ВременнаяТаблицаНалогиСОрганизации.ФОТФ),
		|	""Начисление взносов по фонду оздоровления трудящихся с фирмы""
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаНалогиСОрганизации КАК ВременнаяТаблицаНалогиСОрганизации
		|		ПО (ИСТИНА)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаНалогиСОрганизации.СчетУчетаЗатрат,
		|	ВременнаяТаблицаНалогиСОрганизации.СтатьяЗатрат
		|
		|	ИМЕЮЩИЕ
		|		НЕ СУММА(ВременнаяТаблицаНалогиСОрганизации.ФОТФ) = 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		// ПФР
		|ВЫБРАТЬ
		|	5,
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	&СчетУчета,
		|	&СчетУчетаРасчетовПФР,
		|	ВременнаяТаблицаНалоги.ФизЛицо,
		|	НЕОПРЕДЕЛЕНО,
		|	Значение(ПланВидовРасчета.ВидыНалогов.ПФР),
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	ВременнаяТаблицаНалоги.ПФР,
		|	&ВалютаРегламентированногоУчета,
		|	ВременнаяТаблицаНалоги.ПФР,
		|	&ВалютаРегламентированногоУчета,
		|	ВременнаяТаблицаНалоги.ПФР,
		|	""Начисление взносов по пенсионным отчислениям с сотрудника""
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаНалоги КАК ВременнаяТаблицаНалоги
		|		ПО (ИСТИНА)
		|ГДЕ
		|	НЕ ВременнаяТаблицаНалоги.ПФР = 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		// ГНПФР
		|ВЫБРАТЬ
		|	6,
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	&СчетУчета,
		|	&СчетУчетаРасчетовГНПФР,
		|	ВременнаяТаблицаНалоги.ФизЛицо,
		|	НЕОПРЕДЕЛЕНО,
		|	Значение(ПланВидовРасчета.ВидыНалогов.ГНПФР),
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	ВременнаяТаблицаНалоги.ГНПФР,
		|	&ВалютаРегламентированногоУчета,
		|	ВременнаяТаблицаНалоги.ГНПФР,
		|	&ВалютаРегламентированногоУчета,
		|	ВременнаяТаблицаНалоги.ГНПФР,
		|	""Начисление взносов по отчислениям в гос.накопительный пенсионный фонд с сотрудника""
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаНалоги КАК ВременнаяТаблицаНалоги
		|		ПО (ИСТИНА)
		|ГДЕ
		|	НЕ ВременнаяТаблицаНалоги.ГНПФР = 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		// ПН
		|ВЫБРАТЬ
		|	7,
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	&СчетУчета,
		|	&СчетУчетаРасчетовПН,
		|	ВременнаяТаблицаНалоги.ФизЛицо,
		|	НЕОПРЕДЕЛЕНО,
		|	Значение(ПланВидовРасчета.ВидыНалогов.ПН),
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	ВременнаяТаблицаНалоги.ПН,
		|	&ВалютаРегламентированногоУчета,
		|	ВременнаяТаблицаНалоги.ПН,
		|	&ВалютаРегламентированногоУчета,
		|	ВременнаяТаблицаНалоги.ПН,
		|	""Начисление взносов по подоходному налогу на доходы физических лиц""
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаНалоги КАК ВременнаяТаблицаНалоги
		|		ПО (ИСТИНА)
		|ГДЕ
		|	НЕ ВременнаяТаблицаНалоги.ПН = 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		// Удержания за месяц
		|ВЫБРАТЬ
		|	8,
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	&СчетУчета,
		|	ВременнаяТаблицаУдержанияЗаМесяц.СчетУчета,
		|	ВременнаяТаблицаУдержанияЗаМесяц.ФизЛицо,
		|	НЕОПРЕДЕЛЕНО,
		|	ВременнаяТаблицаУдержанияЗаМесяц.ВидРасчета,
		|	ВременнаяТаблицаУдержанияЗаМесяц.ВидРасчета,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	СУММА(ВременнаяТаблицаУдержанияЗаМесяц.Результат),
		|	&ВалютаРегламентированногоУчета,
		|	СУММА(ВременнаяТаблицаУдержанияЗаМесяц.Результат),
		|	&ВалютаРегламентированногоУчета,
		|	СУММА(ВременнаяТаблицаУдержанияЗаМесяц.Результат),
		|	""Удержание заработной платы""
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаУдержанияЗаМесяц КАК ВременнаяТаблицаУдержанияЗаМесяц
		|		ПО (ИСТИНА)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаУдержанияЗаМесяц.СчетУчета,
		|	ВременнаяТаблицаУдержанияЗаМесяц.ВидРасчета,
		|	ВременнаяТаблицаУдержанияЗаМесяц.ФизЛицо
		|
		|	ИМЕЮЩИЕ
		|		НЕ СУММА(ВременнаяТаблицаУдержанияЗаМесяц.Результат) = 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		// Удержания этого документа
		|ВЫБРАТЬ
		|	9,
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	&СчетУчета,
		|	ВременнаяТаблицаУдержания.СчетУчета,
		|	ВременнаяТаблицаУдержания.ФизЛицо,
		|	НЕОПРЕДЕЛЕНО,
		|	ВременнаяТаблицаУдержания.ВидРасчета,
		|	ВременнаяТаблицаУдержания.ВидРасчета,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	СУММА(ВременнаяТаблицаУдержания.Результат),
		|	&ВалютаРегламентированногоУчета,
		|	СУММА(ВременнаяТаблицаУдержания.Результат),
		|	&ВалютаРегламентированногоУчета,
		|	СУММА(ВременнаяТаблицаУдержания.Результат),
		|	""Удержание заработной платы""
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаУдержания КАК ВременнаяТаблицаУдержания
		|		ПО (ИСТИНА)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаУдержания.СчетУчета,
		|	ВременнаяТаблицаУдержания.ВидРасчета,
		|	ВременнаяТаблицаУдержания.ФизЛицо
		|
		|	ИМЕЮЩИЕ
		|		НЕ СУММА(ВременнаяТаблицаУдержания.Результат) = 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		// Закрытие отложенного отражения по начислениям
		|ВЫБРАТЬ
		|	10,
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаНачисленияОтложенноеОтражение.СчетУчетаЗатрат,
		|	ВременнаяТаблицаНачисленияОтложенноеОтражение.СчетУчета,
		|	ВременнаяТаблицаНачисленияОтложенноеОтражение.СтатьяЗатрат,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	ВременнаяТаблицаНачисленияОтложенноеОтражение.ФизЛицо,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	СУММА(ВременнаяТаблицаНачисленияОтложенноеОтражение.Результат),
		|	&ВалютаРегламентированногоУчета,
		|	СУММА(ВременнаяТаблицаНачисленияОтложенноеОтражение.Результат),
		|	&ВалютаРегламентированногоУчета,
		|	СУММА(ВременнаяТаблицаНачисленияОтложенноеОтражение.Результат),
		|	""Отложенное отражение по начислению заработной платы""
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаНачисленияОтложенноеОтражение КАК ВременнаяТаблицаНачисленияОтложенноеОтражение
		|		ПО (ИСТИНА)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаНачисленияОтложенноеОтражение.СчетУчета,
		|	ВременнаяТаблицаНачисленияОтложенноеОтражение.СчетУчетаЗатрат,
		|	ВременнаяТаблицаНачисленияОтложенноеОтражение.ФизЛицо,
		|	ВременнаяТаблицаНачисленияОтложенноеОтражение.СтатьяЗатрат
		|
		|	ИМЕЮЩИЕ
		|		НЕ СУММА(ВременнаяТаблицаНачисленияОтложенноеОтражение.Результат) = 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		// ПрофВзнос
		|ВЫБРАТЬ
		|	11,
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	&СчетУчета,
		|	&СчетУчетаРасчетовПрофВзнос,
		|	ВременнаяТаблицаНалоги.ФизЛицо,
		|	НЕОПРЕДЕЛЕНО,
		|	Значение(ПланВидовРасчета.ВидыНалогов.ПрофВзнос),
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	ВременнаяТаблицаНалоги.ПрофВзнос,
		|	&ВалютаРегламентированногоУчета,
		|	ВременнаяТаблицаНалоги.ПрофВзнос,
		|	&ВалютаРегламентированногоУчета,
		|	ВременнаяТаблицаНалоги.ПрофВзнос,
		|	""Профсоюзные отчисления с сотрудника""
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаНалоги КАК ВременнаяТаблицаНалоги
		|		ПО (ИСТИНА)
		|ГДЕ
		|	НЕ ВременнаяТаблицаНалоги.ПрофВзнос = 0";
		
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", СтруктураДополнительныеСвойства.ДляПроведения.ВалютаРегламентированногоУчета);	
	Запрос.УстановитьПараметр("СчетУчета", СтруктураДополнительныеСвойства.ДляПроведения.ДанныеУчетнойПолитикиПоПерсоналу.СчетУчета);	
	Запрос.УстановитьПараметр("СчетУчетаРасчетовПФР", СтруктураДополнительныеСвойства.ДляПроведения.ДанныеУчетнойПолитикиПоПерсоналу.СчетУчетаРасчетовПФР);	
	Запрос.УстановитьПараметр("СчетУчетаРасчетовГНПФР", СтруктураДополнительныеСвойства.ДляПроведения.ДанныеУчетнойПолитикиПоПерсоналу.СчетУчетаРасчетовГНПФР);	
	Запрос.УстановитьПараметр("СчетУчетаРасчетовПрофВзнос", СтруктураДополнительныеСвойства.ДляПроведения.ДанныеУчетнойПолитикиПоПерсоналу.СчетУчетаРасчетовПрофВзнос);	
	Запрос.УстановитьПараметр("СчетУчетаРасчетовПФФ", СтруктураДополнительныеСвойства.ДляПроведения.ДанныеУчетнойПолитикиПоПерсоналу.СчетУчетаРасчетовПФФ);	
	Запрос.УстановитьПараметр("СчетУчетаРасчетовМСФ", СтруктураДополнительныеСвойства.ДляПроведения.ДанныеУчетнойПолитикиПоПерсоналу.СчетУчетаРасчетовМСФ);	
	Запрос.УстановитьПараметр("СчетУчетаРасчетовФОТФ", СтруктураДополнительныеСвойства.ДляПроведения.ДанныеУчетнойПолитикиПоПерсоналу.СчетУчетаРасчетовФОТФ);	
	Запрос.УстановитьПараметр("СчетУчетаРасчетовПН", ПланыСчетов.Хозрасчетный.ПодоходныйНалогНаДоходыСотрудников);	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаХозрасчетный", РезультатЗапроса.Выгрузить());
КонецПроцедуры // СформироватьТаблицаХозрасчетный()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаУдержания(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(ВременнаяТаблицаШапка.Дата, МЕСЯЦ) КАК ПериодРегистрации,
		|	НАЧАЛОПЕРИОДА(ВременнаяТаблицаШапка.Дата, МЕСЯЦ) КАК БазовыйПериодНачало,
		|	КОНЕЦПЕРИОДА(ВременнаяТаблицаШапка.Дата, ДЕНЬ) КАК БазовыйПериодКонец,
		|	ТаблицаДокумента.ВидРасчета,
		|	ТаблицаДокумента.ФизЛицо,
		|	ВременнаяТаблицаШапка.Организация,
		|	ТаблицаДокумента.Размер,
		|	ТаблицаДокумента.Результат
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаУдержания КАК ТаблицаДокумента
		|		ПО (ИСТИНА)";
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУдержания", РезультатЗапроса.Выгрузить());
КонецПроцедуры // СформироватьТаблицаУдержания()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаВзаиморасчетыССотрудниками(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаНалоги.ФизЛицо,
		|	ВременнаяТаблицаНалоги.ПФР + ВременнаяТаблицаНалоги.ГНПФР + ВременнаяТаблицаНалоги.ПН + ВременнаяТаблицаНалоги.ПрофВзнос  КАК Сумма
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаНалоги КАК ВременнаяТаблицаНалоги
		|		ПО (ИСТИНА)
		|ГДЕ
		|	НЕ ВременнаяТаблицаНалоги.ПФР + ВременнаяТаблицаНалоги.ГНПФР + ВременнаяТаблицаНалоги.ПН + ВременнаяТаблицаНалоги.ПрофВзнос = 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	ТаблицаДокумента.ФизЛицо,
		|	ТаблицаДокумента.Результат
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаУдержания КАК ТаблицаДокумента
		|		ПО (ИСТИНА)
		|ГДЕ
		|	НЕ ТаблицаДокумента.Результат = 0";
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВзаиморасчетыССотрудниками", РезультатЗапроса.Выгрузить());
КонецПроцедуры // СформироватьТаблицаВзаиморасчетыССотрудниками()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаСоциальныйФонд(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВложенныйЗапрос.Период,
		|	ВложенныйЗапрос.Организация,
		|	ВложенныйЗапрос.ФизЛицо,
		|	СУММА(ВложенныйЗапрос.ПФФ) КАК ПФФ,
		|	СУММА(ВложенныйЗапрос.МСФ) КАК МСФ,
		|	СУММА(ВложенныйЗапрос.ФОТФ) КАК ФОТФ,
		|	СУММА(ВложенныйЗапрос.ПФР) КАК ПФР,
		|	СУММА(ВложенныйЗапрос.ГНПФР) КАК ГНПФР,
		|	СУММА(ВложенныйЗапрос.МСР) КАК МСР,
		|	СУММА(ВложенныйЗапрос.ОблагаемаяСуммаДохода) КАК ОблагаемаяСуммаДохода,
		|	СУММА(ВложенныйЗапрос.КорПФФ) КАК КорПФФ,
		|	СУММА(ВложенныйЗапрос.КорМСФ) КАК КорМСФ,
		|	СУММА(ВложенныйЗапрос.КорФОТФ) КАК КорФОТФ,
		|	СУММА(ВложенныйЗапрос.ПриведеннаяСЗП) КАК ПриведеннаяСЗП
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВременнаяТаблицаШапка.Дата КАК Период,
		|		ВременнаяТаблицаШапка.Организация КАК Организация,
		|		ВременнаяТаблицаНалоги.ФизЛицо КАК ФизЛицо,
		|		0 КАК ПФФ,
		|		0 КАК МСФ,
		|		0 КАК ФОТФ,
		|		ВременнаяТаблицаНалоги.ПФР КАК ПФР,
		|		ВременнаяТаблицаНалоги.ГНПФР КАК ГНПФР,
		|		ВременнаяТаблицаНалоги.МСР КАК МСР,
		|		ВременнаяТаблицаНалоги.РасчетнаяБазаСФ КАК ОблагаемаяСуммаДохода,
		|		0 КАК КорПФФ,
		|		0 КАК КорМСФ,
		|		0 КАК КорФОТФ,
		|		0 КАК ПриведеннаяСЗП
		|	ИЗ
		|		ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаНалоги КАК ВременнаяТаблицаНалоги
		|			ПО (ИСТИНА)
		|	ГДЕ
		|		НЕ ВременнаяТаблицаНалоги.РасчетнаяБазаСФ = 0
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВременнаяТаблицаШапка.Дата,
		|		ВременнаяТаблицаШапка.Организация,
		|		ВременнаяТаблицаНалогиСОрганизации.ФизЛицо,
		|		ВременнаяТаблицаНалогиСОрганизации.ПФФ,
		|		ВременнаяТаблицаНалогиСОрганизации.МСФ,
		|		ВременнаяТаблицаНалогиСОрганизации.ФОТФ,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0
		|	ИЗ
		|		ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаНалогиСОрганизации КАК ВременнаяТаблицаНалогиСОрганизации
		|			ПО (ИСТИНА)
		|	ГДЕ
		|		НЕ ВременнаяТаблицаНалогиСОрганизации.РасчетнаяБазаСФ = 0) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Период,
		|	ВложенныйЗапрос.Организация,
		|	ВложенныйЗапрос.ФизЛицо";
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСоциальныйФонд", РезультатЗапроса.Выгрузить());
КонецПроцедуры // СформироватьТаблицаСоциальныйФонд()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаПодоходныйНалог(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =		
		"ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаНалоги.ФизЛицо,
		|	0 КАК ДоплатаПН,
		|	0 КАК МРД,
		|	ВременнаяТаблицаНалоги.РасчетнаяБазаПН КАК ОДПН,
		|	ВременнаяТаблицаНалоги.РасчетнаяБазаСФ КАК ОДСФ,
		|	ВременнаяТаблицаНалоги.Вычеты + ВременнаяТаблицаНалоги.ДопВычет КАК ПиИВычеты,
		|	ВременнаяТаблицаНалоги.ПН КАК ПН,
		|	ВременнаяТаблицаНалоги.ПФР КАК ПФР,
		|	ВременнаяТаблицаНалоги.ГНПФР КАК ГНПФР,
		|	0 КАК МСР,
		|	ВременнаяТаблицаНалоги.СуммаНачислено КАК ВсегоНачислено,
		|	ВременнаяТаблицаНалоги.ОтработаноДней КАК ОтработаноДней
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаНалоги КАК ВременнаяТаблицаНалоги
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВременнаяТаблицаНалоги.ПН <> 0";
		
		РезультатЗапроса = Запрос.Выполнить();
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПодоходныйНалог", РезультатЗапроса.Выгрузить());
	КонецПроцедуры // СформироватьТаблицаПодоходныйНалог()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаНалогиПоЗаработнойПлате(ДокументСсылка,СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВложенныйЗапрос.Период,
		|	ВложенныйЗапрос.Организация,
		|	ВложенныйЗапрос.ФизЛицо,
		|	ВложенныйЗапрос.ВидНалога,
		|	СУММА(ВложенныйЗапрос.Сумма) КАК Сумма
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВременнаяТаблицаШапка.Дата КАК Период,
		|		ВременнаяТаблицаШапка.Организация КАК Организация,
		|		ВременнаяТаблицаНалоги.ФизЛицо КАК ФизЛицо,
		|		ЗНАЧЕНИЕ(ПланВидовРасчета.ВидыНалогов.ПФР) КАК ВидНалога, 
		|		ВременнаяТаблицаНалоги.ПФР КАК Сумма
		|	ИЗ
		|		ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаНалоги КАК ВременнаяТаблицаНалоги
		|			ПО (ИСТИНА)
		|	ГДЕ
		|		НЕ ВременнаяТаблицаНалоги.ПФР = 0
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВременнаяТаблицаШапка.Дата,
		|		ВременнаяТаблицаШапка.Организация,
		|		ВременнаяТаблицаНалоги.ФизЛицо,
		|		ЗНАЧЕНИЕ(ПланВидовРасчета.ВидыНалогов.ГНПФР),
		|		ВременнаяТаблицаНалоги.ГНПФР
		|	ИЗ
		|		ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаНалоги КАК ВременнаяТаблицаНалоги
		|			ПО (ИСТИНА)
		|	ГДЕ
		|		НЕ ВременнаяТаблицаНалоги.ГНПФР = 0
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВременнаяТаблицаШапка.Дата,
		|		ВременнаяТаблицаШапка.Организация,
		|		ВременнаяТаблицаНалоги.ФизЛицо,
		|		ЗНАЧЕНИЕ(ПланВидовРасчета.ВидыНалогов.ПН),
		|		ВременнаяТаблицаНалоги.ПН
		|	ИЗ
		|		ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаНалоги КАК ВременнаяТаблицаНалоги
		|			ПО (ИСТИНА)
		|	ГДЕ
		|		НЕ ВременнаяТаблицаНалоги.ПН = 0
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВременнаяТаблицаШапка.Дата,
		|		ВременнаяТаблицаШапка.Организация,
		|		ВременнаяТаблицаНалоги.ФизЛицо,
		|		ВременнаяТаблицаНалоги.ВидНалогаПрофвзнос КАК ВидНалогаПрофвзнос,
		|		ВременнаяТаблицаНалоги.ПрофВзнос
		|	ИЗ
		|		ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаНалоги КАК ВременнаяТаблицаНалоги
		|			ПО (ИСТИНА)
		|	ГДЕ
		|		НЕ ВременнаяТаблицаНалоги.ПрофВзнос = 0
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВременнаяТаблицаШапка.Дата,
		|		ВременнаяТаблицаШапка.Организация,
		|		ВременнаяТаблицаНалогиСОрганизации.ФизЛицо,
		|		ЗНАЧЕНИЕ(ПланВидовРасчета.ВидыНалогов.ПФФ),
		|		ВременнаяТаблицаНалогиСОрганизации.ПФФ
		|	ИЗ
		|		ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаНалогиСОрганизации КАК ВременнаяТаблицаНалогиСОрганизации
		|			ПО (ИСТИНА)
		|	ГДЕ
		|		НЕ ВременнаяТаблицаНалогиСОрганизации.ПФФ = 0
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВременнаяТаблицаШапка.Дата,
		|		ВременнаяТаблицаШапка.Организация,
		|		ВременнаяТаблицаНалогиСОрганизации.ФизЛицо,
		|		ЗНАЧЕНИЕ(ПланВидовРасчета.ВидыНалогов.МСФ),
		|		ВременнаяТаблицаНалогиСОрганизации.МСФ
		|	ИЗ
		|		ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаНалогиСОрганизации КАК ВременнаяТаблицаНалогиСОрганизации
		|			ПО (ИСТИНА)
		|	ГДЕ
		|		НЕ ВременнаяТаблицаНалогиСОрганизации.МСФ = 0
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВременнаяТаблицаШапка.Дата,
		|		ВременнаяТаблицаШапка.Организация,
		|		ВременнаяТаблицаНалогиСОрганизации.ФизЛицо,
		|		ЗНАЧЕНИЕ(ПланВидовРасчета.ВидыНалогов.ФОТФ),
		|		ВременнаяТаблицаНалогиСОрганизации.ФОТФ
		|	ИЗ
		|		ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаНалогиСОрганизации КАК ВременнаяТаблицаНалогиСОрганизации
		|			ПО (ИСТИНА)
		|	ГДЕ
		|		НЕ ВременнаяТаблицаНалогиСОрганизации.ФОТФ = 0) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Период,
		|	ВложенныйЗапрос.Организация,
		|	ВложенныйЗапрос.ФизЛицо,
		|	ВложенныйЗапрос.ВидНалога";
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаНалогиПоЗаработнойПлате", РезультатЗапроса.Выгрузить());
КонецПроцедуры

Процедура СформироватьТаблицуДляОтчетаПоПН(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	&Организация КАК Организация,
	|	ВременнаяТаблицаНалоги.ФизЛицо КАК ФизЛицо,
	|	СУММА(ВременнаяТаблицаНалоги.РасчетнаяБазаПН) КАК ОДПН,
	|	СУММА(ВременнаяТаблицаНалоги.ПН) КАК ПН,
	|	СУММА(ВЫБОР
	|			КОГДА &МРД > ВременнаяТаблицаНалоги.РасчетнаяБазаПН
	|				ТОГДА &МРД / 100 * ЕСТЬNULL(ВременнаяТаблицаСтатусы.СтавкаПН, 0) - ВременнаяТаблицаНалоги.ПН
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ДоплатаПН,
	|	ВременнаяТаблицаНалоги.СуммаНачислено КАК ВсегоНачислено,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВременнаяТаблицаНалоги.ФизЛицо) КАК Количество,
	|	ВременнаяТаблицаНалоги.ОтработаноДней КАК ОтработаноДней,
	|	ВременнаяТаблицаСтатусы.Статус КАК Статус,
	|	ВременнаяТаблицаСотрудники.Подразделение КАК Подразделение,
	|	ВЫБОР
	|		КОГДА НЕ ВременнаяТаблицаСтатусы.Статус.НомерСтрокиВОтчетеПН = 0
	|			ТОГДА ВременнаяТаблицаСтатусы.Статус.НомерСтрокиВОтчетеПН
	|		КОГДА НЕ ВременнаяТаблицаСтатусы.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииСотрудников.Арендодатель)
	|				И НЕ ВременнаяТаблицаСтатусы.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииСотрудников.ИностранныеГраждане)
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ВременнаяТаблицаСтатусы.Больше15дней, ИСТИНА)
	|						ТОГДА 1
	|					ИНАЧЕ 2
	|				КОНЕЦ
	|		КОГДА ВременнаяТаблицаСтатусы.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииСотрудников.Арендодатель)
	|			ТОГДА 4
	|		КОГДА ВременнаяТаблицаСтатусы.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииСотрудников.ИностранныеГраждане)
	|			ТОГДА 3
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК НомерСтроки,
	|	ВременнаяТаблицаНалоги.Вычеты * 100 + ВременнаяТаблицаНалоги.ДопВычет КАК Вычеты
	|ПОМЕСТИТЬ ВременнаяТаблицаСборкаПН
	|ИЗ
	|	ВременнаяТаблицаНалоги КАК ВременнаяТаблицаНалоги
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСтатусы КАК ВременнаяТаблицаСтатусы
	|		ПО ВременнаяТаблицаНалоги.ФизЛицо = ВременнаяТаблицаСтатусы.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСотрудники КАК ВременнаяТаблицаСотрудники
	|		ПО ВременнаяТаблицаНалоги.ФизЛицо = ВременнаяТаблицаСотрудники.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаОтработаноДней КАК ВременнаяТаблицаОтработаноДней
	|		ПО ВременнаяТаблицаНалоги.ФизЛицо = ВременнаяТаблицаОтработаноДней.ФизЛицо
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаНалоги.СуммаНачислено,
	|	ВременнаяТаблицаНалоги.Вычеты * 100 + ВременнаяТаблицаНалоги.ДопВычет,
	|	ВременнаяТаблицаСтатусы.Статус,
	|	ВременнаяТаблицаСотрудники.Подразделение,
	|	ВременнаяТаблицаНалоги.ОтработаноДней,
	|	ВременнаяТаблицаНалоги.ФизЛицо,
	|	ВЫБОР
	|		КОГДА НЕ ВременнаяТаблицаСтатусы.Статус.НомерСтрокиВОтчетеПН = 0
	|			ТОГДА ВременнаяТаблицаСтатусы.Статус.НомерСтрокиВОтчетеПН
	|		КОГДА НЕ ВременнаяТаблицаСтатусы.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииСотрудников.Арендодатель)
	|				И НЕ ВременнаяТаблицаСтатусы.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииСотрудников.ИностранныеГраждане)
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ВременнаяТаблицаСтатусы.Больше15дней, ИСТИНА)
	|						ТОГДА 1
	|					ИНАЧЕ 2
	|				КОНЕЦ
	|		КОГДА ВременнаяТаблицаСтатусы.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииСотрудников.Арендодатель)
	|			ТОГДА 4
	|		КОГДА ВременнаяТаблицаСтатусы.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииСотрудников.ИностранныеГраждане)
	|			ТОГДА 3
	|		ИНАЧЕ 1
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаСборкаПН.Период,
	|	ВременнаяТаблицаСборкаПН.Организация,
	|	ВременнаяТаблицаСборкаПН.Подразделение,
	|	СтрокиОтчетаПН.Ссылка КАК СтрокаОтчета,
	|	ВременнаяТаблицаСборкаПН.Количество,
	|	ВременнаяТаблицаСборкаПН.ВсегоНачислено,
	|	ВременнаяТаблицаСборкаПН.ВсегоНачислено - ВременнаяТаблицаСборкаПН.ОДПН КАК Необлагаемая,
	|	ВременнаяТаблицаСборкаПН.Вычеты КАК ПиИВычеты,
	|	ВременнаяТаблицаСборкаПН.ОДПН КАК Облагаемая,
	|	ВременнаяТаблицаСборкаПН.ПН КАК ПНСотрудника,
	|	ВременнаяТаблицаСборкаПН.ДоплатаПН,
	|	ВременнаяТаблицаСборкаПН.ПН + ВременнаяТаблицаСборкаПН.ДоплатаПН КАК ВсегоПН,
	|	ВременнаяТаблицаСборкаПН.ФизЛицо
	|ИЗ
	|	ВременнаяТаблицаСборкаПН КАК ВременнаяТаблицаСборкаПН
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтрокиОтчетаПН КАК СтрокиОтчетаПН
	|		ПО ВременнаяТаблицаСборкаПН.НомерСтроки = СтрокиОтчетаПН.НомерСтроки";
	
	Запрос.УстановитьПараметр("МРД", СтруктураДополнительныеСвойства.ДляПроведения.ДанныеУчетнойПолитикиПоПерсоналу.МинимальныйРасчетныйДоход);
	Запрос.УстановитьПараметр("Период", КонецМесяца(СтруктураДополнительныеСвойства.ДляПроведения.Дата));
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОтчетПоПодоходномуНалогу", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

Процедура СформироватьТаблицуДляОтчетаПоЕжемесячномуОтчетуПоСФ(ДокументСсылка, СтруктураДополнительныеСвойства);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГрафикиРаботы.ГрафикРаботы,
	|	СУММА(ГрафикиРаботы.ЗначениеДней) КАК НормаДней
	|ПОМЕСТИТЬ ТаблицаНормыДней
	|ИЗ
	|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ГрафикиРаботы
	|ГДЕ
	|	ГрафикиРаботы.ГрафикРаботы В
	|			(ВЫБРАТЬ
	|				ВременнаяТаблицаСотрудники.ГрафикРаботы
	|			ИЗ
	|				ВременнаяТаблицаСотрудники КАК ВременнаяТаблицаСотрудники)
	|	И ГрафикиРаботы.Год = ГОД(&Период)
	|	И ГрафикиРаботы.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ) И КОНЕЦПЕРИОДА(&Период, МЕСЯЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ГрафикиРаботы.ГрафикРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаНалогиСОрганизации.ФизЛицо КАК ФизЛицо,
	|	СУММА(ВременнаяТаблицаНалогиСОрганизации.ПФФ) КАК ПФФ,
	|	СУММА(ВременнаяТаблицаНалогиСОрганизации.МСФ) КАК МСФ,
	|	СУММА(ВременнаяТаблицаНалогиСОрганизации.ФОТФ) КАК ФОТФ
	|ПОМЕСТИТЬ ВременнаяТаблицаНалогиСОрганизацииСгруппиров
	|ИЗ
	|	ВременнаяТаблицаНалогиСОрганизации КАК ВременнаяТаблицаНалогиСОрганизации
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаНалогиСОрганизации.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Период КАК Период,
	|	&Организация,
	|	ВременнаяТаблицаСотрудники.Подразделение КАК Подразделение,
	|	ВременнаяТаблицаНалоги.ФизЛицо КАК ФизЛицо,
	|	ВременнаяТаблицаСтатусы.Категория КАК Категория,
	|	ВременнаяТаблицаСтатусы.Статус КАК Статус,
	|	ВременнаяТаблицаНалоги.РасчетнаяБазаСФ КАК ФОТ,
	|	ВременнаяТаблицаНалоги.ГНПФР КАК ГНПФР,
	|	ВременнаяТаблицаНалоги.ПФР + ВременнаяТаблицаНалогиСОрганизации.ПФФ + ВременнаяТаблицаНалогиСОрганизации.МСФ + ВременнаяТаблицаНалогиСОрганизации.ФОТФ + ВременнаяТаблицаНалоги.МСР КАК НачисленыеВзносы,
	|	ВременнаяТаблицаНалоги.ОтработаноДней КАК ФактДней,
	|	ТаблицаНормыДней.НормаДней,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаСтатусы.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииСотрудников.Арендодатель)
	|			ТОГДА &СреднемесячнаяЗПСФ
	|		ИНАЧЕ &СреднемесячнаяЗПСФ / 100 * &ПроцентОтСЗПСФ / ТаблицаНормыДней.НормаДней * ВременнаяТаблицаНалоги.ОтработаноДней
	|	КОНЕЦ КАК ПриведеннаяСЗП
	|ПОМЕСТИТЬ ВременнаяТаблицаДляСоциальногоФонда
	|ИЗ
	|	ВременнаяТаблицаНалоги КАК ВременнаяТаблицаНалоги
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСотрудники КАК ВременнаяТаблицаСотрудники
	|			ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаНормыДней КАК ТаблицаНормыДней
	|			ПО ВременнаяТаблицаСотрудники.ГрафикРаботы = ТаблицаНормыДней.ГрафикРаботы
	|		ПО ВременнаяТаблицаНалоги.ФизЛицо = ВременнаяТаблицаСотрудники.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСтатусы КАК ВременнаяТаблицаСтатусы
	|		ПО ВременнаяТаблицаНалоги.ФизЛицо = ВременнаяТаблицаСтатусы.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаНалогиСОрганизацииСгруппиров КАК ВременнаяТаблицаНалогиСОрганизации
	|		ПО ВременнаяТаблицаНалоги.ФизЛицо = ВременнаяТаблицаНалогиСОрганизации.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаСоцФонд.Период,
	|	ВременнаяТаблицаСоцФонд.Организация,
	|	ВременнаяТаблицаСоцФонд.Подразделение,
	|	ВременнаяТаблицаСоцФонд.ФизЛицо,
	|	ВременнаяТаблицаСоцФонд.Категория,
	|	ВременнаяТаблицаСоцФонд.ФОТ,
	|	ВременнаяТаблицаСоцФонд.ГНПФР,
	|	ВременнаяТаблицаСоцФонд.НачисленыеВзносы,
	|	ВременнаяТаблицаСоцФонд.ФактДней,
	|	ВременнаяТаблицаСоцФонд.НормаДней,
	|	ВременнаяТаблицаСоцФонд.ПриведеннаяСЗП,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаСоцФонд.ПриведеннаяСЗП > ВременнаяТаблицаСоцФонд.ФОТ
	|			ТОГДА ВременнаяТаблицаСоцФонд.ПриведеннаяСЗП - ВременнаяТаблицаСоцФонд.ФОТ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДопФОТ
	|ИЗ
	|	ВременнаяТаблицаДляСоциальногоФонда КАК ВременнаяТаблицаСоцФонд";
	
	Запрос.УстановитьПараметр("СреднемесячнаяЗПСФ", СтруктураДополнительныеСвойства.ДляПроведения.ДанныеУчетнойПолитикиПоПерсоналу.СреднемесячнаяЗПСФ);
	Запрос.УстановитьПараметр("ПроцентОтСЗПСФ", СтруктураДополнительныеСвойства.ДляПроведения.ДанныеУчетнойПолитикиПоПерсоналу.ПроцентОтСЗПСФ);
	Запрос.УстановитьПараметр("Период", КонецМесяца(СтруктураДополнительныеСвойства.ДляПроведения.Дата));
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);

	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДанныеДляОтчетаПоЕжемесячномуСФ", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

Процедура СформироватьТаблицуДляОтчетаПоКвартальномуОтчетуПоСФ(ДокументСсылка, СтруктураДополнительныеСвойства);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВременнаяТаблицаДляСоциальногоФонда.Период,
	|	ВременнаяТаблицаДляСоциальногоФонда.Организация,
	|	ВременнаяТаблицаДляСоциальногоФонда.Подразделение,
	|	ВременнаяТаблицаДляСоциальногоФонда.ФизЛицо,
	|	ВременнаяТаблицаДляСоциальногоФонда.Категория,
	|	ВременнаяТаблицаДляСоциальногоФонда.ПриведеннаяСЗП,
	|	ВременнаяТаблицаДляСоциальногоФонда.ФОТ,
	|	ВременнаяТаблицаДляСоциальногоФонда.ГНПФР,
	|	ВременнаяТаблицаДляСоциальногоФонда.НачисленыеВзносы,
	|	ВременнаяТаблицаДляСоциальногоФонда.ФактДней,
	|	ВременнаяТаблицаДляСоциальногоФонда.НормаДней,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаДляСоциальногоФонда.ПриведеннаяСЗП > ВременнаяТаблицаДляСоциальногоФонда.ФОТ
	|			ТОГДА ВременнаяТаблицаДляСоциальногоФонда.ПриведеннаяСЗП - ВременнаяТаблицаДляСоциальногоФонда.ФОТ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДопФОТ,
	|	ВременнаяТаблицаДляСоциальногоФонда.Статус.ПоказательВОтчетеПоКвартальномуСоцфонду КАК ПоказательВОтчетеПоКвартальномуСоцфонду
	|ПОМЕСТИТЬ ВТСоцфонд
	|ИЗ
	|	ВременнаяТаблицаДляСоциальногоФонда КАК ВременнаяТаблицаДляСоциальногоФонда
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСоцфонд.Период,
	|	ВТСоцфонд.Организация,
	|	ВТСоцфонд.Подразделение,
	|	ВТСоцфонд.ФизЛицо,
	|	ЗНАЧЕНИЕ(Справочник.СтрокиОтчетаПоСФКвартальному.ЧисленостьРаботающихЧеловекВсего) КАК Показатель,
	|	ВЫБОР
	|		КОГДА ВТСоцфонд.ПриведеннаяСЗП > ВТСоцфонд.ФОТ
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЗначениеМеньшеСЗП,
	|	ВЫБОР
	|		КОГДА ВТСоцфонд.ПриведеннаяСЗП <= ВТСоцфонд.ФОТ
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЗначениеБольшеСЗП
	|ПОМЕСТИТЬ ВТСборка
	|ИЗ
	|	ВТСоцфонд КАК ВТСоцфонд
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТСоцфонд.Период,
	|	ВТСоцфонд.Организация,
	|	ВТСоцфонд.Подразделение,
	|	ВТСоцфонд.ФизЛицо,
	|	ЗНАЧЕНИЕ(Справочник.СтрокиОтчетаПоСФКвартальному.ФондПотребленияНаКоторыйНачисленыВзносыФОТВТомЧисле),
	|	ВЫБОР
	|		КОГДА ВТСоцфонд.ПриведеннаяСЗП > ВТСоцфонд.ФОТ
	|			ТОГДА ВТСоцфонд.ФОТ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТСоцфонд.ПриведеннаяСЗП <= ВТСоцфонд.ФОТ
	|			ТОГДА ВТСоцфонд.ФОТ
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	ВТСоцфонд КАК ВТСоцфонд
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТСоцфонд.Период,
	|	ВТСоцфонд.Организация,
	|	ВТСоцфонд.Подразделение,
	|	ВТСоцфонд.ФизЛицо,
	|	ЗНАЧЕНИЕ(Справочник.СтрокиОтчетаПоСФКвартальному.ФондПотребленияИнвалидов1И2Группы),
	|	ВЫБОР
	|		КОГДА ВТСоцфонд.ПриведеннаяСЗП > ВТСоцфонд.ФОТ
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТСоцфонд.ПриведеннаяСЗП <= ВТСоцфонд.ФОТ
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	ВТСоцфонд КАК ВТСоцфонд
	|ГДЕ
	|	ВТСоцфонд.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииСотрудников.Инвалид1_2гр)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТСоцфонд.Период,
	|	ВТСоцфонд.Организация,
	|	ВТСоцфонд.Подразделение,
	|	ВТСоцфонд.ФизЛицо,
	|	ЗНАЧЕНИЕ(Справочник.СтрокиОтчетаПоСФКвартальному.КоличествоИнвалидов1И2Группы),
	|	ВЫБОР
	|		КОГДА ВТСоцфонд.ПриведеннаяСЗП > ВТСоцфонд.ФОТ
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТСоцфонд.ПриведеннаяСЗП <= ВТСоцфонд.ФОТ
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	ВТСоцфонд КАК ВТСоцфонд
	|ГДЕ
	|	ВТСоцфонд.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииСотрудников.Инвалид1_2гр)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТСоцфонд.Период,
	|	ВТСоцфонд.Организация,
	|	ВТСоцфонд.Подразделение,
	|	ВТСоцфонд.ФизЛицо,
	|	ЗНАЧЕНИЕ(Справочник.СтрокиОтчетаПоСФКвартальному.ФондПотребленияИностранныхГражданВременноПребывающихВКР),
	|	ВЫБОР
	|		КОГДА ВТСоцфонд.ПриведеннаяСЗП > ВТСоцфонд.ФОТ
	|			ТОГДА ВТСоцфонд.ФОТ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТСоцфонд.ПриведеннаяСЗП <= ВТСоцфонд.ФОТ
	|			ТОГДА ВТСоцфонд.ФОТ
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	ВТСоцфонд КАК ВТСоцфонд
	|ГДЕ
	|	ВТСоцфонд.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииСотрудников.ИностранныеГраждане)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТСоцфонд.Период,
	|	ВТСоцфонд.Организация,
	|	ВТСоцфонд.Подразделение,
	|	ВТСоцфонд.ФизЛицо,
	|	ЗНАЧЕНИЕ(Справочник.СтрокиОтчетаПоСФКвартальному.КолвоИнострГражданВременноПребыващихВКР),
	|	ВЫБОР
	|		КОГДА ВТСоцфонд.ПриведеннаяСЗП > ВТСоцфонд.ФОТ
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТСоцфонд.ПриведеннаяСЗП <= ВТСоцфонд.ФОТ
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	ВТСоцфонд КАК ВТСоцфонд
	|ГДЕ
	|	ВТСоцфонд.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииСотрудников.ИностранныеГраждане)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТСоцфонд.Период,
	|	ВТСоцфонд.Организация,
	|	ВТСоцфонд.Подразделение,
	|	ВТСоцфонд.ФизЛицо,
	|	ЗНАЧЕНИЕ(Справочник.СтрокиОтчетаПоСФКвартальному.Фонд64_69),
	|	ВЫБОР
	|		КОГДА ВТСоцфонд.ПриведеннаяСЗП > ВТСоцфонд.ФОТ
	|			ТОГДА ВТСоцфонд.ФОТ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТСоцфонд.ПриведеннаяСЗП <= ВТСоцфонд.ФОТ
	|			ТОГДА ВТСоцфонд.ФОТ
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	ВТСоцфонд КАК ВТСоцфонд
	|ГДЕ
	|	Выбор Когда ВТСоцфонд.Физлицо.Пол = Значение(Перечисление.ПолФизическогоЛица.Мужской) тогда
	|		ВТСоцфонд.ФизЛицо.ДатаРождения = &ДатаМ
	|	Когда ВТСоцфонд.Физлицо.Пол = Значение(Перечисление.ПолФизическогоЛица.Женский) тогда
	|		ВТСоцфонд.ФизЛицо.ДатаРождения = &ДатаЖ
	|	конец
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТСоцфонд.Период,
	|	ВТСоцфонд.Организация,
	|	ВТСоцфонд.Подразделение,
	|	ВТСоцфонд.ФизЛицо,
	|	ЗНАЧЕНИЕ(Справочник.СтрокиОтчетаПоСФКвартальному.Кол64_69),
	|	ВЫБОР
	|		КОГДА ВТСоцфонд.ПриведеннаяСЗП > ВТСоцфонд.ФОТ
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТСоцфонд.ПриведеннаяСЗП <= ВТСоцфонд.ФОТ
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	ВТСоцфонд КАК ВТСоцфонд
	|	ГДЕ
	|		Выбор Когда ВТСоцфонд.Физлицо.Пол = Значение(Перечисление.ПолФизическогоЛица.Мужской) тогда
	|			ВТСоцфонд.ФизЛицо.ДатаРождения = &ДатаМ
	|		Когда ВТСоцфонд.Физлицо.Пол = Значение(Перечисление.ПолФизическогоЛица.Женский) тогда
	|			ВТСоцфонд.ФизЛицо.ДатаРождения = &ДатаЖ
	|		конец
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТСоцфонд.Период,
	|	ВТСоцфонд.Организация,
	|	ВТСоцфонд.Подразделение,
	|	ВТСоцфонд.ФизЛицо,
	|	ЗНАЧЕНИЕ(Справочник.СтрокиОтчетаПоСФКвартальному.ФондПотреблПенсионеров),
	|	ВЫБОР
	|		КОГДА ВТСоцфонд.ПриведеннаяСЗП > ВТСоцфонд.ФОТ
	|			ТОГДА ВТСоцфонд.ФОТ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТСоцфонд.ПриведеннаяСЗП <= ВТСоцфонд.ФОТ
	|			ТОГДА ВТСоцфонд.ФОТ
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	ВТСоцфонд КАК ВТСоцфонд
	|ГДЕ
	|	ВТСоцфонд.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииСотрудников.Пенсионер)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТСоцфонд.Период,
	|	ВТСоцфонд.Организация,
	|	ВТСоцфонд.Подразделение,
	|	ВТСоцфонд.ФизЛицо,
	|	ЗНАЧЕНИЕ(Справочник.СтрокиОтчетаПоСФКвартальному.КолвоПенсионеров),
	|	ВЫБОР
	|		КОГДА ВТСоцфонд.ПриведеннаяСЗП > ВТСоцфонд.ФОТ
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТСоцфонд.ПриведеннаяСЗП <= ВТСоцфонд.ФОТ
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	ВТСоцфонд КАК ВТСоцфонд
	|ГДЕ
	|	ВТСоцфонд.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииСотрудников.Пенсионер)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТСоцфонд.Период,
	|	ВТСоцфонд.Организация,
	|	ВТСоцфонд.Подразделение,
	|	ВТСоцфонд.ФизЛицо,
	|	ЗНАЧЕНИЕ(Справочник.СтрокиОтчетаПоСФКвартальному.ФондПотрУчастнИнвалидовВОВ),
	|	ВЫБОР
	|		КОГДА ВТСоцфонд.ПриведеннаяСЗП > ВТСоцфонд.ФОТ
	|			ТОГДА ВТСоцфонд.ФОТ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТСоцфонд.ПриведеннаяСЗП <= ВТСоцфонд.ФОТ
	|			ТОГДА ВТСоцфонд.ФОТ
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	ВТСоцфонд КАК ВТСоцфонд
	|ГДЕ
	|	(ВТСоцфонд.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииСотрудников.ИнвалидВОВ1_2гр)
	|			ИЛИ ВТСоцфонд.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииСотрудников.ИнвалидВОВ3гр))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТСоцфонд.Период,
	|	ВТСоцфонд.Организация,
	|	ВТСоцфонд.Подразделение,
	|	ВТСоцфонд.ФизЛицо,
	|	ЗНАЧЕНИЕ(Справочник.СтрокиОтчетаПоСФКвартальному.КолУчастИнвалидовВОВ),
	|	ВЫБОР
	|		КОГДА ВТСоцфонд.ПриведеннаяСЗП > ВТСоцфонд.ФОТ
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТСоцфонд.ПриведеннаяСЗП <= ВТСоцфонд.ФОТ
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	ВТСоцфонд КАК ВТСоцфонд
	|ГДЕ
	|	(ВТСоцфонд.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииСотрудников.ИнвалидВОВ1_2гр)
	|			ИЛИ ВТСоцфонд.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииСотрудников.ИнвалидВОВ3гр))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТСоцфонд.Период,
	|	ВТСоцфонд.Организация,
	|	ВТСоцфонд.Подразделение,
	|	ВТСоцфонд.ФизЛицо,
	|	ЗНАЧЕНИЕ(Справочник.СтрокиОтчетаПоСФКвартальному.ФондПотрМОП),
	|	ВЫБОР
	|		КОГДА ВТСоцфонд.ПриведеннаяСЗП > ВТСоцфонд.ФОТ
	|			ТОГДА ВТСоцфонд.ФОТ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТСоцфонд.ПриведеннаяСЗП <= ВТСоцфонд.ФОТ
	|			ТОГДА ВТСоцфонд.ФОТ
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	ВТСоцфонд КАК ВТСоцфонд
	|ГДЕ
	|	ВТСоцфонд.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииСотрудников.МОП)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТСоцфонд.Период,
	|	ВТСоцфонд.Организация,
	|	ВТСоцфонд.Подразделение,
	|	ВТСоцфонд.ФизЛицо,
	|	ЗНАЧЕНИЕ(Справочник.СтрокиОтчетаПоСФКвартальному.КолвоМОП),
	|	ВЫБОР
	|		КОГДА ВТСоцфонд.ПриведеннаяСЗП > ВТСоцфонд.ФОТ
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТСоцфонд.ПриведеннаяСЗП <= ВТСоцфонд.ФОТ
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	ВТСоцфонд КАК ВТСоцфонд
	|ГДЕ
	|	ВТСоцфонд.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииСотрудников.МОП)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТСоцфонд.Период,
	|	ВТСоцфонд.Организация,
	|	ВТСоцфонд.Подразделение,
	|	ВТСоцфонд.ФизЛицо,
	|	ЗНАЧЕНИЕ(Справочник.СтрокиОтчетаПоСФКвартальному.ДополнительныйФондОплатыТруда),
	|	ВЫБОР
	|		КОГДА ВТСоцфонд.ПриведеннаяСЗП > ВТСоцфонд.ФОТ
	|			ТОГДА ВТСоцфонд.ДопФОТ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	0
	|ИЗ
	|	ВТСоцфонд КАК ВТСоцфонд
	|ГДЕ
	|	НЕ ВТСоцфонд.ДопФОТ = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСборка.Период,
	|	ВТСборка.Организация,
	|	ВТСборка.Подразделение,
	|	СтрокиОтчетаПоСФКвартальному.Ссылка КАК Показатель,
	|	ВТСборка.ФизЛицо,
	|	ВТСборка.ЗначениеМеньшеСЗП,
	|	ВТСборка.ЗначениеБольшеСЗП
	|ИЗ
	|	ВТСборка КАК ВТСборка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтрокиОтчетаПоСФКвартальному КАК СтрокиОтчетаПоСФКвартальному
	|		ПО ВТСборка.Показатель = СтрокиОтчетаПоСФКвартальному.Ссылка";
	
	Запрос.УстановитьПараметр("ДатаМ", СтруктураДополнительныеСвойства.ДляПроведения.ДанныеУчетнойПолитикиПоПерсоналу.ДатаОграниченияНачисленияГНПФМужчины);
	Запрос.УстановитьПараметр("ДатаЖ", СтруктураДополнительныеСвойства.ДляПроведения.ДанныеУчетнойПолитикиПоПерсоналу.ДатаОграниченияНачисленияГНПФЖенщины);

	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДанныеДляОтчетаПоКвартальномуСФ", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства, ДокументОбъект) Экспорт
	
	СтруктураДополнительныеСвойства.ДляПроведения.Вставить("ДанныеУчетнойПолитикиПоПерсоналу", 
	БухгалтерскийУчетСервер.ПолучитьДанныеУчетнойПолитикиПоПерсоналу(СтруктураДополнительныеСвойства.ДляПроведения.Дата,
	СтруктураДополнительныеСвойства.ДляПроведения.Организация));
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаДокумента.Дата,
		|	ТаблицаДокумента.Организация
		|ПОМЕСТИТЬ ВременнаяТаблицаШапка
		|ИЗ
		|	Документ.ЗакрытиеМесяцаЗП КАК ТаблицаДокумента
		|ГДЕ
		|	ТаблицаДокумента.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Начисления.ФизЛицо,
		|	Начисления.ВидРасчета,
		|	ВЫБОР
		|		КОГДА Начисления.ОтложенноеОтражение
		|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НачисленнаяЗаработнаяПлата)
		|		ИНАЧЕ Начисления.СчетУчетаЗатрат
		|	КОНЕЦ КАК СчетУчетаЗатрат,
		|	Начисления.СтатьяЗатрат,
		|	Начисления.Результат,
		|	Начисления.ВидРасчета.ОблагаетсяПН,
		|	Начисления.ВидРасчета.ОблагаетсяСФ,
		|	Начисления.ВидРасчета.ОблагаетсяПрофВзнос,
		|	ВЫБОР
		|		КОГДА Начисления.ВидРасчета.ЗачетОтработанногоВремени
		|			ТОГДА Начисления.ОтработаноДней
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ОтработаноДней,
		|	Начисления.ОтложенноеОтражение,
		|	Начисления.Подразделение,
		|	Начисления.Должность		
		|ПОМЕСТИТЬ ВременнаяТаблицаНачисленияЗаМесяцПредв
		|ИЗ
		|	РегистрРасчета.Начисления КАК Начисления
		|ГДЕ
		|	Начисления.ПериодРегистрации МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Начисления.Организация = &Организация
		|	И НЕ Начисления.Результат = 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Начисления.ФизЛицо,
		|	Начисления.СчетУчетаЗатрат,
		|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НачисленнаяЗаработнаяПлата) КАК СчетУчета,
		|	Начисления.СтатьяЗатрат,
		|	Начисления.Результат
		|ПОМЕСТИТЬ ВременнаяТаблицаНачисленияОтложенноеОтражение
		|ИЗ
		|	РегистрРасчета.Начисления КАК Начисления
		|ГДЕ
		|	Начисления.ПериодДействия МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Начисления.Организация = &Организация
		|	И НЕ Начисления.Результат = 0
		|	И Начисления.Регистратор ССЫЛКА Документ.Отпуск
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Удержания.ФизЛицо,
		|	Удержания.ВидРасчета,
		|	Удержания.ВидРасчета.СчетУчета КАК СчетУчета,
		|	Удержания.Результат
		|ПОМЕСТИТЬ ВременнаяТаблицаУдержанияЗаМесяц
		|ИЗ
		|	РегистрРасчета.Удержания КАК Удержания
		|ГДЕ
		|	Удержания.ПериодРегистрации МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Удержания.Организация = &Организация
		|	И НЕ Удержания.Результат = 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПрофвзносыСрезПоследних.ФизЛицо,
		|	&СтавкаКорпОтчислений КАК СтавкаПрофВзнос,
		|	ВЫБОР
		|		КОГДА ПрофвзносыСрезПоследних.Профсоюз = ЗНАЧЕНИЕ(Перечисление.Профсоюзы.КыргызПрофСож)
		|			ТОГДА ЗНАЧЕНИЕ(ПланВидовРасчета.ВидыНалогов.КыргызПрофСож)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовРасчета.ВидыНалогов.Рабпрофсож)
		|	КОНЕЦ КАК ВидНалогаПрофВзнос,
		|	&ПрофВзносЗаВычетомПФРиГНПФР КАК ПрофВзносЗаВычетомПФРиГНПФР,
		|	&ПрофВзносЗаВычетомПН КАК ПрофВзносЗаВычетомПН
		|ПОМЕСТИТЬ ВременнаяТаблицаПрофвзносы
		|ИЗ
		|	РегистрСведений.Профвзносы.СрезПоследних(
		|			&КонецПериода,
		|			Организация = &Организация
		|				И ФизЛицо В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВременнаяТаблицаНачисленияЗаМесяцПредв.ФизЛицо
		|					ИЗ
		|						ВременнаяТаблицаНачисленияЗаМесяцПредв КАК ВременнаяТаблицаНачисленияЗаМесяцПредв)) КАК ПрофвзносыСрезПоследних
		|ГДЕ
		|	НЕ ПрофвзносыСрезПоследних.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПоПрофсоюзам.Выход)";
				
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(СтруктураДополнительныеСвойства.ДляПроведения.Дата));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(СтруктураДополнительныеСвойства.ДляПроведения.Дата));
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	
	Запрос.УстановитьПараметр("СтавкаКорпОтчислений", СтруктураДополнительныеСвойства.ДляПроведения.ДанныеУчетнойПолитикиПоПерсоналу.СтавкаКорпОтчислений);
	Запрос.УстановитьПараметр("ПрофВзносЗаВычетомПН", СтруктураДополнительныеСвойства.ДляПроведения.ДанныеУчетнойПолитикиПоПерсоналу.ПрофВзносЗаВычетомПН);
	Запрос.УстановитьПараметр("ПрофВзносЗаВычетомПФРиГНПФР", СтруктураДополнительныеСвойства.ДляПроведения.ДанныеУчетнойПолитикиПоПерсоналу.ПрофВзносЗаВычетомПФРиГНПФР);
	
	Запрос.Выполнить();
	
	
	ЗапросСчетаЗП =  Новый Запрос;
	ЗапросСчетаЗП.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	ЗапросСчетаЗП.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаНачисленияЗаМесяцПредв.ФизЛицо,
	|	ВременнаяТаблицаНачисленияЗаМесяцПредв.ВидРасчета,
	|	ВременнаяТаблицаНачисленияЗаМесяцПредв.СчетУчетаЗатрат,
	|	ВременнаяТаблицаНачисленияЗаМесяцПредв.СтатьяЗатрат,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиЗатратИДоходов.ПустаяСсылка) КАК СтатьяЗатратСоцОтчисления,
	|	ВременнаяТаблицаНачисленияЗаМесяцПредв.Подразделение,
	|	ВременнаяТаблицаНачисленияЗаМесяцПредв.Должность,
	|	ВременнаяТаблицаНачисленияЗаМесяцПредв.Результат,
	|	ВременнаяТаблицаНачисленияЗаМесяцПредв.ВидРасчетаОблагаетсяПН,
	|	ВременнаяТаблицаНачисленияЗаМесяцПредв.ВидРасчетаОблагаетсяСФ,
	|	ВременнаяТаблицаНачисленияЗаМесяцПредв.ВидРасчетаОблагаетсяПрофВзнос,
	|	ВременнаяТаблицаНачисленияЗаМесяцПредв.ОтработаноДней,
	|	ВременнаяТаблицаНачисленияЗаМесяцПредв.ОтложенноеОтражение
	|ИЗ
	|	ВременнаяТаблицаНачисленияЗаМесяцПредв КАК ВременнаяТаблицаНачисленияЗаМесяцПредв";
	ТЗ = ЗапросСчетаЗП.Выполнить().Выгрузить();
	                 
	СтруктураОтбора = ПроведениеРасчетовПоЗарплатеСервер.СтруктураОтбораДанныхСчетовУчетаПоЗП();
	
	Для Каждого СтрокаТЗ Из ТЗ Цикл
		СтруктураОтбора.ВидРасчетаНачисления= СтрокаТЗ.ВидРасчета;
		СтруктураОтбора.КатегорияДолжности 	= СтрокаТЗ.Должность.Категория;
		СтруктураОтбора.Должность 			= СтрокаТЗ.Должность;
		СтруктураОтбора.Подразделение	  	= СтрокаТЗ.Подразделение; 
		
		ДанныеСчетаУчетаЗП = ПроведениеРасчетовПоЗарплатеСервер.ДанныеСчетаУчетаЗП(СтруктураОтбора);	
	КонецЦикла;    
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТЗ.ФизЛицо,
		|	ТЗ.ВидРасчета,
		|	ТЗ.СчетУчетаЗатрат,
		|	ТЗ.СтатьяЗатрат,
		|	ТЗ.СтатьяЗатратСоцОтчисления КАК СтатьяЗатратСоцОтчисления,
		|	ТЗ.Результат,
		|	ТЗ.ВидРасчетаОблагаетсяПН,
		|	ТЗ.ВидРасчетаОблагаетсяСФ,
		|	ТЗ.ВидРасчетаОблагаетсяПрофВзнос,
		|	ТЗ.ОтработаноДней,
		|	ТЗ.ОтложенноеОтражение
		|ПОМЕСТИТЬ ВременнаяТаблицаНачисленияЗаМесяц
		|ИЗ
		|	&ТЗ КАК ТЗ";
	Запрос.УстановитьПараметр("ТЗ", ТЗ);
	
	РезультатЗапроса = Запрос.Выполнить();	
	
	РассчитатьНалогиПоЗарплате(ДокументСсылка, СтруктураДополнительныеСвойства);
	РассчитатьПлановыеУдержания(СтруктураДополнительныеСвойства, ДокументОбъект);
	
	СформироватьТаблицаУдержания(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицаВзаиморасчетыССотрудниками(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицаСоциальныйФонд(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицаПодоходныйНалог(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицаНалогиПоЗаработнойПлате(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицаХозрасчетный(ДокументСсылка, СтруктураДополнительныеСвойства);
	
	СформироватьТаблицуДляОтчетаПоПН(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицуДляОтчетаПоЕжемесячномуОтчетуПоСФ(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицуДляОтчетаПоКвартальномуОтчетуПоСФ(ДокументСсылка, СтруктураДополнительныеСвойства);
		
	// Показать пользователю рассчитанные налоги
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаНалоги.ФизЛицо КАК ФизЛицо,
		|	ВременнаяТаблицаНалоги.СуммаНачислено КАК СуммаНачислено,
		|	ВременнаяТаблицаНалоги.ПФР КАК ПФР,
		|	ВременнаяТаблицаНалоги.ГНПФР КАК ГНПФР,
		|	ВременнаяТаблицаНалоги.ПН КАК ПН,
		|	0 КАК ПФФ,
		|	0 КАК МСФ,
		|	0 КАК ФОТФ,
		|	ВременнаяТаблицаНалоги.МСР КАК МСР,
		|	ВременнаяТаблицаНалоги.ПрофВзнос КАК ПрофВзнос,
		|	ВременнаяТаблицаНалоги.Вычеты * 100 + ВременнаяТаблицаНалоги.ДопВычет КАК Вычеты
		|ПОМЕСТИТЬ ВременнаяТаблицаНалогиДляПользователя
		|ИЗ
		|	ВременнаяТаблицаНалоги КАК ВременнаяТаблицаНалоги
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаНалогиСОрганизации.ФизЛицо,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ВременнаяТаблицаНалогиСОрганизации.ПФФ,
		|	ВременнаяТаблицаНалогиСОрганизации.МСФ,
		|	ВременнаяТаблицаНалогиСОрганизации.ФОТФ,
		|	0,
		|	0,
		|	0
		|ИЗ
		|	ВременнаяТаблицаНалогиСОрганизации КАК ВременнаяТаблицаНалогиСОрганизации
		|
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.ФизЛицо КАК ФизЛицо,
		|	СУММА(ВложенныйЗапрос.СуммаНачислено) КАК СуммаНачислено,
		|	СУММА(ВложенныйЗапрос.ПФР) КАК ПФР,
		|	СУММА(ВложенныйЗапрос.ГНПФР) КАК ГНПФР,
		|	СУММА(ВложенныйЗапрос.ПН) КАК ПН,
		|	СУММА(ВложенныйЗапрос.ПФФ) КАК ПФФ,
		|	СУММА(ВложенныйЗапрос.МСФ) КАК МСФ,
		|	СУММА(ВложенныйЗапрос.ФОТФ) КАК ФОТФ,
		|	СУММА(ВложенныйЗапрос.МСР) КАК МСР,
		|	СУММА(ВложенныйЗапрос.ПрофВзнос) КАК ПрофВзнос,
		|	СУММА(ВложенныйЗапрос.Вычеты) КАК Вычеты
		|ИЗ
		|	ВременнаяТаблицаНалогиДляПользователя КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.ФизЛицо
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизЛицо.Наименование";
	ДокументОбъект.НалогиПоЗарплате.Загрузить(Запрос.Выполнить().Выгрузить());
	
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

#КонецОбласти

#КонецЕсли