#Область ПрограммныйИнтерфейс

// Загружает в таблицу данные из терминала сбора данных.
//
Процедура ПолучитьДанныеИзТСД(Форма, ИмяТабличнойЧасти) Экспорт
	
	ОчиститьСообщения();
	
	Форма.Доступность = Ложь;
	
	Параметры = Новый Структура;
	Параметры.Вставить("Форма", Форма);
	Параметры.Вставить("ИмяТабличнойЧасти", ИмяТабличнойЧасти);
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ПолучитьДанныеИзТСДЗавершение", ЭтотОбъект, Параметры);
	МенеджерОборудованияКлиент.НачатьЗагрузкуДанныеИзТСД(
		ОповещениеПриЗавершении,
		Форма.УникальныйИдентификатор
	);
	
КонецПроцедуры

Процедура ПолучитьДанныеИзТСДЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Параметры.Форма.Доступность = Истина; // Разблокировка интерфейса пользователя.
	
	Если РезультатВыполнения.Результат Тогда
		Параметры.Форма.ПолученыШтрихкоды(РезультатВыполнения.ТаблицаТоваров, Параметры.ИмяТабличнойЧасти);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатВыполнения.ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


