
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Параметры.Ссылка) = Тип("ДокументСсылка.СчетФактураВыписанный")  Тогда   
		ПодобратьДокументыДляСФВыписанный(Параметры.Контрагент, Параметры.ДокументВозврата, 
										Параметры.НачалоПериода, Параметры.КонецПериода);
		ВидПодбора = Параметры.ВидПодбора;
		Объект.УникальныйИдентификаторФормыВладельца = Параметры.УникальныйИдентификаторФормыВладельца;
	//ИначеЕсли ТипЗнч(Параметры.Ссылка) = Тип("ДокументСсылка.СчетФактураПолученный") Тогда
	//	ПодобратьДокументыДляСФПолученный(Параметры.Контрагент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПодобратьДокументыДляСФВыписанный(Контрагент, ДокументВозврата, НачалоПериода, КонецПериода)

	Запрос = Новый Запрос;
	
	Если ДокументВозврата Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ 
			|	ВозвратТоваровОтПокупателя.Ссылка,
			|	ВозвратТоваровОтПокупателя.СуммаДокумента
			|ИЗ
			|	Документ.ВозвратТоваровОтПокупателя КАК ВозвратТоваровОтПокупателя
			|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыписанный КАК СчетФактураВыписанный 
			|		ПО СчетФактураВыписанный.ДокументОснование = ВозвратТоваровОтПокупателя.Ссылка
			|ГДЕ 
			|	ВозвратТоваровОтПокупателя.Контрагент = &Контрагент
			|	И НЕ ВозвратТоваровОтПокупателя.Ссылка = ЕСТЬNULL(СчетФактураВыписанный.ДокументОснование, ЗНАЧЕНИЕ(Документ.ВозвратТоваровОтПокупателя.ПустаяСсылка))
			|	И ВозвратТоваровОтПокупателя.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
			
	Иначе
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	РеализацияТоваровУслуг.Ссылка,
			|	РеализацияТоваровУслуг.СуммаДокумента
			|ИЗ
			|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
			|ГДЕ
			|	РеализацияТоваровУслуг.Контрагент = &Контрагент 
			|	И (РеализацияТоваровУслуг.СерияБланкаСФ = """"
			|	ИЛИ РеализацияТоваровУслуг.НомерБланкаСФ = """")
			|	И РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ 
			|	СчетНаОплатуПокупателю.Ссылка,
			|	СчетНаОплатуПокупателю.СуммаДокумента
			|ИЗ
			|	Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
			|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыписанный КАК СчетФактураВыписанный 
			|		ПО СчетФактураВыписанный.ДокументОснование = СчетНаОплатуПокупателю.Ссылка
			|ГДЕ
			|	СчетНаОплатуПокупателю.Контрагент = &Контрагент
			|	И НЕ СчетНаОплатуПокупателю.Ссылка = ЕСТЬNULL(СчетФактураВыписанный.ДокументОснование, ЗНАЧЕНИЕ(Документ.СчетНаОплатуПокупателю.ПустаяСсылка))
			|	И СчетНаОплатуПокупателю.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
			//|
			//|ОБЪЕДИНИТЬ ВСЕ
			//|
			//|ВЫБРАТЬ 
			//|	ПередачаОС.Ссылка,
			//|	ПередачаОС.СуммаДокумента
			//|ИЗ
			//|	Документ.ПередачаОС КАК ПередачаОС
			//|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыписанный КАК СчетФактураВыписанный 
			//|		ПО СчетФактураВыписанный.ДокументОснование = ПередачаОС.Ссылка
			//|ГДЕ 
			//|	ПередачаОС.Контрагент = &Контрагент
			//|	И НЕ ПередачаОС.Ссылка = ЕСТЬNULL(СчетФактураВыписанный.ДокументОснование, ЗНАЧЕНИЕ(Документ.ПередачаОС.ПустаяСсылка))";
	КонецЕсли;
		
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
		
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Объект.ДокументыПодбора.Очистить();
	
	Пока Выборка.Следующий() Цикл          	
		СтрокаТабличнойЧасти = Объект.ДокументыПодбора.Добавить();	
		СтрокаТабличнойЧасти.ДокументОплаты = Выборка.Ссылка;
		СтрокаТабличнойЧасти.СуммаДокумента = Выборка.СуммаДокумента;		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПодобратьДокументыДляСФПолученный(Контрагент)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеТоваровУслуг.Ссылка,
		|	ПоступлениеТоваровУслуг.СуммаДокумента
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		|ГДЕ
		|	ПоступлениеТоваровУслуг.Контрагент = &Контрагент
		|	И (ПоступлениеТоваровУслуг.СерияБланкаСФ = ""
		|	ИЛИ ПоступлениеТоваровУслуг.НомерБланкаСФ = "")	
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВозвратТоваровПоставщику.Ссылка,
		|	ВозвратТоваровПоставщику.СуммаДокумента
		|ИЗ
		|	Документ.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику
		|ГДЕ
		|	ВозвратТоваровПоставщику.Контрагент = &Контрагент
		|	И (ВозвратТоваровПоставщику.СерияБланкаСФ = ""
		|	ИЛИ ВозвратТоваровПоставщику.НомерБланкаСФ = "")	
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ 
		|	ДополнительныеРасходы.Ссылка,
		|	ДополнительныеРасходы.СуммаДокумента
		|ИЗ
		|	Документ.ДополнительныеРасходы КАК ДополнительныеРасходы
		|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный КАК СчетФактураПолученный 
		|		ПО СчетФактураПолученный.ДокументОснование = ДополнительныеРасходы.Ссылка
		|ГДЕ 
		|	ДополнительныеРасходы.Контрагент = &Контрагент
		|	И НЕ ДополнительныеРасходы.Ссылка = ЕСТЬNULL(СчетФактураПолученный.ДокументОснование, ЗНАЧЕНИЕ(Документ.ДополнительныеРасходы.ПустаяСсылка))";
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
		
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();

КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеФлажки(Команда)
	Для каждого СтрокаТабличнойЧасти из Объект.ДокументыПодбора Цикл
		СтрокаТабличнойЧасти.Подобрать = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсеФлажки(Команда)
	Для каждого СтрокаТабличнойЧасти из Объект.ДокументыПодбора Цикл
		СтрокаТабличнойЧасти.Подобрать = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	Закрыть(ЗаписатьПодборВХранилище());
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьПодборВХранилище()
	
	Структура = Новый Структура();
	Структура.Вставить("Подобрать", Истина);
	МассивВозврата = Объект.ДокументыПодбора.НайтиСтроки(Структура);

	АдресКорзиныВХранилище = ПоместитьВоВременноеХранилище(МассивВозврата, Объект.УникальныйИдентификаторФормыВладельца);
	Возврат Новый Структура("АдресКорзиныВХранилище, УникальныйИдентификаторФормыВладельца", АдресКорзиныВХранилище, Объект.УникальныйИдентификаторФормыВладельца);
	
КонецФункции
