#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СозданиеНового = Объект.Ссылка.Пустая();
	РедактированиеПериодическихСведений.ПрочитатьЗаписьДляРедактированияВФорме(ЭтаФорма, "КоэфицентыНалогаНаИмущество", Объект.Ссылка);
	РедактированиеПериодическихСведений.ПрочитатьНаборЗаписей(ЭтаФорма, "КоэфицентыНалогаНаИмущество", Объект.Ссылка);

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ДополнительныеСвойства = Новый Структура;
	
	Если СозданиеНового Тогда
		ДополнительныеСвойства.Вставить("ОтключитьПроверкуДатыЗапретаИзменения", Истина);
	КонецЕсли;
	
	РедактированиеПериодическихСведений.ЗаписатьНаборЗаписей(
		ЭтаФорма,
		"КоэфицентыНалогаНаИмущество",
		ТекущийОбъект.Ссылка,
		,
		ДополнительныеСвойства);
КонецПроцедуры

#КонецОбласти
