#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура - Заполнить по умолчанию
// Выполняет первоночальное заполнение
Процедура ЗаполнитьПоУмолчанию() Экспорт 
	СправочникМенеджер = Справочники.НастройкиРегламентированныхОтчетов;
	
	// Настроки строк Баланса.
	НаименованиеСправочника = НСтр("ru = 'Настройка строк Баланса (по умолчанию)'");
	СправочникСсылка = СправочникМенеджер.НайтиПоНаименованию(НаименованиеСправочника, Истина);
	Если СправочникСсылка.Пустая() тогда
		СправочникОбъект = СправочникМенеджер.СоздатьЭлемент();
		СправочникОбъект.Наименование = НаименованиеСправочника;
		СправочникОбъект.ВидОтчета = Перечисления.ВидыРегламентированныхОтчетов.Баланс;
	Иначе
		СправочникОбъект = СправочникСсылка.ПолучитьОбъект();
		СправочникОбъект.СтрокиОтчета.Очистить();
		СправочникОбъект.НастройкиСтрок.Очистить();
	КонецЕсли;	
	
	СправочникОбъект.ЗаполнитьНастройкиБаланс();
	
	БухгалтерскийУчетКлиентСервер.ЗаписатьСправочникОбъект(СправочникОбъект,,,,Истина);

	// Настроки строк ОПУ (Отчет о прибылях и убытках).
	НаименованиеСправочника = НСтр("ru = 'Настройка строк ОПУ (по умолчанию)'");
	СправочникСсылка = СправочникМенеджер.НайтиПоНаименованию(НаименованиеСправочника, Истина);
	Если СправочникСсылка.Пустая() тогда
		СправочникОбъект = СправочникМенеджер.СоздатьЭлемент();
		СправочникОбъект.Наименование = НаименованиеСправочника;
		СправочникОбъект.ВидОтчета = Перечисления.ВидыРегламентированныхОтчетов.ОПУ;
	Иначе
		СправочникОбъект = СправочникСсылка.ПолучитьОбъект();
		СправочникОбъект.СтрокиОтчета.Очистить();
		СправочникОбъект.НастройкиСтрок.Очистить();
	КонецЕсли;	
	
	СправочникОбъект.ЗаполнитьНастройкиОПУ();
	
	БухгалтерскийУчетКлиентСервер.ЗаписатьСправочникОбъект(СправочникОбъект,,,,Истина);
	
	// Настроки строк ОДДС (Отчет о движении денежных средств).
	НаименованиеСправочника = НСтр("ru = 'Настройка строк ОДДС (по умолчанию)'");
	СправочникСсылка = СправочникМенеджер.НайтиПоНаименованию(НаименованиеСправочника, Истина);
	Если СправочникСсылка.Пустая() тогда
		СправочникОбъект = СправочникМенеджер.СоздатьЭлемент();
		СправочникОбъект.Наименование = НаименованиеСправочника;
		СправочникОбъект.ВидОтчета = Перечисления.ВидыРегламентированныхОтчетов.ОДДС;
	Иначе
		СправочникОбъект = СправочникСсылка.ПолучитьОбъект();
		СправочникОбъект.СтрокиОтчета.Очистить();
		СправочникОбъект.НастройкиСтрок.Очистить();
	КонецЕсли;	
	
	СправочникОбъект.ЗаполнитьНастройкиОДДС();
	
	БухгалтерскийУчетКлиентСервер.ЗаписатьСправочникОбъект(СправочникОбъект,,,,Истина);
	
	// Настроки строк ОИК (Отчет об изменениях в капитале).
	НаименованиеСправочника = НСтр("ru = 'Настройка строк ОИК (по умолчанию)'");
	СправочникСсылка = СправочникМенеджер.НайтиПоНаименованию(НаименованиеСправочника, Истина);
	Если СправочникСсылка.Пустая() тогда
		СправочникОбъект = СправочникМенеджер.СоздатьЭлемент();
		СправочникОбъект.Наименование = НаименованиеСправочника;
		СправочникОбъект.ВидОтчета = Перечисления.ВидыРегламентированныхОтчетов.ОИК;
	Иначе
		СправочникОбъект = СправочникСсылка.ПолучитьОбъект();
		СправочникОбъект.СтрокиОтчета.Очистить();
		СправочникОбъект.НастройкиСтрок.Очистить();
	КонецЕсли;	
	
	СправочникОбъект.ЗаполнитьНастройкиОИК();
	
	БухгалтерскийУчетКлиентСервер.ЗаписатьСправочникОбъект(СправочникОбъект,,,,Истина);
	
КонецПроцедуры // ЗаполнитьПоУмолчанию()	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция для проверки настроек.
//
// Параметры:
//	ВидОтчета - Перечисления.ВидыРегламентированныхОтчетов - Вид регламентированного отчета.
//	СтруктураТаблиц - Структура - структура таблиц (из табличных частей спр. "НастройкиРегламентированныхОтчетов").
//
// Возвращаемое значение:
//	МассивСообщений - Массив - массив сообщений с описанием ошибок.
//
Функция ПолучитьДанныеПроверкиНастроек(ВидОтчета, СтруктураТаблиц) Экспорт 
	МассивСообщений = Новый Массив();	
	
	Если ВидОтчета = Перечисления.ВидыРегламентированныхОтчетов.Баланс Тогда 
		// 1. Список счетов учета.
		// 5. Настройки.
		// 6. Контроль заполнения всех счетов в настройках, за исключением временных.
		// 7. Контроль дублирования счетов за исключением активно-пассивных.
		// 8. Контроль заполнения счетов в строках заголовков и групп.
		Запрос = Новый Запрос;
		Запрос.Текст = 
			// 1. Список счетов учета. 
			"ВЫБРАТЬ
			|	Хозрасчетный.Ссылка КАК СчетУчета
			|ПОМЕСТИТЬ ВременнаяТаблицаСписокСчетов
			|ИЗ
			|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
			|ГДЕ
			|	НЕ Хозрасчетный.ЗапретитьИспользоватьВПроводках
			|	И НЕ Хозрасчетный.Временный
			|	И НЕ Хозрасчетный.Забалансовый
			|	И НЕ Хозрасчетный.Ссылка В (&МассивИсключений)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	НастройкиСтрок.КлючСвязи КАК КлючСвязи,
			|	НастройкиСтрок.СчетУчета КАК СчетУчета,
			|	НастройкиСтрок.НомерСтроки КАК НомерСтроки,
			|	НастройкиСтрок.КодСтроки КАК КодСтроки
			|ПОМЕСТИТЬ ВременнаяТаблицаНастройкиСтрок
			|ИЗ
			|	&НастройкиСтрок КАК НастройкиСтрок
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВременнаяТаблицаНастройкиСтрок.КлючСвязи КАК КлючСвязи,
			|	ВременнаяТаблицаНастройкиСтрок.СчетУчета КАК СчетУчета,
			|	ВременнаяТаблицаНастройкиСтрок.НомерСтроки КАК НомерСтроки,
			|	ВременнаяТаблицаНастройкиСтрок.КодСтроки КАК КодСтроки,
			|	Хозрасчетный.Вид КАК ВидСчета
			|ПОМЕСТИТЬ ВременнаяТаблицаНастройкиСтрокХозрасчетный
			|ИЗ
			|	ВременнаяТаблицаНастройкиСтрок КАК ВременнаяТаблицаНастройкиСтрок
			|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный КАК Хозрасчетный
			|		ПО ВременнаяТаблицаНастройкиСтрок.СчетУчета = Хозрасчетный.Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СтрокиОтчета.КлючСвязи КАК КлючСвязи,
			|	СтрокиОтчета.ЭтоЗаголовок КАК ЭтоЗаголовок,
			|	СтрокиОтчета.Группа КАК Группа
			|ПОМЕСТИТЬ ВременнаяТаблицаСтрокиОтчета
			|ИЗ
			|	&СтрокиОтчета КАК СтрокиОтчета
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВременнаяТаблицаНастройкиСтрокХозрасчетный.СчетУчета КАК СчетУчета,
			|	ВременнаяТаблицаНастройкиСтрокХозрасчетный.НомерСтроки КАК НомерСтроки,
			|	ВременнаяТаблицаНастройкиСтрокХозрасчетный.КодСтроки КАК КодСтроки,
			|	ВременнаяТаблицаНастройкиСтрокХозрасчетный.ВидСчета КАК ВидСчета,
			|	ВременнаяТаблицаСтрокиОтчета.ЭтоЗаголовок КАК ЭтоЗаголовок,
			|	ВременнаяТаблицаСтрокиОтчета.Группа КАК Группа
			|ПОМЕСТИТЬ ВременнаяТаблицаНастройки
			|ИЗ
			|	ВременнаяТаблицаСтрокиОтчета КАК ВременнаяТаблицаСтрокиОтчета
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаНастройкиСтрокХозрасчетный КАК ВременнаяТаблицаНастройкиСтрокХозрасчетный
			|		ПО ВременнаяТаблицаСтрокиОтчета.КлючСвязи = ВременнаяТаблицаНастройкиСтрокХозрасчетный.КлючСвязи
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВременнаяТаблицаСписокСчетов.СчетУчета КАК СчетУчета
			|ИЗ
			|	ВременнаяТаблицаСписокСчетов КАК ВременнаяТаблицаСписокСчетов
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаНастройки КАК ВременнаяТаблицаНастройки
			|		ПО ВременнаяТаблицаСписокСчетов.СчетУчета = ВременнаяТаблицаНастройки.СчетУчета
			|ГДЕ
			|	ВременнаяТаблицаНастройки.НомерСтроки ЕСТЬ NULL
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	МАКСИМУМ(ВременнаяТаблицаНастройкиДубли.КодСтроки) КАК КодСтроки,
			|	ВременнаяТаблицаНастройкиДубли.СчетУчета КАК СчетУчета
			|ИЗ
			|	ВременнаяТаблицаНастройки КАК ВременнаяТаблицаНастройкиДубли
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаНастройки КАК ВременнаяТаблицаНастройки
			|		ПО ВременнаяТаблицаНастройкиДубли.НомерСтроки <> ВременнаяТаблицаНастройки.НомерСтроки
			|			И ВременнаяТаблицаНастройкиДубли.СчетУчета = ВременнаяТаблицаНастройки.СчетУчета
			|ГДЕ
			|	НЕ ВременнаяТаблицаНастройкиДубли.ВидСчета = ЗНАЧЕНИЕ(ВидСчета.АктивноПассивный)
			|
			|СГРУППИРОВАТЬ ПО
			|	ВременнаяТаблицаНастройкиДубли.СчетУчета
			|
			|УПОРЯДОЧИТЬ ПО
			|	КодСтроки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВременнаяТаблицаНастройки.КодСтроки КАК КодСтроки
			|ИЗ
			|	ВременнаяТаблицаНастройки КАК ВременнаяТаблицаНастройки
			|ГДЕ
			|	ВременнаяТаблицаНастройки.ЭтоЗаголовок";
		Запрос.УстановитьПараметр("СтрокиОтчета", СтруктураТаблиц.СтрокиОтчета);
		Запрос.УстановитьПараметр("НастройкиСтрок", СтруктураТаблиц.НастройкиСтрок);
		МассивИсключений = Новый Массив;
		МассивИсключений.Добавить(ПланыСчетов.Хозрасчетный.Вспомогательный); // 0000
		МассивИсключений.Добавить(ПланыСчетов.Хозрасчетный.СводДоходовИРасходов); // 5999
		Запрос.УстановитьПараметр("МассивИсключений", МассивИсключений);
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		// Контроль заполнения всех счетов в настройках, за исключением временных.
		Если НЕ МассивРезультатов[5].Пустой() Тогда
			ВыборкаИзРезультатаЗапроса = МассивРезультатов[5].Выбрать();
			Пока ВыборкаИзРезультатаЗапроса.Следующий() Цикл
				МассивСообщений.Добавить(СтрШаблон(НСтр("ru = 'Счет учета ""%1"" не указан в настройках.'"), ВыборкаИзРезультатаЗапроса.СчетУчета));
			КонецЦикла;
		КонецЕсли;		
		
		// Контроль дублирования счетов за исключением активно-пассивных.
		Если НЕ МассивРезультатов[6].Пустой() Тогда
			ВыборкаИзРезультатаЗапроса = МассивРезультатов[6].Выбрать();
			Пока ВыборкаИзРезультатаЗапроса.Следующий() Цикл
				МассивСообщений.Добавить(СтрШаблон(НСтр("ru = 'Счет учета ""%1"" указывается повторно в строке с кодом %2.'"), 
					ВыборкаИзРезультатаЗапроса.СчетУчета, ВыборкаИзРезультатаЗапроса.КодСтроки));
			КонецЦикла;
		КонецЕсли;
		
		// Контроль заполнения счетов в строках заголовков и групп.
		Если НЕ МассивРезультатов[7].Пустой() Тогда
			ВыборкаИзРезультатаЗапроса = МассивРезультатов[7].Выбрать();
			Пока ВыборкаИзРезультатаЗапроса.Следующий() Цикл
				МассивСообщений.Добавить(СтрШаблон(НСтр("ru = 'Для строки с кодом %1 следует очистить настройки.'"), ВыборкаИзРезультатаЗапроса.КодСтроки));
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли ВидОтчета = Перечисления.ВидыРегламентированныхОтчетов.ОПУ Тогда	
		// 1. Список счетов учета.
		// 4. Настройки.
		// 5. Контроль заполнения всех счетов в настройках (только временные).
		// 6. Контроль дублирования счетов за исключением.
		// 7. Контроль заполнения счетов в строках заголовков и групп.
		Запрос = Новый Запрос;
		Запрос.Текст = 
			// 1. Список счетов учета. 
			"ВЫБРАТЬ
			|	Хозрасчетный.Ссылка КАК СчетУчета
			|ПОМЕСТИТЬ ВременнаяТаблицаСписокСчетов
			|ИЗ
			|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
			|ГДЕ
			|	НЕ Хозрасчетный.ЗапретитьИспользоватьВПроводках
			|	И Хозрасчетный.Временный
			|	И НЕ Хозрасчетный.Забалансовый
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			// 2. Настройки строк.
			|ВЫБРАТЬ
			|	НастройкиСтрок.КлючСвязи КАК КлючСвязи,
			|	НастройкиСтрок.СчетУчета КАК СчетУчета,
			|	НастройкиСтрок.НомерСтроки КАК НомерСтроки,
			|	НастройкиСтрок.КодСтроки КАК КодСтроки
			|ПОМЕСТИТЬ ВременнаяТаблицаНастройкиСтрок
			|ИЗ
			|	&НастройкиСтрок КАК НастройкиСтрок
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			// 3. Строки отчета.
			|ВЫБРАТЬ
			|	СтрокиОтчета.КлючСвязи КАК КлючСвязи,
			|	СтрокиОтчета.ЭтоЗаголовок КАК ЭтоЗаголовок,
			|	СтрокиОтчета.Группа КАК Группа
			|ПОМЕСТИТЬ ВременнаяТаблицаСтрокиОтчета
			|ИЗ
			|	&СтрокиОтчета КАК СтрокиОтчета
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			// 4. Настройки.
			|ВЫБРАТЬ
			|	ВременнаяТаблицаНастройкиСтрок.СчетУчета КАК СчетУчета,
			|	ВременнаяТаблицаНастройкиСтрок.НомерСтроки КАК НомерСтроки,
			|	ВременнаяТаблицаНастройкиСтрок.КодСтроки КАК КодСтроки,
			|	ВременнаяТаблицаСтрокиОтчета.ЭтоЗаголовок КАК ЭтоЗаголовок,
			|	ВременнаяТаблицаСтрокиОтчета.Группа КАК Группа
			|ПОМЕСТИТЬ ВременнаяТаблицаНастройки
			|ИЗ
			|	ВременнаяТаблицаСтрокиОтчета КАК ВременнаяТаблицаСтрокиОтчета
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаНастройкиСтрок КАК ВременнаяТаблицаНастройкиСтрок
			|		ПО ВременнаяТаблицаСтрокиОтчета.КлючСвязи = ВременнаяТаблицаНастройкиСтрок.КлючСвязи
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			// 5. Контроль заполнения всех счетов в настройках.
			|ВЫБРАТЬ
			|	ВременнаяТаблицаСписокСчетов.СчетУчета КАК СчетУчета
			|ИЗ
			|	ВременнаяТаблицаСписокСчетов КАК ВременнаяТаблицаСписокСчетов
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаНастройки КАК ВременнаяТаблицаНастройки
			|		ПО ВременнаяТаблицаСписокСчетов.СчетУчета = ВременнаяТаблицаНастройки.СчетУчета
			|ГДЕ
			|	ВременнаяТаблицаНастройки.НомерСтроки ЕСТЬ NULL
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			// 6. Контроль дублирования счетов.
			|ВЫБРАТЬ
			|	МАКСИМУМ(ВременнаяТаблицаНастройкиДубли.КодСтроки) КАК КодСтроки,
			|	ВременнаяТаблицаНастройкиДубли.СчетУчета КАК СчетУчета
			|ИЗ
			|	ВременнаяТаблицаНастройки КАК ВременнаяТаблицаНастройкиДубли
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаНастройки КАК ВременнаяТаблицаНастройки
			|		ПО ВременнаяТаблицаНастройкиДубли.НомерСтроки <> ВременнаяТаблицаНастройки.НомерСтроки
			|			И ВременнаяТаблицаНастройкиДубли.СчетУчета = ВременнаяТаблицаНастройки.СчетУчета
			|
			|СГРУППИРОВАТЬ ПО
			|	ВременнаяТаблицаНастройкиДубли.СчетУчета
			|
			|УПОРЯДОЧИТЬ ПО
			|	КодСтроки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			// 7. Контроль заполнения счетов в строках заголовков и групп.
			|ВЫБРАТЬ
			|	ВременнаяТаблицаНастройки.КодСтроки КАК КодСтроки
			|ИЗ
			|	ВременнаяТаблицаНастройки КАК ВременнаяТаблицаНастройки
			|ГДЕ
			|	ВременнаяТаблицаНастройки.ЭтоЗаголовок";
		Запрос.УстановитьПараметр("СтрокиОтчета", СтруктураТаблиц.СтрокиОтчета);
		Запрос.УстановитьПараметр("НастройкиСтрок", СтруктураТаблиц.НастройкиСтрок);
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		// Контроль заполнения всех счетов в настройках.
		Если НЕ МассивРезультатов[4].Пустой() Тогда
			ВыборкаИзРезультатаЗапроса = МассивРезультатов[4].Выбрать();
			Пока ВыборкаИзРезультатаЗапроса.Следующий() Цикл
				МассивСообщений.Добавить(СтрШаблон(НСтр("ru = 'Счет учета ""%1"" не указан в настройках.'"), ВыборкаИзРезультатаЗапроса.СчетУчета));
			КонецЦикла;
		КонецЕсли;		
		
		// Контроль дублирования счетов.
		Если НЕ МассивРезультатов[5].Пустой() Тогда
			ВыборкаИзРезультатаЗапроса = МассивРезультатов[5].Выбрать();
			Пока ВыборкаИзРезультатаЗапроса.Следующий() Цикл
				МассивСообщений.Добавить(СтрШаблон(НСтр("ru = 'Счет учета ""%1"" указывается повторно в строке с кодом %2.'"), 
					ВыборкаИзРезультатаЗапроса.СчетУчета, ВыборкаИзРезультатаЗапроса.КодСтроки));
			КонецЦикла;
		КонецЕсли;
		
		// Контроль заполнения счетов в строках заголовков и групп.
		Если НЕ МассивРезультатов[6].Пустой() Тогда
			ВыборкаИзРезультатаЗапроса = МассивРезультатов[6].Выбрать();
			Пока ВыборкаИзРезультатаЗапроса.Следующий() Цикл
				МассивСообщений.Добавить(СтрШаблон(НСтр("ru = 'Для строки с кодом %1 следует очистить настройки.'"), ВыборкаИзРезультатаЗапроса.КодСтроки));
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли ВидОтчета = Перечисления.ВидыРегламентированныхОтчетов.ОДДС Тогда
		
		ИспользоватьСтатьиДвиженияДенежныхСредств = ПолучитьФункциональнуюОпцию("ИспользоватьСтатьиДвиженияДенежныхСредств");
		
		Если ИспользоватьСтатьиДвиженияДенежныхСредств Тогда
			Запрос = Новый Запрос;    
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ТаблицаНастройкиОДДСПоСтатьям.СтатьяДвиженияДенежныхСредств,
				|   ТаблицаНастройкиОДДСПоСтатьям.КодСтроки
				|ПОМЕСТИТЬ ВременнаяТаблицаНастройкиОДДСПоСтатьям
				|ИЗ
				|	&НастройкиОДДСПоСтатьям КАК ТаблицаНастройкиОДДСПоСтатьям
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	СтатьиДвиженияДенежныхСредств.Ссылка.Наименование КАК Статья,
				|	ТаблицаНастройкиОДДСПоСтатьям.КодСтроки
				|ИЗ
				|	Справочник.СтатьиДвиженияДенежныхСредств КАК СтатьиДвиженияДенежныхСредств
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаНастройкиОДДСПоСтатьям КАК ТаблицаНастройкиОДДСПоСтатьям
				|		ПО СтатьиДвиженияДенежныхСредств.Ссылка = ТаблицаНастройкиОДДСПоСтатьям.СтатьяДвиженияДенежныхСредств";
			Запрос.УстановитьПараметр("НастройкиОДДСПоСтатьям", СтруктураТаблиц.НастройкиОДДСПоСтатьям);		   	
				
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				Если ТипЗнч(Выборка.КодСтроки) = Тип("Null") Тогда
					МассивСообщений.Добавить(СтрШаблон(НСтр("ru = 'Для статья движения денежных средств %1 нет настройки.'"), 
															Выборка.Статья));	
				КонецЕсли;	
			КонецЦикла;
		
		Иначе
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ХозрасчетныйОборотыДтКт.СчетДт КАК СчетДт,
				|	ХозрасчетныйОборотыДтКт.СчетКт КАК СчетКт
				|ПОМЕСТИТЬ ВременнаяТаблицаСчета
				|ИЗ
				|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
				|			,
				|			,
				|			,
				|			СчетДт В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДенежныеСредстваВКассе))
				|				ИЛИ СчетДт В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДенежныеСредстваВБанке)),
				|			,
				|			СчетКт <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Вспомогательный),
				|			,
				|			) КАК ХозрасчетныйОборотыДтКт
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	ХозрасчетныйОборотыДтКт.СчетДт,
				|	ХозрасчетныйОборотыДтКт.СчетКт
				|ИЗ
				|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
				|			,
				|			,
				|			,
				|			СчетДт <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Вспомогательный),
				|			,
				|			СчетКт В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДенежныеСредстваВКассе))
				|				ИЛИ СчетКт В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДенежныеСредстваВБанке)),
				|			,
				|			) КАК ХозрасчетныйОборотыДтКт
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ВременнаяТаблицаСчета.СчетДт КАК СчетДт,
				|	ВременнаяТаблицаСчета.СчетКт КАК СчетКт
				|ПОМЕСТИТЬ ВременнаяТаблицаСочетанияСчетов
				|ИЗ
				|	ВременнаяТаблицаСчета КАК ВременнаяТаблицаСчета
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ТаблицаНастройкиОДДС.СчетДт КАК СчетДт,
				|	ТаблицаНастройкиОДДС.СчетКт КАК СчетКт,
				|	ТаблицаНастройкиОДДС.КодСтроки КАК КодСтроки
				|ПОМЕСТИТЬ ВременнаяТаблицаНастройкиОДДС
				|ИЗ
				|	&НастройкиОДДС КАК ТаблицаНастройкиОДДС
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВременнаяТаблицаСочетанияСчетов.СчетДт КАК СчетДт,
				|	ВременнаяТаблицаСочетанияСчетов.СчетКт КАК СчетКт,
				|	ТаблицаНастройкиОДДС.КодСтроки КАК КодСтроки
				|ИЗ
				|	ВременнаяТаблицаСочетанияСчетов КАК ВременнаяТаблицаСочетанияСчетов
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаНастройкиОДДС КАК ТаблицаНастройкиОДДС
				|		ПО ВременнаяТаблицаСочетанияСчетов.СчетДт = ТаблицаНастройкиОДДС.СчетДт
				|			И ВременнаяТаблицаСочетанияСчетов.СчетКт = ТаблицаНастройкиОДДС.СчетКт";
			Запрос.УстановитьПараметр("НастройкиОДДС", СтруктураТаблиц.НастройкиОДДС);		   	
				
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				Если ТипЗнч(Выборка.КодСтроки) = Тип("Null") Тогда
					МассивСообщений.Добавить(СтрШаблон(НСтр("ru = 'Для счета Дт %1 и счета Кт %2 нет настройки.'"), 
															Выборка.СчетДт,
															Выборка.СчетКт));	
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Возврат МассивСообщений;
КонецФункции // ПолучитьДанныеПроверкиНастроек()

#КонецОбласти

#КонецЕсли