#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

Процедура ЗагрузитьБазовыеНастройкиОПУ()Экспорт
	
	Макет = ПолучитьМакет("НастройкаОПУ");
	
	// 1. Выборка областей и подготовка кола первой строки
	ОбластьКод   		   		= Макет.Области.Код;
	ОбластьНаименование     	= Макет.Области.Наименование;
	ОбластьНаименованиеК		= Макет.Области.НаименованиеК;
	ОбластьЗаголовок			= Макет.Области.Заголовок;
	ОбластьЗнак					= Макет.Области.Знак;
	ОбластьСчет					= Макет.Области.Счет;
	ОбластьФормула				= Макет.Области.Формула;
	ОбластьЗнакГруппы			= Макет.Области.ЗнакГруппы;
	ОбластьГруппа				= Макет.Области.Группа;
	
	Индекс = 1;
	КодСтроки 		= Макет.Область(Индекс, ОбластьКод.Лево, Индекс, ОбластьКод.Право).Текст;
	
	// 2. Создание общей ТЗ
	ТЗ = Отчет.Выгрузить();
	ТЗ.Колонки.Добавить("Счет");
	ТЗ.Колонки.Добавить("Формула");
	ТЗ.Колонки.Добавить("Знак");
	ТЗ.Очистить();
	
	// 3. Запись настроек в ТЗ
	Пока СокрЛП(КодСтроки) <> "" Цикл
		НаименованиеОПУ		= Макет.Область(Индекс, ОбластьНаименование.Лево, Индекс, ОбластьНаименование.Право).Текст;
		НаименованиеК		= Макет.Область(Индекс, ОбластьНаименованиеК.Лево, Индекс, ОбластьНаименованиеК.Право).Текст;
		ЗаголовокОПУ		= Макет.Область(Индекс, ОбластьЗаголовок.Лево, Индекс, ОбластьЗаголовок.Право).Текст;
		Знак				= Макет.Область(Индекс, ОбластьЗнак.Лево, Индекс, ОбластьЗнак.Право).Текст;
		Счет				= СокрЛП(Макет.Область(Индекс, ОбластьСчет.Лево, Индекс, ОбластьСчет.Право).Текст);
		Формула				= Макет.Область(Индекс, ОбластьФормула.Лево, Индекс, ОбластьФормула.Право).Текст;
		ЗнакГруппы			= Макет.Область(Индекс, ОбластьЗнакГруппы.Лево, Индекс, ОбластьЗнакГруппы.Право).Текст;
		Группа				= Макет.Область(Индекс, ОбластьГруппа.Лево, Индекс, ОбластьГруппа.Право).Текст;
		
		
		// 3. Формирование строки ТЗ
		СТЗ = ТЗ.Добавить();
		
		// 3.1. Код, Наименование, Заголовок, Группа
		СТЗ.Строка = КодСтроки;
		СТЗ.Наименование 	= НаименованиеОПУ;
		СТЗ.НаименованиеК 	= НаименованиеК;
		СТЗ.Заголовок		= ЗаголовокОПУ;
		СТЗ.Группа			= Группа;
		
		// 3.2. Знак
		Если СокрЛП(Знак) = "-" Тогда
			СТЗ.Знак = Перечисления.ПлюсМинус.Минус;
		КонецЕсли;
		
		// 3.3. Знак группы
		Если СокрЛП(ЗнакГруппы) = "-" Тогда
			СТЗ.ЗнакГруппы = Перечисления.ПлюсМинус.Минус;
		КонецЕсли;
		
		// 3.4. Счет
		Если ЗаголовокОПУ = "ЛОЖЬ" И Счет <> "" Тогда
			СТЗ.Счет = ПланыСчетов.Хозрасчетный.НайтиПоКоду(СокрЛП(Счет));			
			Если СТЗ.Счет.Пустая() Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не найден счет для строки %1", КодСтроки));   
			КонецЕсли;
		КонецЕсли;
		
		// 3.5. Формула 
		Если СокрЛП(Формула) = "ОборотыДт" Тогда
			СТЗ.Формула	= Перечисления.Формулы.ОборотыДт
		ИначеЕсли СокрЛП(Формула) = "ОборотыДтКт" Тогда
			СТЗ.Формула	= Перечисления.Формулы.ОборотыДтКт
		ИначеЕсли СокрЛП(Формула) = "ОборотыКт" Тогда
			СТЗ.Формула	= Перечисления.Формулы.ОборотыКт
		ИначеЕсли СокрЛП(Формула) = "СальдоДт" Тогда
			СТЗ.Формула	= Перечисления.Формулы.СальдоДт
		ИначеЕсли СокрЛП(Формула) = "СальдоКт" Тогда
			СТЗ.Формула	= Перечисления.Формулы.СальдоКт
		КонецЕсли;
		
		// 4. Подготовка следующей строки
		Индекс 		= Индекс + 1;
		КодСтроки 	= Макет.Область(Индекс, ОбластьКод.Лево, Индекс, ОбластьКод.Право).Текст;
		
	КонецЦикла;;
	
	// 5. Загрузка закладки НАСТРОЙКИ
	Настройки.Очистить();
	Настройки.Загрузить(ТЗ);
	
	// 6. Загрузка закладки ОПУ
	ТЗ.Свернуть("Строка,Наименование,НаименованиеК,Группа,ЗнакГруппы,Заголовок");
	Отчет.Очистить();
	Отчет.Загрузить(ТЗ);
	
	РазгруппировкаСтрок();
КонецПроцедуры

Процедура ЗагрузитьБазовыеНастройкиОИК() Экспорт
	
	Макет = ПолучитьМакет("НастройкаОИК");
	
	// 1. Выборка областей и подготовка кода первой строки
	ОбластьКод   		   		= Макет.Области.Код;
	ОбластьНаименование     	= Макет.Области.Наименование;
	ОбластьНаименованиеК		= Макет.Области.НаименованиеК;
	ОбластьЗаголовок			= Макет.Области.Заголовок;
	ОбластьЗнак					= Макет.Области.Знак;
	ОбластьДебет				= Макет.Области.Дебет;
	ОбластьКредит				= Макет.Области.Кредит;	
	ОбластьФормула				= Макет.Области.Формула;
	ОбластьЗнакГруппы			= Макет.Области.ЗнакГруппы;
	ОбластьГруппа				= Макет.Области.Группа;
	ОбластьВидКапитала			= Макет.Области.ВидКапитала;
	
	Индекс = 1;
	КодСтроки 		= Макет.Область(Индекс, ОбластьКод.Лево, Индекс, ОбластьКод.Право).Текст;
	
	// 2. Создание общей ТЗ
	ТЗ = Отчет.Выгрузить();
	ТЗ.Колонки.Добавить("Счет");
	ТЗ.Колонки.Добавить("Дебет");	
	ТЗ.Колонки.Добавить("Кредит");
	ТЗ.Колонки.Добавить("Формула");
	ТЗ.Колонки.Добавить("Знак");
	ТЗ.Колонки.Добавить("ВидКапитала");
	ТЗ.Очистить();
	
	// 3. Запись настроек в ТЗ
	Пока СокрЛП(КодСтроки) <> "" Цикл
		НаименованиеОтчета	= Макет.Область(Индекс, ОбластьНаименование.Лево, Индекс, ОбластьНаименование.Право).Текст;
		НаименованиеК		= Макет.Область(Индекс, ОбластьНаименованиеК.Лево, Индекс, ОбластьНаименованиеК.Право).Текст;
		ЗаголовокОтчета		= Макет.Область(Индекс, ОбластьЗаголовок.Лево, Индекс, ОбластьЗаголовок.Право).Текст;
		Знак				= Макет.Область(Индекс, ОбластьЗнак.Лево, Индекс, ОбластьЗнак.Право).Текст;
		Дебет				= СокрЛП(Макет.Область(Индекс, ОбластьДебет.Лево, Индекс, ОбластьДебет.Право).Текст);
		Кредит				= СокрЛП(Макет.Область(Индекс, ОбластьКредит.Лево, Индекс, ОбластьКредит.Право).Текст);		
		Формула				= Макет.Область(Индекс, ОбластьФормула.Лево, Индекс, ОбластьФормула.Право).Текст;
		ЗнакГруппы			= Макет.Область(Индекс, ОбластьЗнакГруппы.Лево, Индекс, ОбластьЗнакГруппы.Право).Текст;
		Группа				= Макет.Область(Индекс, ОбластьГруппа.Лево, Индекс, ОбластьГруппа.Право).Текст;
		ВидКапитала			= Макет.Область(Индекс, ОбластьВидКапитала.Лево, Индекс, ОбластьВидКапитала.Право).Текст;
		
		// 3. Формирование строки ТЗ
		СТЗ = ТЗ.Добавить();
		
		// 3.1. Код, Наименование, Заголовок, Группа
		СТЗ.Строка = КодСтроки;
		СТЗ.Наименование 	= НаименованиеОтчета;
		СТЗ.НаименованиеК 	= НаименованиеК;
		СТЗ.Заголовок		= ЗаголовокОтчета;
		СТЗ.Группа			= Группа;
		
		
		// 3.2. Знак
		Если СокрЛП(Знак) = "-" Тогда
			СТЗ.Знак = Перечисления.ПлюсМинус.Минус;
		КонецЕсли;
		
		// 3.3. Знак группы
		Если СокрЛП(ЗнакГруппы) = "-" Тогда
			СТЗ.ЗнакГруппы = Перечисления.ПлюсМинус.Минус;
		КонецЕсли;
		
		// 3.4. Дебет
		Если ЗаголовокОтчета = "ЛОЖЬ" И Дебет <> "" Тогда
			СТЗ.Дебет 	= ПланыСчетов.Хозрасчетный.НайтиПоКоду(СокрЛП(Дебет));
			СТЗ.Счет 	= СТЗ.Дебет;	
			Если СТЗ.Дебет.Пустая() Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не найден счет для строки %1", КодСтроки));
			КонецЕсли;
		КонецЕсли;
		
		// 3.4а. Кредит
		Если ЗаголовокОтчета = "ЛОЖЬ" И Кредит <> "" Тогда
			СТЗ.Кредит = ПланыСчетов.Хозрасчетный.НайтиПоКоду(СокрЛП(Кредит));			
			СТЗ.Счет 	= СТЗ.Кредит;	
			Если СТЗ.Кредит.Пустая() Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не найден счет для строки %1", КодСтроки));
			КонецЕсли;
		КонецЕсли;
		
		// 3.5. Формула 
		Если СокрЛП(Формула) = "ОборотыДт" Тогда
			СТЗ.Формула	= Перечисления.Формулы.ОборотыДт
		ИначеЕсли СокрЛП(Формула) = "ОборотыДтКт" Тогда
			СТЗ.Формула	= Перечисления.Формулы.ОборотыДтКт
		ИначеЕсли СокрЛП(Формула) = "ОборотыКт" Тогда
			СТЗ.Формула	= Перечисления.Формулы.ОборотыКт
		ИначеЕсли СокрЛП(Формула) = "СальдоДт" Тогда
			СТЗ.Формула	= Перечисления.Формулы.СальдоДт
		ИначеЕсли СокрЛП(Формула) = "СальдоКт" Тогда
			СТЗ.Формула	= Перечисления.Формулы.СальдоКт
		ИначеЕсли СокрЛП(Формула) = "СальдоНачальное" Тогда
			СТЗ.Формула	= Перечисления.Формулы.СальдоНачальное
		ИначеЕсли СокрЛП(Формула) = "СальдоКонечное" Тогда
			СТЗ.Формула	= Перечисления.Формулы.СальдоКонечное	
		КонецЕсли;
		
		// 3.6. Вид капитала
		Если СокрЛП(ВидКапитала) = "УК" Тогда
			СТЗ.ВидКапитала	= Перечисления.ВидыКапитала.УставныйКапитал;
		ИначеЕсли СокрЛП(ВидКапитала) = "ПК" Тогда
			СТЗ.ВидКапитала	= Перечисления.ВидыКапитала.ПрочийКапитал;
		ИначеЕсли СокрЛП(ВидКапитала) = "НП" Тогда
			СТЗ.ВидКапитала	= Перечисления.ВидыКапитала.НераспределеннаяПрибыль;
		КонецЕсли;
		
		// 4. Подготовка следующей строки
		Индекс 		= Индекс + 1;
		КодСтроки 	= Макет.Область(Индекс, ОбластьКод.Лево, Индекс, ОбластьКод.Право).Текст;
		
	КонецЦикла;;
	
	// 5. Загрузка закладки НАСТРОЙКИ
	Настройки.Очистить();
	Настройки.Загрузить(ТЗ);
	
	// 6. Загрузка закладки ДДС
	ТЗ.Свернуть("Строка,Наименование,НаименованиеК,Группа,ЗнакГруппы,Заголовок");
	Отчет.Очистить();
	Отчет.Загрузить(ТЗ);
	
	РазгруппировкаСтрок();
КонецПроцедуры

Процедура ЗагрузитьБазовыеНастройкиБаланс() Экспорт
	
	Макет = ПолучитьМакет("НастройкаБаланс");
	
	// 1. Выборка областей и подготовка кода первой строки
	ОбластьКод   		   		= Макет.Области.Код;
	ОбластьНаименование     	= Макет.Области.Наименование;
	ОбластьНаименованиеК		= Макет.Области.НаименованиеК;
	ОбластьЗаголовок			= Макет.Области.Заголовок;
	ОбластьЗнак					= Макет.Области.Знак;
	ОбластьДебет				= Макет.Области.Дебет;
	ОбластьКредит				= Макет.Области.Кредит;	
	ОбластьФормула				= Макет.Области.Формула;
	ОбластьГруппа				= Макет.Области.Группа;
	
	Индекс = 1;
	КодСтроки 		= Макет.Область(Индекс, ОбластьКод.Лево, Индекс, ОбластьКод.Право).Текст;
	
	// 2. Создание общей ТЗ
	ТЗ = Отчет.Выгрузить();
	ТЗ.Колонки.Добавить("Счет");
	ТЗ.Колонки.Добавить("Дебет");
	ТЗ.Колонки.Добавить("Кредит");
	ТЗ.Колонки.Добавить("Формула");
	ТЗ.Колонки.Добавить("Знак");
	ТЗ.Очистить();
	
	// 3. Запись настроек в ТЗ
	Пока СокрЛП(КодСтроки) <> "" Цикл
		НаименованиеОтчета	= Макет.Область(Индекс, ОбластьНаименование.Лево, Индекс, ОбластьНаименование.Право).Текст;
		НаименованиеК		= Макет.Область(Индекс, ОбластьНаименованиеК.Лево, Индекс, ОбластьНаименованиеК.Право).Текст;
		ЗаголовокОтчета		= Макет.Область(Индекс, ОбластьЗаголовок.Лево, Индекс, ОбластьЗаголовок.Право).Текст;
		Знак				= Макет.Область(Индекс, ОбластьЗнак.Лево, Индекс, ОбластьЗнак.Право).Текст;
		Дебет				= СокрЛП(Макет.Область(Индекс, ОбластьДебет.Лево, Индекс, ОбластьДебет.Право).Текст);
		Кредит				= СокрЛП(Макет.Область(Индекс, ОбластьКредит.Лево, Индекс, ОбластьКредит.Право).Текст);		
		Формула				= Макет.Область(Индекс, ОбластьФормула.Лево, Индекс, ОбластьФормула.Право).Текст;
		Группа				= Макет.Область(Индекс, ОбластьГруппа.Лево, Индекс, ОбластьГруппа.Право).Текст;
		
		// 3. Формирование строки ТЗ
		СТЗ = ТЗ.Добавить();
		
		// 3.1. Код, Наименование, Заголовок, Группа
		СТЗ.Строка = КодСтроки;
		СТЗ.Наименование 	= НаименованиеОтчета;
		СТЗ.НаименованиеК 	= НаименованиеК;
		СТЗ.Заголовок		= ЗаголовокОтчета;
		СТЗ.Группа			= Группа;
		
		// 3.2. Знак
		Если СокрЛП(Знак) = "-" Тогда
			СТЗ.Знак = Перечисления.ПлюсМинус.Минус;
		КонецЕсли;
		
		// 3.4. Дебет
		Если ЗаголовокОтчета = "ЛОЖЬ" И Дебет <> "" Тогда
			СТЗ.Дебет = ПланыСчетов.Хозрасчетный.НайтиПоКоду(СокрЛП(Дебет));			
			СТЗ.Счет 	= СТЗ.Дебет;			
			Если СТЗ.Дебет.Пустая()  Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не найден счет для строки %1", КодСтроки));
			КонецЕсли;
		КонецЕсли;
		
		// 3.4а. Кредит
		Если ЗаголовокОтчета = "ЛОЖЬ" И Кредит <> "" Тогда
			СТЗ.Кредит = ПланыСчетов.Хозрасчетный.НайтиПоКоду(СокрЛП(Кредит));			
			СТЗ.Счет 	= СТЗ.Кредит;				
			Если СТЗ.Кредит.Пустая() Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не найден счет для строки %1", КодСтроки));
			КонецЕсли;
		КонецЕсли;
		
		
		// 3.5. Формула 
		Если СокрЛП(Формула) = "ОборотыДт" Тогда
			СТЗ.Формула	= Перечисления.Формулы.ОборотыДт
		ИначеЕсли СокрЛП(Формула) = "ОборотыДтКт" Тогда
			СТЗ.Формула	= Перечисления.Формулы.ОборотыДтКт
		ИначеЕсли СокрЛП(Формула) = "ОборотыКт" Тогда
			СТЗ.Формула	= Перечисления.Формулы.ОборотыКт
		ИначеЕсли СокрЛП(Формула) = "СальдоДт" Тогда
			СТЗ.Формула	= Перечисления.Формулы.СальдоДт
		ИначеЕсли СокрЛП(Формула) = "СальдоКт" Тогда
			СТЗ.Формула	= Перечисления.Формулы.СальдоКт
		КонецЕсли;
		
		// 4. Подготовка следующей строки
		Индекс 		= Индекс + 1;
		КодСтроки 	= Макет.Область(Индекс, ОбластьКод.Лево, Индекс, ОбластьКод.Право).Текст;
		
	КонецЦикла;;
	
	
	// 5. Загрузка закладки НАСТРОЙКИ
	Настройки.Очистить();
	Настройки.Загрузить(ТЗ);
	
	// 6. Загрузка закладки ДДС
	ТЗ.Свернуть("Строка,Наименование, НаименованиеК,Группа,ЗнакГруппы,Заголовок");
	Отчет.Очистить();
	Отчет.Загрузить(ТЗ);
	
	РазгруппировкаСтрок();
	
КонецПроцедуры

Процедура ЗагрузитьБазовыеНастройкиДДС() Экспорт 
	
	Макет = ПолучитьМакет("НастройкаДДС");
	
	// 1. Выборка областей и подготовка кода первой строки
	ОбластьКод   		   		= Макет.Области.Код;
	ОбластьНаименование     	= Макет.Области.Наименование;
	ОбластьНаименованиеК		= Макет.Области.НаименованиеК;
	ОбластьЗаголовок			= Макет.Области.Заголовок;
	ОбластьЗнак					= Макет.Области.Знак;
	ОбластьДебет				= Макет.Области.Дебет;
	ОбластьКредит				= Макет.Области.Кредит;	
	ОбластьФормула				= Макет.Области.Формула;
	ОбластьЗнакГруппы			= Макет.Области.ЗнакГруппы;
	ОбластьГруппа				= Макет.Области.Группа;
	
	Индекс = 1;
	КодСтроки 		= Макет.Область(Индекс, ОбластьКод.Лево, Индекс, ОбластьКод.Право).Текст;
	
	// 2. Создание общей ТЗ
	ТЗ = Отчет.Выгрузить();
	ТЗ.Колонки.Добавить("Счет");
	ТЗ.Колонки.Добавить("Дебет");
	ТЗ.Колонки.Добавить("Кредит");
	ТЗ.Колонки.Добавить("Формула");
	ТЗ.Колонки.Добавить("Знак");
	ТЗ.Очистить();
	
	// 3. Запись настроек в ТЗ
	Пока СокрЛП(КодСтроки) <> "" Цикл
		НаименованиеОтчета	= Макет.Область(Индекс, ОбластьНаименование.Лево, Индекс, ОбластьНаименование.Право).Текст;
		НаименованиеК		= Макет.Область(Индекс, ОбластьНаименованиеК.Лево, Индекс, ОбластьНаименованиеК.Право).Текст;
		ЗаголовокОтчета		= Макет.Область(Индекс, ОбластьЗаголовок.Лево, Индекс, ОбластьЗаголовок.Право).Текст;
		Знак				= Макет.Область(Индекс, ОбластьЗнак.Лево, Индекс, ОбластьЗнак.Право).Текст;
		Дебет				= СокрЛП(Макет.Область(Индекс, ОбластьДебет.Лево, Индекс, ОбластьДебет.Право).Текст);
		Кредит				= СокрЛП(Макет.Область(Индекс, ОбластьКредит.Лево, Индекс, ОбластьКредит.Право).Текст);		
		Формула				= Макет.Область(Индекс, ОбластьФормула.Лево, Индекс, ОбластьФормула.Право).Текст;
		ЗнакГруппы			= Макет.Область(Индекс, ОбластьЗнакГруппы.Лево, Индекс, ОбластьЗнакГруппы.Право).Текст;
		Группа				= Макет.Область(Индекс, ОбластьГруппа.Лево, Индекс, ОбластьГруппа.Право).Текст;
		
		// 3. Формирование строки ТЗ
		СТЗ = ТЗ.Добавить();
		
		// 3.1. Код, Наименование, Заголовок, Группа
		СТЗ.Строка = КодСтроки;
		СТЗ.Наименование 	= НаименованиеОтчета;
		СТЗ.НаименованиеК 	= НаименованиеК;
		СТЗ.Заголовок		= ЗаголовокОтчета;
		СТЗ.Группа			= Группа;
		
		// 3.2. Знак
		Если СокрЛП(Знак) = "-" Тогда
			СТЗ.Знак = Перечисления.ПлюсМинус.Минус;
		КонецЕсли;
		
		// 3.3. Знак группы
		Если СокрЛП(ЗнакГруппы) = "-" Тогда
			СТЗ.ЗнакГруппы = Перечисления.ПлюсМинус.Минус;
		КонецЕсли;
		
		// 3.4. Дебет
		Если ЗаголовокОтчета = "ЛОЖЬ" И Дебет <> "" Тогда
			СТЗ.Дебет 	= ПланыСчетов.Хозрасчетный.НайтиПоКоду(СокрЛП(Дебет));
			
			Если СТЗ.Дебет.Пустая() Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не найден счет для строки %1", КодСтроки));
			КонецЕсли;
		КонецЕсли;
		
		// 3.4а. Кредит
		Если ЗаголовокОтчета = "ЛОЖЬ" И Кредит <> "" Тогда
			СТЗ.Кредит = ПланыСчетов.Хозрасчетный.НайтиПоКоду(СокрЛП(Кредит));			
			
			Если СТЗ.Кредит.Пустая() Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не найден счет для строки %1", КодСтроки));
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ СТЗ.Дебет = Неопределено И НЕ СТЗ.Дебет.Пустая() Тогда
			СТЗ.Счет = СТЗ.Дебет;
		ИначеЕсли НЕ СТЗ.Кредит = Неопределено И НЕ СТЗ.Кредит.Пустая()	Тогда
			СТЗ.Счет = СТЗ.Кредит;
		КонецЕсли;
		
		Если НЕ СТЗ.Дебет = Неопределено 
			И НЕ СТЗ.Дебет.Пустая()
			И НЕ СТЗ.Дебет.Родитель = ПланыСчетов.Хозрасчетный.ДенежныеСредстваВКассе
			И НЕ СТЗ.Дебет.Родитель = ПланыСчетов.Хозрасчетный.ДенежныеСредстваВБанке Тогда
			
			СТЗ.Счет = СТЗ.Дебет;
		ИначеЕсли 
			НЕ СТЗ.Кредит = Неопределено 
			И НЕ СТЗ.Кредит.Пустая()
			И НЕ СТЗ.Кредит.Родитель = ПланыСчетов.Хозрасчетный.ДенежныеСредстваВКассе
			И НЕ СТЗ.Кредит.Родитель = ПланыСчетов.Хозрасчетный.ДенежныеСредстваВБанке Тогда
			СТЗ.Счет = СТЗ.Кредит;
		КонецЕсли;
		
		
		// 3.5. Формула 
		Если СокрЛП(Формула) = "ОборотыДт" Тогда
			СТЗ.Формула	= Перечисления.Формулы.ОборотыДт
		ИначеЕсли СокрЛП(Формула) = "ОборотыДтКт" Тогда
			СТЗ.Формула	= Перечисления.Формулы.ОборотыДтКт
		ИначеЕсли СокрЛП(Формула) = "ОборотыКт" Тогда
			СТЗ.Формула	= Перечисления.Формулы.ОборотыКт
		ИначеЕсли СокрЛП(Формула) = "СальдоДт" Тогда
			СТЗ.Формула	= Перечисления.Формулы.СальдоДт
		ИначеЕсли СокрЛП(Формула) = "СальдоКт" Тогда
			СТЗ.Формула	= Перечисления.Формулы.СальдоКт
		ИначеЕсли СокрЛП(Формула) = "СальдоНачальное" Тогда
			СТЗ.Формула	= Перечисления.Формулы.СальдоНачальное
		ИначеЕсли СокрЛП(Формула) = "СальдоКонечное" Тогда
			СТЗ.Формула	= Перечисления.Формулы.СальдоКонечное	
		КонецЕсли;
		
		// 4. Подготовка следующей строки
		Индекс 		= Индекс + 1;
		КодСтроки 	= Макет.Область(Индекс, ОбластьКод.Лево, Индекс, ОбластьКод.Право).Текст;
		
	КонецЦикла;;
	
	// 5. Загрузка закладки НАСТРОЙКИ
	Настройки.Очистить();
	Настройки.Загрузить(ТЗ);
	
	// 6. Загрузка закладки ДДС
	ТЗ.Свернуть("Строка,Наименование,НаименованиеК,Группа,ЗнакГруппы,Заголовок");
	Отчет.Очистить();
	Отчет.Загрузить(ТЗ);
	
	РазгруппировкаСтрок();
КонецПроцедуры

Процедура РазгруппировкаСтрок() Экспорт
	
	
	// 1. Список групп
	ТЗСГ = Отчет.Выгрузить();
	ТЗСГ.Свернуть("Группа");
	
	// 2. Удалить пустую строку
	СТЗПусто = ТЗСГ.Найти("","Группа");
	Если СТЗПусто <> Неопределено Тогда 
		ТЗСГ.Удалить(СТЗПусто);	
	КонецЕсли;
	
	// 3. Добавить колонку для прохода - всем группам присваивается уровень 1
	ТЗСГ.Колонки.Добавить("Проход");
	ТЗСГ.ЗаполнитьЗначения(1,"Проход");
	
	// 4. Список групп - формирование номеров проходов
	КЦ = 1;
	Пока КЦ < 20 Цикл
		ГруппаПустая = Истина;
		Для Каждого СТЗ Из ТЗСГ Цикл
			Если СТЗ.Проход = КЦ Тогда
				Отбор = Новый Структура("Строка",СТЗ.Группа);
				СтрокиГруппы  = Отчет.НайтиСтроки(Отбор);
				Для Каждого Стр Из СтрокиГруппы Цикл 
					СТЗСГ = ТЗСГ.Найти(Стр.Группа,"Группа");
					Если СТЗСГ <> Неопределено Тогда				
						СТЗСГ.Проход = КЦ+1;
						ГруппаПустая = Ложь;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		Если ГруппаПустая Тогда
			Прервать;
		КонецЕсли;
		КЦ = КЦ+1;
	КонецЦикла;
	
	// 5. Простановка проходов в отчете
	Для Каждого СТЧ Из Отчет Цикл
		СТЗСГ = ТЗСГ.Найти(СТЧ.Строка,"Группа");
		Если СТЗСГ <> Неопределено Тогда 
			СТЧ.Проход = СТЗСГ.Проход;	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

