
#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура СохранитьНовыеНастройкиИОбновитьИнтерфейс(ИзменныеНастройки)
	
	Для Каждого ЭлементНастройки Из ИзменныеНастройки Цикл
		
		ТекущееЗначениеНастройки = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьЗначениеНастройки(ЭлементНастройки.Ключ);
		Если ЭлементНастройки.Значение <> ТекущееЗначениеНастройки Тогда
			
			БухгалтерскийУчетСервер.УстановитьНастройкуПользователя(ЭлементНастройки.Значение, ЭлементНастройки.Ключ);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьВидимостьДоступностьЭлементов()

	Элементы.ЗапрашиватьЦену.Видимость = Истина;
	
	Если НЕ Корзина = "КорзинаРеализации" Тогда
		Элементы.ЗапрашиватьЦену.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Корзина = Параметры.Корзина;
	ЗапрашиватьКоличество 	= БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьЗначениеНастройки("ЗапрашиватьКоличество");
	
	Если Корзина = "КорзинаРеализации" Тогда
		ЗапрашиватьЦену	= БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьЗначениеНастройки("ЗапрашиватьЦену");
	КонецЕсли;
	
	УстановитьВидимостьДоступностьЭлементов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ИзменныеНастройки = Новый Структура;
	
	Если Модифицированность Тогда
		
		ИзменныеНастройки.Вставить("ЗапрашиватьКоличество", ЗапрашиватьКоличество);
		
		Если Корзина = "КорзинаРеализации" Тогда
			ИзменныеНастройки.Вставить("ЗапрашиватьЦену", ЗапрашиватьЦену);
		КонецЕсли;
		
		СохранитьНовыеНастройкиИОбновитьИнтерфейс(ИзменныеНастройки);
				
	КонецЕсли;
	
	Закрыть(ИзменныеНастройки);
	
КонецПроцедуры

#КонецОбласти
