#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КартСчетаСотрудников.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КартСчетаСотрудников КАК КартСчетаСотрудников
		|ГДЕ
		|	КартСчетаСотрудников.Владелец = &Владелец
		|	И НЕ КартСчетаСотрудников.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Владелец", Владелец);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		ТекстСообщения = НСтр("ru = 'Для сотрудника ранее уже создан карт.счет. Создание нескольких карт.счетов не предусмотрено.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли