#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Контроль для действующих карт.счетов.
	Если НЕ ВАрхиве Тогда 
		Запрос = Новый Запрос();
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	КартСчетаСотрудников.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.КартСчетаСотрудников КАК КартСчетаСотрудников
			|ГДЕ
			|	КартСчетаСотрудников.Владелец = &Владелец
			|	И НЕ КартСчетаСотрудников.Ссылка = &Ссылка
			|	И НЕ КартСчетаСотрудников.ВАрхиве";
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("Владелец", Владелец);
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда 
			ТекстСообщения = НСтр("ru = 'Для сотрудника ранее уже создан карт.счет. Создание нескольких карт.счетов не предусмотрено.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли