
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Это не новая запись
	Если ЗначениеЗаполнено(Запись.СпособОценкиТМЗ) Тогда 
		ТолькоПросмотр = Истина;
	Иначе 
		Запись.СпособОценкиТМЗ = Перечисления.СпособыОценки.ПоСредней;
	КонецЕсли;	

	УстановитьФункциональныеОпцииФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Установить видимость и доступность элементов формы
	УстановитьВидимостьДоступностьЭлементов();	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПлательщикНДСПриИзменении(Элемент)
	
	Если Запись.ПлательщикНДС Тогда 
		 Запись.ОтчетПоНСПВСекциюБ = Ложь;
	КонецЕсли;
	УстановитьВидимостьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ПлательщикНСППриИзменении(Элемент)
	
	Если Не Запись.ПлательщикНСП Тогда 
		 Запись.ОтчетПоНСПВСекциюБ = Ложь;
	КонецЕсли;
	УстановитьВидимостьДоступностьЭлементов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВключитьВозможностьРедактирования(Команда)
	
	ТолькоПросмотр = Ложь;
	Элементы.ФормаВключитьВозможностьРедактирования.Доступность = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Процедура устанавливает видимость и доступность элементов.
//
Процедура УстановитьВидимостьДоступностьЭлементов()
	Элементы.ОтчетПоНСПВСекциюБ.Видимость = Запись.ПлательщикНСП И Не Запись.ПлательщикНДС;
КонецПроцедуры // УстановитьВидимостьДоступностьЭлементов()

// Процедура устанавливает функциональные опции формы документа.
//
&НаСервере
Процедура УстановитьФункциональныеОпцииФормы()
	ОбщегоНазначенияБПКлиентСервер.УстановитьПараметрыФункциональныхОпцийФормыДокумента(ЭтаФорма, Запись.Организация, Запись.Период);
КонецПроцедуры

#КонецОбласти
