#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЭтотОбъект.ЗакрыватьПриВыборе            = Истина;
	ЭтотОбъект.ЗакрыватьПриЗакрытииВладельца = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	#Если ВебКлиент Тогда

		Элементы.ГруппаИмяФайла.Видимость = Ложь;

	#КонецЕсли

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаЗагрузить(Команда)

	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = НСтр("ru='Выберите файл, откуда взять содержимое новости в формате XML'");
	Диалог.МножественныйВыбор = Ложь;
	Диалог.ПроверятьСуществованиеФайла = Истина;
	Диалог.Расширение = "xml";
	Диалог.Фильтр = НСтр("ru='Файл xml (*.xml)|*.xml'");

	ДополнительныеПараметры = Новый Структура;
	ОписаниеОповещенияПослеВыбора = Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтотОбъект, ДополнительныеПараметры);

	Диалог.Показать(ОписаниеОповещенияПослеВыбора);

КонецПроцедуры

&НаКлиенте
Процедура КомандаИмпортировать(Команда)

	Если ПустаяСтрока(ЭтотОбъект.ПредставлениеXML) Тогда
		ОповеститьОВыборе(Ложь);
	Иначе
		ОповеститьОВыборе(ЭтотОбъект.ПредставлениеXML);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеВыбораФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт

	ТипМассив = Тип("Массив");

	Если (ТипЗнч(ВыбранныеФайлы) = ТипМассив)
			И (ВыбранныеФайлы.Количество() > 0) Тогда

		ИмяФайла = ВыбранныеФайлы[0];

		Если НЕ ПустаяСтрока(ИмяФайла) Тогда
			ЧтениеТекста = Новый ЧтениеТекста(ИмяФайла, "UTF-8", Символы.ПС, Символы.ПС, Ложь);
				ЭтотОбъект.ПредставлениеXML = ЧтениеТекста.Прочитать();
			ЧтениеТекста .Закрыть();
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти
