////////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ ПОЛУЧЕНИЯ НАСТРОЕК

// Возвращает валюту регламентированного учета
// Если переданная в качестве параметра валюта уже заполнена - возвращает ее.
// Если валюта не передана в качестве параметра или передан пустой,
// валюту рег. учета. Если валюта рег. учета не заполнена - возвращает пустую ссылку на валюту
//
// Параметры:
// Валюта - СправочникСсылка.Валюты - Валюта, которую нужно заполнить
//
// Возвращаемое значение:
// СправочникСсылка.Валюты
//
Функция ПолучитьВалютуРегламентированногоУчета(Знач Валюта = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Валюта) Тогда
		Возврат Константы.ВалютаРегламентированногоУчета.Получить();
	Иначе
		Возврат Валюта;
	КонецЕсли;
	
КонецФункции 

// Возвращает глобальную настройку Расчеты не в валюте договора контрагента
//
// Возвращаемое значение:
// Истина - если в любой валюте
// Ложь - если валюта договора и валюта Касса/Банк должны совпадать
//
Функция ПолучитьНастройкуРасчетыНеВВалютеДоговора() Экспорт
	
	Возврат Константы.РасчетыНеВВалютеДоговора.Получить();
	
КонецФункции 
