#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура - Заполнить по умолчанию
// Выполняет первоночальное заполнение
Процедура ЗаполнитьПоУмолчанию() Экспорт 
	СправочникМенеджер = Справочники.СпособыОтраженияРасходовПоАмортизации;
	
	КлассификаторXML = СправочникМенеджер.ПолучитьМакет("МакетЗаполнения").ПолучитьТекст();
	КлассификаторТаблица = ОбщегоНазначения.ПрочитатьXMLВТаблицу(КлассификаторXML).Данные;     
	
	Для Каждого СтрокаТаблицыЗначений Из КлассификаторТаблица Цикл
		Наименование = СокрЛП(СтрокаТаблицыЗначений.Наименование);
		Коэффициент = СокрЛП(СтрокаТаблицыЗначений.Коэффициент);
		СчетЗатрат = ПланыСчетов.Хозрасчетный.НайтиПоКоду(СокрЛП(СтрокаТаблицыЗначений.СчетЗатрат));
		ТипСубконто1 = СокрЛП(СтрокаТаблицыЗначений.ТипСубконто1);
		Субконто1 = Справочники[ТипСубконто1][СокрЛП(СтрокаТаблицыЗначений.Субконто1)];
		
		СправочникСсылка = СправочникМенеджер.НайтиПоНаименованию(Наименование, Истина);
		
		Если СправочникСсылка.Пустая() Тогда
			СправочникОбъект = СправочникМенеджер.СоздатьЭлемент();
		Иначе
			СправочникОбъект = СправочникСсылка.ПолучитьОбъект();
		КонецЕсли;	
		
		СправочникОбъект.Наименование = Наименование;
		СправочникОбъект.Способы.Очистить();
		
		СтрокаТабличнойЧасти = СправочникОбъект.Способы.Добавить();
		СтрокаТабличнойЧасти.СчетЗатрат = СчетЗатрат;
		СтрокаТабличнойЧасти.Субконто1 = Субконто1;
		СтрокаТабличнойЧасти.Коэффициент = Коэффициент;
		
		БухгалтерскийУчетКлиентСервер.ЗаписатьСправочникОбъект(СправочникОбъект,,,,Истина);
	КонецЦикла;
КонецПроцедуры // ЗаполнитьПоУмолчанию()	

#КонецОбласти
	
#КонецЕсли

