#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыПроведенияДокумента

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьСостояниеЗаказов(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	ВременнаяТаблицаШапка.Заказ КАК Заказ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ВидЗакрытия = ЗНАЧЕНИЕ(Перечисление.ВидыЗакрытияЗаказов.Закрыт)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовПоПроизводству.Отменен)
		|		ИНАЧЕ ВременнаяТаблицаСостояниеЗаказов.Состояние
		|	КОНЕЦ КАК Состояние,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ВидЗакрытия = ЗНАЧЕНИЕ(Перечисление.ВидыЗакрытияЗаказов.ПереводНаВнутренний)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Внутренний,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ВидЗакрытия = ЗНАЧЕНИЕ(Перечисление.ВидыЗакрытияЗаказов.ПереводНаВнутренний)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ПереводВоВнутренний,
		|	ВременнаяТаблицаШапка.ВидЗакрытия КАК ВидИзмененияЗаказа
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСостояниеЗаказов КАК ВременнаяТаблицаСостояниеЗаказов
		|	ПО ВременнаяТаблицаШапка.Заказ = ВременнаяТаблицаСостояниеЗаказов.Заказ";
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСостояниеЗаказов", РезультатЗапроса.Выгрузить());
КонецПроцедуры

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаДокумента.Дата КАК Дата,
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ТаблицаДокумента.Заказ КАК Заказ,
		|	ТаблицаДокумента.ВидЗакрытия КАК ВидЗакрытия
		|ПОМЕСТИТЬ ВременнаяТаблицаШапка
		|ИЗ
		|	Документ.ЗакрытиеЗаказовНаПроизводство КАК ТаблицаДокумента
		|ГДЕ
		|	ТаблицаДокумента.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СостояниеЗаказовСрезПоследних.Заказ КАК Заказ,
		|	СостояниеЗаказовСрезПоследних.Состояние КАК Состояние
		|ПОМЕСТИТЬ ВременнаяТаблицаСостояниеЗаказов
		|ИЗ
		|	РегистрСведений.СостояниеЗаказов.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Регистратор <> &Ссылка
		|				И Заказ В
		|					(ВЫБРАТЬ
		|						ВременнаяТаблицаШапка.Заказ
		|					ИЗ
		|						ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка)) КАК СостояниеЗаказовСрезПоследних";
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("Период", СтруктураДополнительныеСвойства.ДляПроведения.Дата);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.Выполнить();
	
	СформироватьСостояниеЗаказов(ДокументСсылка, СтруктураДополнительныеСвойства);
КонецПроцедуры // ИнициализироватьДанныеДокумента()

#КонецОбласти

#Область ВерсионированиеОбъектов

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#КонецЕсли