////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

#Область РаботаСПодбором

Процедура ОткрытьПодбор(ФормаВладелец) Экспорт
	
	ПараметрыПодбора = Новый Структура;
	Отказ = Ложь;
	
	ЗаполнитьЗначенияПараметровПодбора(ФормаВладелец, ПараметрыПодбора);
	
	Если НЕ Отказ Тогда
		ОписаниеОповещенияПриЗакрытииПодбора = Новый ОписаниеОповещения("ПриЗакрытииПодбораДокументов", РаботаСПодборомДокументовКлиент.ЭтотОбъект);
		ОткрытьФорму("Обработка.ПодборДокументовДляСчетФактур.Форма.Форма", 
			ПараметрыПодбора, ФормаВладелец, Истина, , , ОписаниеОповещенияПриЗакрытииПодбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

// Процедура обработки результатов закрытия подбора
//
Процедура ПриЗакрытииПодбораДокументов(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗакрытия) = Тип("Структура") Тогда
		Если НЕ ПустаяСтрока(РезультатЗакрытия.АдресКорзиныВХранилище) Тогда
			Оповестить("ПодборДокументовСФПроизведен", РезультатЗакрытия.АдресКорзиныВХранилище, РезультатЗакрытия.УникальныйИдентификаторФормыВладельца);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ПриЗакрытииПодбора()

// Получение данных из форм-владельцев

Процедура ЗаполнитьЗначенияПараметровПодбора(ФормаВладелец, ПараметрыПодбора)
	
	НачалоПериода = НачалоДня (НачалоМесяца (ФормаВладелец.ЭтотОбъект.Объект.Дата));
	КонецПериода  = КонецДня (КонецМесяца (ФормаВладелец.ЭтотОбъект.Объект.Дата));
	
	ПараметрыПодбора.Вставить("Ссылка", ФормаВладелец.ЭтотОбъект.Объект.Ссылка);
	ПараметрыПодбора.Вставить("Организация", ФормаВладелец.ЭтотОбъект.Объект.Организация);
	ПараметрыПодбора.Вставить("Контрагент", ФормаВладелец.ЭтотОбъект.Объект.Контрагент);
	ПараметрыПодбора.Вставить("ДокументВозврата", ФормаВладелец.ЭтотОбъект.Объект.ВозвратТоваров);
	ПараметрыПодбора.Вставить("НачалоПериода", НачалоПериода);
	ПараметрыПодбора.Вставить("КонецПериода", КонецПериода);
	ПараметрыПодбора.Вставить("УникальныйИдентификаторФормыВладельца", ФормаВладелец.УникальныйИдентификатор);	
		
КонецПроцедуры

// Конец Получение данных из форм-владельцев

#КонецОбласти


