#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает описание блокируемых реквизитов.
//
// Возвращаемое значение:
//  Массив - содержит строки в формате ИмяРеквизита[;ИмяЭлементаФормы,...]
//           где ИмяРеквизита - имя реквизита объекта, ИмяЭлементаФормы - имя элемента формы,
//           связанного с реквизитом.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	БлокируемыеРеквизиты = Новый Массив;
	
	БлокируемыеРеквизиты.Добавить("Владелец");
	БлокируемыеРеквизиты.Добавить("Банк");
	БлокируемыеРеквизиты.Добавить("ВалютаДенежныхСредств");
	БлокируемыеРеквизиты.Добавить("СчетУчета");
	
	Возврат БлокируемыеРеквизиты;
	
КонецФункции 

// Функция - Найти по номеру счета
//
// Параметры:
//  НомерСчета				 - Строка	 - 
//  Владелец				 - СправочникСсылка.Контрагент	 - 
//  ВалютаДенежныхСредств	 - СправочникСсылка.Валюты	 - 
// 
// Возвращаемое значение:
//  БанковскийСчет - СправочникСсылка.БанковскиеСчета - найденный банковский счет 
//
Функция НайтиПоНомеруСчета(НомерСчета, Владелец, ВалютаДенежныхСредств) Экспорт
	БанковскийСчет = Справочники.БанковскиеСчета.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	БанковскиеСчета.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.БанковскиеСчета КАК БанковскиеСчета
		|ГДЕ
		|	БанковскиеСчета.Владелец = &Владелец
		|	И БанковскиеСчета.НомерСчета = &НомерСчета
		|	И БанковскиеСчета.ВалютаДенежныхСредств = &ВалютаДенежныхСредств";
	
	Запрос.УстановитьПараметр("ВалютаДенежныхСредств", ВалютаДенежныхСредств);
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("НомерСчета", НомерСчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		БанковскийСчет = ВыборкаДетальныеЗаписи.Ссылка;		
	КонецЕсли;
	
	Возврат БанковскийСчет;	
КонецФункции

#КонецОбласти

#КонецЕсли