&НаКлиенте
Функция ДанныеДенежногоДокумента(ДанныеФормыСтруктура)
	СтруктураДанных = Новый Структура("Ссылка, Организация, Номер, Дата, СуммаДокумента, Операция, Контрагент, ФизЛицо, БанковскийСчет, БанковскийСчетПолучателя, 
										|Касса, СчетУчета, ДокументОснование, ВалютаДенежныхСредств, Курс, Комментарий, Автор");
	ЗаполнитьЗначенияСвойств(СтруктураДанных, ДанныеФормыСтруктура);
	
	Возврат СтруктураДанных;
КонецФункции // ()

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ИмяФормы = "";	
	Если ТипЗнч(ПараметрыВыполненияКоманды.Источник) = Тип("УправляемаяФорма") Тогда 
		ИмяФормы = ПараметрыВыполненияКоманды.Источник.ИмяФормы;
	КонецЕсли;			
	
	// Документы ППИ, ППВ, РКО, ПКО и Конвертация.
	Если ИмяФормы = "Документ.ПриходныйКассовыйОрдер.Форма.ФормаДокумента" Тогда 
		СтруктураДанных = ДанныеДенежногоДокумента(ПараметрыВыполненияКоманды.Источник.Объект);
		ПараметрыФормы = Новый Структура("СтруктураДанных, КлючНазначенияИспользования", 
						СтруктураДанных,
						"ЗапускМонитораИзДокумента");
						
		ОткрытьФорму("Отчет.МониторДенежныхСредств.Форма.Форма", 
			ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, 
			ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);			
			
	ИначеЕсли ИмяФормы = "Документ.ПлатежноеПоручениеИсходящее.Форма.ФормаДокумента"
		ИЛИ ИмяФормы = "Документ.ПлатежноеПоручениеВходящее.Форма.ФормаДокумента" 
		ИЛИ ИмяФормы = "Документ.ПриходныйКассовыйОрдер.Форма.ФормаДокумента" 
		ИЛИ ИмяФормы = "Документ.Конвертация.Форма.ФормаДокумента" Тогда 
		СтруктураДанных = ДанныеДенежногоДокумента(ПараметрыВыполненияКоманды.Источник.Объект);
		ПараметрыФормы = Новый Структура("СтруктураДанных, КлючНазначенияИспользования", 
						СтруктураДанных,
						"ЗапускМонитораИзДокумента");
						
		ОткрытьФорму("Отчет.МониторДенежныхСредств.Форма.Форма", 
			ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, 
			ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);			
			
	// Основные средства - Форма элемента справочника.
	ИначеЕсли ИмяФормы = "Справочник.ОсновныеСредства.Форма.ФормаЭлемента" Тогда 
		ПараметрыФормы = Новый Структура("ОсновноеСредство, КлючНазначенияИспользования", 
						,
						"ЗапускМонитораИзДокумента");
						
		ОткрытьФорму("Обработка.МониторОС.Форма.ОсновнаяФорма", 
			ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, 
			ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
			
	// Основные средства - Форма списка справочника.
	ИначеЕсли ИмяФормы = "Справочник.ОсновныеСредства.Форма.ФормаСписка" Тогда 
		ПараметрыФормы = Новый Структура("ОсновноеСредство, КлючНазначенияИспользования", 
						ПараметрыВыполненияКоманды.Источник.Элементы.Список.ТекущиеДанные.Ссылка,
						"ЗапускМонитораИзДокумента");
						
		ОткрытьФорму("Обработка.МониторОС.Форма.ОсновнаяФорма", 
			ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, 
			ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
			
	// Основные средства - Форма документа модернизация.
	ИначеЕсли ИмяФормы = "Документ.МодернизацияОС.Форма.ФормаДокумента" Тогда
		ПараметрыФормы = Новый Структура("ОсновноеСредство, КлючНазначенияИспользования", 
						ПараметрыВыполненияКоманды.Источник.Объект.ОсновноеСредство,
						"ЗапускМонитораИзДокумента");
						
		ОткрытьФорму("Обработка.МониторОС.Форма.ОсновнаяФорма", 
			ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, 
			ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
			
	// Основные средства - Форма документа.
	ИначеЕсли ИмяФормы = "Документ.ВыработкаОС.Форма.ФормаДокумента"
		Или ИмяФормы = "Документ.ИнвентаризацияОС.Форма.ФормаДокумента" 
		Или ИмяФормы = "Документ.МодернизацияОС.Форма.ФормаДокумента" 
		Или ИмяФормы = "Документ.ПринятиеКУчетуОС.Форма.ФормаДокумента"
		Или ИмяФормы = "Документ.СписаниеОС.Форма.ФормаДокумента" Тогда 
		
		СтрокаТабличнойЧасти = ПараметрыВыполненияКоманды.Источник.Элементы.ОС.ТекущиеДанные;
		ПараметрыФормы = Новый Структура("ОсновноеСредство, КлючНазначенияИспользования", 
						СтрокаТабличнойЧасти.ОсновноеСредство,
						"ЗапускМонитораИзДокумента");
						
		ОткрытьФорму("Обработка.МониторОС.Форма.ОсновнаяФорма", 
			ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, 
			ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
			
	// Основные средства - Форма документа ввод начальных остатков - раздел ОС.
	ИначеЕсли ИмяФормы = "Документ.ВводНачальныхОстатков.Форма.ФормаДокумента"
		И ПараметрыВыполненияКоманды.Источник.Объект.РазделУчета = "Основные средства" Тогда 
		
		ОткрытьФорму("Обработка.МониторОС.Форма.ОсновнаяФорма", 
			ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, 
			ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	КонецЕсли;
	
КонецПроцедуры