///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Заполняет виды доступа, используемые в ограничениях прав доступа.
// Примечание: виды доступа Пользователи и ВнешниеПользователи предопределены,
// но их можно удалить из списка ВидыДоступа, если они не требуются для ограничения прав доступа.
//
// Параметры:
//  ВидыДоступа - ТаблицаЗначений - с колонками:
//   * Имя                    - Строка - имя, используемое в описании поставляемых
//                                       профилей групп доступа и текстах ОДД.
//   * Представление          - Строка - представляет вид доступа в профилях и группах доступа.
//   * ТипЗначений            - Тип    - тип ссылки значений доступа,
//                                       например Тип("СправочникСсылка.Номенклатура").
//   * ТипГруппЗначений       - Тип    - тип ссылки групп значений доступа,
//                                       например Тип("СправочникСсылка.ГруппыДоступаНоменклатуры").
//   * НесколькоГруппЗначений - Булево - Истина указывает, что для значения доступа (Номенклатуры) можно
//                                       выбрать несколько групп значений (Групп доступа номенклатуры).
//
// Пример:
//  1. Для настройки прав доступа в разрезе организаций:
//  ВидДоступа = ВидыДоступа.Добавить();
//  ВидДоступа.Имя = "Организации";
//  ВидДоступа.Представление = НСтр("ru = 'Организации'");
//  ВидДоступа.ТипЗначений   = Тип("СправочникСсылка.Организации");
//
//  2. Для настройки прав доступа в разрезе групп партнеров:
//  ВидДоступа = ВидыДоступа.Добавить();
//  ВидДоступа.Имя = "ГруппыПартнеров";
//  ВидДоступа.Представление    = НСтр("ru = 'Группы партнеров'");
//  ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.Партнеры");
//  ВидДоступа.ТипГруппЗначений = Тип("СправочникСсылка.ГруппыДоступаПартнеров");
//
Процедура ПриЗаполненииВидовДоступа(ВидыДоступа) Экспорт
	
	// БПКР
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "Организации";
	ВидДоступа.Представление = НСтр("ru = 'Организации'");
	ВидДоступа.ТипЗначений   = Тип("СправочникСсылка.Организации");
	// Конец БПКР
	
КонецПроцедуры

// Позволяет указать списки, у которых объекты метаданных содержат описание логики ограничения
// доступа в модулях менеджеров или переопределяемом модуле.
//
// В модулях менеджеров указанных списков должна быть размещена процедура обработчика,
// в которую передаются следующие параметры.
// 
//  Ограничение - Структура - со свойствами:
//    * Текст                             - Строка - ограничение доступа для пользователей.
//                                            Если пустая строка, значит, доступ разрешен.
//    * ТекстДляВнешнихПользователей      - Строка - ограничение доступа для внешних пользователей.
//                                            Если пустая строка, значит, доступ запрещен.
//    * ПоВладельцуБезЗаписиКлючейДоступа - Неопределено - определить автоматически.
//                                        - Булево - если Ложь, то всегда записывать ключи доступа,
//                                            если Истина, тогда не записывать ключи доступа,
//                                            а использовать ключи доступа владельца (требуется,
//                                            чтобы ограничение было строго по объекту-владельцу).
///   * ПоВладельцуБезЗаписиКлючейДоступаДляВнешнихПользователей - Неопределено, Булево - см.
//                                            описание предыдущего параметра.
//
// Далее пример процедуры для модуля менеджера.
//
//// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
//Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
//	
//	Ограничение.Текст =
//	"РазрешитьЧтениеИзменение
//	|ГДЕ
//	|	ЗначениеРазрешено(Организация)
//	|	И ЗначениеРазрешено(Контрагент)";
//	
//КонецПроцедуры
//
// Параметры:
//  Списки - Соответствие - списки с ограничением доступа:
//             * Ключ     - ОбъектМетаданных - список с ограничением доступа.
//             * Значение - Булево - Истина - текст ограничения в модуле менеджера.
//                                 - Ложь   - текст ограничения в этом переопределяемом
//                модуле в процедуре ПриЗаполненииОграниченияДоступа.
//
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	// ЭлектронноеВзаимодействие
	ЭлектронноеВзаимодействие.ПриЗаполненииСписковСОграничениемДоступа(Списки);
	// Конец ЭлектронноеВзаимодействие
	
	// БПКР
	// Справочники
	Списки.Вставить(Метаданные.Справочники.Организации, Истина);
	Списки.Вставить(Метаданные.Справочники.БанковскиеСчета, Ложь);
	Списки.Вставить(Метаданные.Справочники.ДоговорыКонтрагентов, Ложь);
	Списки.Вставить(Метаданные.Справочники.Кассы, Ложь);
	Списки.Вставить(Метаданные.Справочники.ПодразделенияОрганизаций, Ложь);
	
	// Документы
	Списки.Вставить(Метаданные.Документы.АвансовыйОтчет, Ложь);
	Списки.Вставить(Метаданные.Документы.АктСверкиВзаиморасчетов, Ложь);
	Списки.Вставить(Метаданные.Документы.БольничныйЛист, Ложь);
	Списки.Вставить(Метаданные.Документы.ВводНачальныхОстатков, Ложь);
	Списки.Вставить(Метаданные.Документы.ВедомостьЗаработнойПлаты, Ложь);
	Списки.Вставить(Метаданные.Документы.ВозвратТоваровОтПокупателя, Ложь);
	Списки.Вставить(Метаданные.Документы.ВозвратТоваровПоставщику, Ложь);
	Списки.Вставить(Метаданные.Документы.ВыработкаОС, Ложь);
	Списки.Вставить(Метаданные.Документы.ГТДПоИмпорту, Ложь);
	Списки.Вставить(Метаданные.Документы.ДвижениеМБП, Ложь);
	Списки.Вставить(Метаданные.Документы.Доверенность, Ложь);
	Списки.Вставить(Метаданные.Документы.ДополнительныеРасходы, Ложь);
	Списки.Вставить(Метаданные.Документы.ЕдинаяНалоговаяДекларация, Ложь);
	Списки.Вставить(Метаданные.Документы.ЗаказНаПроизводство, Ложь);
	Списки.Вставить(Метаданные.Документы.ЗакрытиеЗаказовНаПроизводство, Ложь);
	Списки.Вставить(Метаданные.Документы.ЗакрытиеМесяца, Ложь);
	Списки.Вставить(Метаданные.Документы.ЗакрытиеМесяцаЗП, Ложь);
	Списки.Вставить(Метаданные.Документы.ЗаявлениеОВвозеТоваров, Ложь);
	Списки.Вставить(Метаданные.Документы.ЗемельныйНалог, Ложь);
	Списки.Вставить(Метаданные.Документы.ИнвентаризацияНезавершенногоПроизводства, Ложь);
	Списки.Вставить(Метаданные.Документы.ИнвентаризацияОС, Ложь);
	Списки.Вставить(Метаданные.Документы.ИнвентаризацияТоваров, Ложь);
	Списки.Вставить(Метаданные.Документы.ИсполнительныйЛист, Ложь);
	Списки.Вставить(Метаданные.Документы.КадровоеПеремещение, Ложь);
	Списки.Вставить(Метаданные.Документы.КассоваяСмена, Ложь);
	Списки.Вставить(Метаданные.Документы.Командировка, Ложь);
	Списки.Вставить(Метаданные.Документы.КомплектацияОС, Ложь);
	Списки.Вставить(Метаданные.Документы.Конвертация, Ложь);
	Списки.Вставить(Метаданные.Документы.КорректировкаДолга, Ложь);
	Списки.Вставить(Метаданные.Документы.КорректировкаНУ, Ложь);
	Списки.Вставить(Метаданные.Документы.МодернизацияОС, Ложь);
	Списки.Вставить(Метаданные.Документы.НалогНаМусор, Ложь);
	Списки.Вставить(Метаданные.Документы.НачислениеЗарплаты, Ложь);
	Списки.Вставить(Метаданные.Документы.Неявка, Ложь);
	Списки.Вставить(Метаданные.Документы.ОперацияБух, Ложь);
	Списки.Вставить(Метаданные.Документы.ОприходованиеТоваров, Ложь);
	Списки.Вставить(Метаданные.Документы.Отпуск, Ложь);
	Списки.Вставить(Метаданные.Документы.Отработка, Ложь);
	Списки.Вставить(Метаданные.Документы.ОтчетВзаимнойОТорговлеЕАЭС, Ложь);
	Списки.Вставить(Метаданные.Документы.ОтчетПоБланкамСчетовФактур, Ложь);
	Списки.Вставить(Метаданные.Документы.ОтчетПоЕдиномуНалогу, Ложь);
	Списки.Вставить(Метаданные.Документы.ОтчетПоКосвеннымНалогам, Ложь);
	Списки.Вставить(Метаданные.Документы.ОтчетПоНалогуНаИмущество, Ложь);
	Списки.Вставить(Метаданные.Документы.ОтчетПоНДС, Ложь);
	Списки.Вставить(Метаданные.Документы.ОтчетПоНСП, Ложь);
	Списки.Вставить(Метаданные.Документы.ОтчетПоПроизводству, Ложь);
	Списки.Вставить(Метаданные.Документы.ОтчетПроизводстваЗаСмену, Ложь);
	Списки.Вставить(Метаданные.Документы.ОтчетыПоСоциальномуФонду, Ложь);
	Списки.Вставить(Метаданные.Документы.ОтчетыПоПодоходномуНалогу, Ложь);
	Списки.Вставить(Метаданные.Документы.ОтчетПоВыплатамИУдержаниямПН, Ложь);
	Списки.Вставить(Метаданные.Документы.ПеремещениеОС, Ложь);
	Списки.Вставить(Метаданные.Документы.ПеремещениеТоваров, Ложь);
	Списки.Вставить(Метаданные.Документы.ПлановоеУдержание, Ложь);
	Списки.Вставить(Метаданные.Документы.ПлатежноеПоручениеВходящее, Ложь);
	Списки.Вставить(Метаданные.Документы.ПлатежноеПоручениеИсходящее, Ложь);
	Списки.Вставить(Метаданные.Документы.ПлатежныйОрдерСписаниеДС, Ложь);
	Списки.Вставить(Метаданные.Документы.ПоступлениеБланковСчетовФактур, Ложь);
	Списки.Вставить(Метаданные.Документы.ПоступлениеТоваровУслуг, Ложь);
	Списки.Вставить(Метаданные.Документы.ПриемНаРаботу, Ложь);
	Списки.Вставить(Метаданные.Документы.ПринятиеКУчетуОС, Ложь);
	Списки.Вставить(Метаданные.Документы.ПриходныйКассовыйОрдер, Ложь);
	Списки.Вставить(Метаданные.Документы.Профвзносы, Ложь);
	Списки.Вставить(Метаданные.Документы.РаботаВВыходныеИПраздничныеДни, Ложь);
	Списки.Вставить(Метаданные.Документы.РаботаСверхурочно, Ложь);
	Списки.Вставить(Метаданные.Документы.РазовоеУдержание, Ложь);
	Списки.Вставить(Метаданные.Документы.РасходныйКассовыйОрдер, Ложь);
	Списки.Вставить(Метаданные.Документы.РеализацияТоваровУслуг, Ложь);
	Списки.Вставить(Метаданные.Документы.РегламентированныйОтчет, Ложь);
	Списки.Вставить(Метаданные.Документы.СписаниеОС, Ложь);
	Списки.Вставить(Метаданные.Документы.СписаниеТоваров, Ложь);
	Списки.Вставить(Метаданные.Документы.СправкиДляПН, Ложь);
	Списки.Вставить(Метаданные.Документы.СчетНаОплатуПокупателю, Ложь);
	Списки.Вставить(Метаданные.Документы.СчетНаОплатуПоставщика, Ложь);
	Списки.Вставить(Метаданные.Документы.СчетФактураВыписанный, Ложь);
	Списки.Вставить(Метаданные.Документы.СчетФактураПолученный, Ложь);
	Списки.Вставить(Метаданные.Документы.ТекущийРасчетНалогаНаПрибыль, Ложь);
	Списки.Вставить(Метаданные.Документы.ТребованиеНакладная, Ложь);
	Списки.Вставить(Метаданные.Документы.ТрудовоеСоглашение, Ложь);
	Списки.Вставить(Метаданные.Документы.УведомлениеОПолученииТоваров, Ложь);
	Списки.Вставить(Метаданные.Документы.Увольнение, Ложь);
	Списки.Вставить(Метаданные.Документы.УдержаниеПоГрафику, Ложь);
	Списки.Вставить(Метаданные.Документы.УстановкаТарифовКомандировочных, Ложь);
	Списки.Вставить(Метаданные.Документы.УстановкаЦенНоменклатуры, Ложь);
		
	// Журналы документов
	Списки.Вставить(Метаданные.ЖурналыДокументов.ДокументыПоБанку, Ложь);
	Списки.Вставить(Метаданные.ЖурналыДокументов.ДокументыПоКассе, Ложь);
	
	// Регистры
	Списки.Вставить(Метаданные.РегистрыБухгалтерии.Хозрасчетный, Ложь);
	Списки.Вставить(Метаданные.РегистрыРасчета.Начисления, Ложь);
	Списки.Вставить(Метаданные.РегистрыРасчета.Удержания, Ложь);
	// Конец БПКР
	
КонецПроцедуры

// Заполняет описания поставляемых профилей групп доступа и
// переопределяет параметры обновления профилей и групп доступа.
//
// Для автоматической подготовки содержимого процедуры следует воспользоваться инструментами
// разработчика для подсистемы Управление доступом.
//
// Параметры:
//  ОписанияПрофилей    - Массив - добавить описания профилей групп доступа (Структура).
//                        Состав свойств структуры см. УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа.
//
//  ПараметрыОбновления - Структура - содержит свойства:
//   * ОбновлятьИзмененныеПрофили - Булево - начальное значение Истина.
//   * ЗапретитьИзменениеПрофилей - Булево - начальное значение Истина.
//       Если установить Ложь, тогда поставляемые профили можно не только просматривать, но и редактировать.
//   * ОбновлятьГруппыДоступа     - Булево - начальное значение Истина.
//   * ОбновлятьГруппыДоступаСУстаревшимиНастройками - Булево - начальное значение Ложь.
//       Если установить Истина, то настройки значений, выполненные администратором для
//       вида доступа, который был удален из профиля, будут также удалены из групп доступа.
//
// Пример:
//  ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
//  ОписаниеПрофиля.Имя           = "Менеджер";
//  ОписаниеПрофиля.Идентификатор = "75fa0ecb-98aa-11df-b54f-e0cb4ed5f655";
//  ОписаниеПрофиля.Наименование  = НСтр("ru = 'Менеджер по продажам'", Метаданные.ОсновнойЯзык.КодЯзыка);
//  ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
//  ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
//  ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
//  ОписаниеПрофиля.Роли.Добавить("Подсистема_Продажи");
//  ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовПокупателей");
//  ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаКнигаПокупок");
//  ОписанияПрофилей.Добавить(ОписаниеПрофиля);
//
Процедура ПриЗаполненииПоставляемыхПрофилейГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт
	
	// БПКР
#Область ПрофильПолныеПрава

	// Профиль "Полные права".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ПолныеПрава";
	ОписаниеПрофиля.Идентификатор = "acdd796b-c711-4fde-8e0f-0c5adabb175a";	
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Полные права'");
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под профилем осуществляется работа со всеми разделами.'", Метаданные.ОсновнойЯзык.КодЯзыка);
			
	ДобавитьРолиБСПВОписаниеПрофиля(ОписаниеПрофиля);
	ОписаниеПрофиля.Роли.Добавить("ПолныеПрава");
	ОписаниеПрофиля.Роли.Добавить("АдминистраторСистемы");
	ОписаниеПрофиля.Роли.Добавить("Администрирование");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти
	
#Область ПрофильГлавныйБухгалтер

	// Профиль "Главный бухгалтер".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ГлавныйБухгалтер";
	ОписаниеПрофиля.Идентификатор = "e685af2c-9bda-4e3a-be9e-1ecf5a74f63f";	
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Главный бухгалтер'");
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под профилем осуществляется работа со всеми разделами,
		           					|за исключением ""Администрирования"".'", Метаданные.ОсновнойЯзык.КодЯзыка);
			
	ДобавитьРолиБСПВОписаниеПрофиля(ОписаниеПрофиля);
	ОписаниеПрофиля.Роли.Добавить("ГлавныйБухгалтер");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбменСБанками");
	
	// Виды ограничения доступа профиля.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "Предустановленный");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти
	
#Область ПрофильДенежныеСредства

	// Профиль "Касса-банк".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ДенежныеСредства";									 
	ОписаниеПрофиля.Идентификатор = "2204d18c-c8b2-11e5-833c-5404a6a1f5c8";	
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Касса-банк'");
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под профилем осуществляется работа с разделом ""Банк и касса"".'", Метаданные.ОсновнойЯзык.КодЯзыка);
	
	ДобавитьРолиБСПВОписаниеПрофиля(ОписаниеПрофиля);
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПодсистемыДенежныеСредства");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбменСБанками");
	
	// Виды ограничения доступа профиля.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "Предустановленный");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти

#Область ПрофильЗарплатаИКадры
	
	// Профиль "Зарплата и кадры".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ЗарплатаИКадры";									 
	ОписаниеПрофиля.Идентификатор = "750d3759-be1e-4c10-ad51-25b5e72f6cfe";	
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Зарплата и кадры'");
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под профилем осуществляется работа с разделом ""Зарплата и кадры"".'", Метаданные.ОсновнойЯзык.КодЯзыка);
	
	ДобавитьРолиБСПВОписаниеПрофиля(ОписаниеПрофиля);
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПодсистемыЗарплата");
	
	// Виды ограничения доступа профиля.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "Предустановленный");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти

#Область ПрофильОсновнаяДеятельность

	// Профиль "Основная деятельность".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ОсновнаяДеятельность";									 
	ОписаниеПрофиля.Идентификатор = "e36bdff5-bf1d-4b75-9056-7293ed8eed92";	
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Основная деятельность'");
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под профилем осуществляется работа с разделами:
									|""Запасы"", ""Покупка и продажа"", ""ОС и НМА"", ""Производство"".'", Метаданные.ОсновнойЯзык.КодЯзыка);
	
	ДобавитьРолиБСПВОписаниеПрофиля(ОписаниеПрофиля);
	ОписаниеПрофиля.Роли.Добавить("ОсновнаяДеятельность");
	
	// Виды ограничения доступа профиля.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "Предустановленный");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти

#Область ПрофильСистемныйАдминистратор

	// Профиль "Системный администратор".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "СистемныйАдминистратор";
	ОписаниеПрофиля.Идентификатор = "4ab5c779-d9c3-435f-988b-5492d2d951d5";	
	ОписаниеПрофиля.Наименование = НСтр("ru = 'Системный администратор'");
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под профилем осуществляется работа с конфигурированием базы данных.'", Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Роли.Добавить("Администрирование");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти
	
#Область ПрофильТолькоПросмотр

	// Профиль "Только просмотр".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ТолькоПросмотр";
	ОписаниеПрофиля.Идентификатор = "47d889a4-3201-4841-942c-91f8304396fa";	
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Только просмотр'");
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под профилем осуществляется просмотр всех разделов.'", Метаданные.ОсновнойЯзык.КодЯзыка);
			
	ДобавитьРолиБСПВОписаниеПрофиля(ОписаниеПрофиля);
	ОписаниеПрофиля.Роли.Добавить("ТолькоПросмотр");
	
	// Виды ограничения доступа профиля.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "Предустановленный");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
#КонецОбласти	

	// Конец БПКР

КонецПроцедуры

// Заполняет зависимости прав доступа "подчиненного" объекта (например, задачи ЗадачаИсполнителя),
// от "ведущего" объекта (например,  бизнес-процесса Задание), которые отличаются от стандартных.
//
// Зависимости прав используются в стандартном шаблоне ограничения доступа для вида доступа "Объект".
// 1. Стандартно при чтении "подчиненного" объекта
//    проверяется наличие права чтения "ведущего" объекта и
//    проверяется отсутствие ограничения чтения "ведущего" объекта.
// 2. Стандартно при добавлении, изменении, удалении "подчиненного" объекта
//    проверяется наличие права изменения "ведущего" объекта и
//    проверяется отсутствие ограничения изменения "ведущего" объекта.
//
// Допускается только одно переназначение по сравнению со стандартным -
// в пункте 2 вместо проверки права изменения "ведущего" объекта установить
// проверку права чтения "ведущего" объекта.
//
// Параметры:
//  ЗависимостиПрав - ТаблицаЗначений - с колонками:
//   * ВедущаяТаблица     - Строка - например Метаданные.БизнесПроцессы.Задание.ПолноеИмя().
//   * ПодчиненнаяТаблица - Строка - например Метаданные.Задачи.ЗадачаИсполнителя.ПолноеИмя().
//
Процедура ПриЗаполненииЗависимостейПравДоступа(ЗависимостиПрав) Экспорт
	
	
	
КонецПроцедуры

// Заполняет описания возможных прав, назначаемых для объектов указанных типов.
// 
// Параметры:
//  ВозможныеПрава - ТаблицаЗначений - с колонками:
//   ВладелецПрав - Строка - полное имя таблицы значения доступа.
//
//   Имя          - Строка - идентификатор права, например ИзменениеПапок. Право с именем УправлениеПравами
//                  должно быть обязательно определено для общей формы настройки прав "Права доступа".
//                  УправлениеПравами - это право на изменение прав по владельцу прав, которое проверяется
//                  при открытии ОбщаяФорма.НастройкиПравОбъектов.
//
//   Заголовок    - Строка - заголовок права, например в форме НастройкиПравОбъектов:
//                  "Изменение.
//                  |папок".
//
//   Подсказка    - Строка - подсказка к заголовку права,
//                  например "Добавление, изменение и пометка удаления папок".
//
//   НачальноеЗначение - Булево - начальное значение флажка права при добавлении новой строки
//                  в форме "Права доступа".
//
//   ТребуемыеПрава - Массив строк - имена прав, требуемых для этого права -
//                  например, право "ДобавлениеФайлов" требует права "ИзменениеФайлов".
//
//   ЧтениеВТаблицах - Массив строк - полные имена таблиц, для которых это право обозначает право Чтение.
//                  Возможно использование символа "*", который обозначает "для всех остальных таблиц",
//                  т.к. право Чтение может зависеть только от права Чтение, то имеет смысл только символ "*"
//                  (требуется для работы шаблонов ограничения доступа).
//
//   ИзменениеВТаблицах - Массив строк - полные имена таблиц, для которых это право обозначает право Изменение.
//                  Возможно использование символа "*", который обозначает "для всех остальных таблиц"
//                  (требуется для работы шаблонов ограничения доступа).
//
Процедура ПриЗаполненииВозможныхПравДляНастройкиПравОбъектов(ВозможныеПрава) Экспорт
	
КонецПроцедуры

// Определяет вид используемого интерфейса пользователя для настройки доступа.
//
// Параметры:
//  УпрощенныйИнтерфейс - Булево - начальное значение Ложь.
//
Процедура ПриОпределенииИнтерфейсаНастройкиДоступа(УпрощенныйИнтерфейс) Экспорт
	// БПКР
	УпрощенныйИнтерфейс = Истина;
	// Конец БПКР
КонецПроцедуры

// Заполняет использование видов доступа в зависимости от функциональных опций конфигурации,
// например, ИспользоватьГруппыДоступаНоменклатуры.
//
// Параметры:
//  ВидДоступа    - Строка - имя вида доступа, заданное в процедуре ПриЗаполненииВидовДоступа.
//  Использование - Булево - начальное значение Истина.
// 
Процедура ПриЗаполненииИспользованияВидаДоступа(ВидДоступа, Использование) Экспорт
	
	
	
КонецПроцедуры

// Позволяет переопределить ограничение, указанное в модуле менеджера объекта метаданных.
//
// Параметры:
//  Список - ОбъектМетаданных - список, для которого нужно вернуть текст ограничения.
//                              В процедуре ПриЗаполненииСписковСОграничениемДоступа нужно
//                              указать для списка значение Ложь, иначе вызова не будет.
//
//  Ограничение - Структура - со свойствами, как для процедур в модулях менеджеров. См. свойства
//                            в комментарии к процедуре ПриЗаполненииСписковСОграничениемДоступа.
//
Процедура ПриЗаполненииОграниченияДоступа(Список, Ограничение) Экспорт
	
	// БПКР
	Если Список = Метаданные.ЖурналыДокументов.ДокументыПоБанку
		Или Список = Метаданные.ЖурналыДокументов.ДокументыПоКассе Тогда
		
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЧтениеОбъектаРазрешено(Ссылка)";
		
	ИначеЕсли Список = Метаданные.Справочники.БанковскиеСчета
		Или Список = Метаданные.Справочники.Кассы
		Или Список = Метаданные.Справочники.ПодразделенияОрганизаций Тогда
		
		Ограничение.Текст =
		"РазрешитьЧтение
		|ГДЕ
		|	ЗначениеРазрешено(ВЫРАЗИТЬ(Владелец КАК Справочник.Организации))
		|	И ЧтениеСпискаРазрешено(ВЫРАЗИТЬ(Владелец КАК Справочник.Организации))
		|;
		|РазрешитьИзменениеЕслиРазрешеноЧтение
		|ГДЕ
		|	ЗначениеРазрешено(ВЫРАЗИТЬ(Владелец КАК Справочник.Организации))
		|	И ИзменениеСпискаРазрешено(ВЫРАЗИТЬ(Владелец КАК Справочник.Организации))";
		
	Иначе 	
		
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Организация)";
	КонецЕсли;	
	// Конец БПКР
	
КонецПроцедуры

// Заполняет состав видов доступа, используемых при ограничении прав объектов метаданных.
// Если состав видов доступа не заполнен, отчет "Права доступа" покажет некорректные сведения.
//
// Обязательно требуется заполнить только виды доступа, используемые в шаблонах ограничения доступа
// явно, а виды доступа, используемые в наборах значений доступа, могут быть получены из текущего
// состояния регистра сведений НаборыЗначенийДоступа.
//
//  Для автоматической подготовки содержимого процедуры следует воспользоваться инструментами
// разработчика для подсистемы Управление доступом.
//
// Параметры:
//  Описание     - Строка - многострочная строка формата <Таблица>.<Право>.<ВидДоступа>[.Таблица объекта],
//                 например, "Документ.ПриходнаяНакладная.Чтение.Организации",
//                           "Документ.ПриходнаяНакладная.Чтение.Контрагенты",
//                           "Документ.ПриходнаяНакладная.Изменение.Организации",
//                           "Документ.ПриходнаяНакладная.Изменение.Контрагенты",
//                           "Документ.ЭлектронныеПисьма.Чтение.Объект.Документ.ЭлектронныеПисьма",
//                           "Документ.ЭлектронныеПисьма.Изменение.Объект.Документ.ЭлектронныеПисьма",
//                           "Документ.Файлы.Чтение.Объект.Справочник.ПапкиФайлов",
//                           "Документ.Файлы.Чтение.Объект.Документ.ЭлектронноеПисьмо",
//                           "Документ.Файлы.Изменение.Объект.Справочник.ПапкиФайлов",
//                           "Документ.Файлы.Изменение.Объект.Документ.ЭлектронноеПисьмо".
//                 Вид доступа Объект предопределен как литерал. Этот вид доступа используется в
//                 шаблонах ограничений доступа как "ссылка" на другой объект, по которому
//                 ограничивается текущий объект таблицы.
//                 Когда вид доступа "Объект" задан, также требуется задать типы таблиц,
//                 которые используются для этого вида доступа. Т.е. перечислить типы,
//                 которые соответствуют полю, использованному в шаблоне ограничения доступа
//                 в паре с видом доступа "Объект". При перечислении типов по виду доступа "Объект"
//                 нужно перечислить только те типы поля, которые есть
//                 у поля РегистрыСведений.НаборыЗначенийДоступа.Объект, остальные типы лишние.
// 
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт
	
	// БПКР
	// Организации
	Описание = Описание + "
	|Справочник.Организации.Чтение.Организации
	|";
	
	// Справочники
	Описание = Описание + "
	|Справочник.БанковскиеСчета.Чтение.Организации
	|Справочник.ДоговорыКонтрагентов.Чтение.Организации
	|Справочник.Кассы.Чтение.Организации
	|Справочник.ПодразделенияОрганизаций.Чтение.Организации
	|Справочник.ПодразделенияОрганизаций.Чтение.Организации
	|Справочник.ПодразделенияОрганизаций.Чтение.Организации
	|";
	
	// РаботаСФайлами
	Описание = Описание + "
	|Справочник.Файлы.Изменение.ВнешниеПользователи
	|Справочник.Файлы.Чтение.ВнешниеПользователи
	|";

	// Документы
	Описание = Описание + "
	|Документ.АвансовыйОтчет.Изменение.Организации
	|Документ.АвансовыйОтчет.Чтение.Организации
	|Документ.АктСверкиВзаиморасчетов.Изменение.Организации
	|Документ.АктСверкиВзаиморасчетов.Чтение.Организации
	|Документ.БольничныйЛист.Изменение.Организации
	|Документ.БольничныйЛист.Чтение.Организации
	|Документ.ВводНачальныхОстатков.Изменение.Организации
	|Документ.ВводНачальныхОстатков.Чтение.Организации
	|Документ.ВедомостьЗаработнойПлаты.Изменение.Организации
	|Документ.ВедомостьЗаработнойПлаты.Чтение.Организации
	|Документ.ВозвратТоваровОтПокупателя.Изменение.Организации
	|Документ.ВозвратТоваровОтПокупателя.Чтение.Организации
	|Документ.ВозвратТоваровПоставщику.Изменение.Организации
	|Документ.ВозвратТоваровПоставщику.Чтение.Организации
	|Документ.ВыработкаОС.Изменение.Организации
	|Документ.ВыработкаОС.Чтение.Организации
	|Документ.ГТДПоИмпорту.Изменение.Организации
	|Документ.ГТДПоИмпорту.Чтение.Организации
	|Документ.ДвижениеМБП.Изменение.Организации
	|Документ.ДвижениеМБП.Чтение.Организации
	|Документ.Доверенность.Изменение.Организации
	|Документ.Доверенность.Чтение.Организации
	|Документ.ДополнительныеРасходы.Изменение.Организации
	|Документ.ДополнительныеРасходы.Чтение.Организации
	|Документ.ЕдинаяНалоговаяДекларация.Изменение.Организации
	|Документ.ЕдинаяНалоговаяДекларация.Чтение.Организации
	|Документ.ЗаказНаПроизводство.Изменение.Организации
	|Документ.ЗаказНаПроизводство.Чтение.Организации
	|Документ.ЗакрытиеЗаказовНаПроизводство.Изменение.Организации
	|Документ.ЗакрытиеЗаказовНаПроизводство.Чтение.Организации
	|Документ.ЗакрытиеМесяца.Изменение.Организации
	|Документ.ЗакрытиеМесяца.Чтение.Организации
	|Документ.ЗакрытиеМесяцаЗП.Изменение.Организации
	|Документ.ЗакрытиеМесяцаЗП.Чтение.Организации
	|Документ.ЗаявлениеОВвозеТоваров.Изменение.Организации
	|Документ.ЗаявлениеОВвозеТоваров.Чтение.Организации
	|Документ.ЗемельныйНалог.Изменение.Организации
	|Документ.ЗемельныйНалог.Чтение.Организации
	|Документ.ИнвентаризацияНезавершенногоПроизводства.Изменение.Организации
	|Документ.ИнвентаризацияНезавершенногоПроизводства.Чтение.Организации
	|Документ.ИнвентаризацияОС.Изменение.Организации
	|Документ.ИнвентаризацияОС.Чтение.Организации
	|Документ.ИнвентаризацияТоваров.Изменение.Организации
	|Документ.ИнвентаризацияТоваров.Чтение.Организации
	|Документ.ИсполнительныйЛист.Изменение.Организации
	|Документ.ИсполнительныйЛист.Чтение.Организации
	|Документ.КадровоеПеремещение.Изменение.Организации
	|Документ.КадровоеПеремещение.Чтение.Организации
	|Документ.КассоваяСмена.Изменение.Организации
	|Документ.КассоваяСмена.Чтение.Организации
	|Документ.Командировка.Изменение.Организации
	|Документ.Командировка.Чтение.Организации
	|Документ.КомплектацияОС.Изменение.Организации
	|Документ.КомплектацияОС.Чтение.Организации
	|Документ.Конвертация.Изменение.Организации
	|Документ.Конвертация.Чтение.Организации
	|Документ.КорректировкаДолга.Изменение.Организации
	|Документ.КорректировкаДолга.Чтение.Организации
	|Документ.КорректировкаНУ.Изменение.Организации
	|Документ.КорректировкаНУ.Чтение.Организации
	|Документ.МодернизацияОС.Изменение.Организации
	|Документ.МодернизацияОС.Чтение.Организации
	|Документ.НалогНаМусор.Изменение.Организации
	|Документ.НалогНаМусор.Чтение.Организации
	|Документ.НачислениеЗарплаты.Изменение.Организации
	|Документ.НачислениеЗарплаты.Чтение.Организации
	|Документ.Неявка.Изменение.Организации
	|Документ.Неявка.Чтение.Организации
	|Документ.ОперацияБух.Изменение.Организации
	|Документ.ОперацияБух.Чтение.Организации
	|Документ.ОприходованиеТоваров.Изменение.Организации
	|Документ.ОприходованиеТоваров.Чтение.Организации
	|Документ.Отпуск.Изменение.Организации
	|Документ.Отпуск.Чтение.Организации
	|Документ.Отработка.Изменение.Организации
	|Документ.Отработка.Чтение.Организации
	|Документ.ОтчетВзаимнойОТорговлеЕАЭС.Изменение.Организации
	|Документ.ОтчетВзаимнойОТорговлеЕАЭС.Чтение.Организации
	|Документ.ОтчетПоБланкамСчетовФактур.Изменение.Организации
	|Документ.ОтчетПоБланкамСчетовФактур.Чтение.Организации
	|Документ.ОтчетПоЕдиномуНалогу.Изменение.Организации
	|Документ.ОтчетПоЕдиномуНалогу.Чтение.Организации
	|Документ.ОтчетПоКосвеннымНалогам.Изменение.Организации
	|Документ.ОтчетПоКосвеннымНалогам.Чтение.Организации
	|Документ.ОтчетПоНалогуНаИмущество.Изменение.Организации
	|Документ.ОтчетПоНалогуНаИмущество.Чтение.Организации
	|Документ.ОтчетПоНДС.Изменение.Организации
	|Документ.ОтчетПоНДС.Чтение.Организации
	|Документ.ОтчетПоНСП.Изменение.Организации
	|Документ.ОтчетПоНСП.Чтение.Организации
	|Документ.ОтчетПоПроизводству.Изменение.Организации
	|Документ.ОтчетПоПроизводству.Чтение.Организации
	|Документ.ОтчетПроизводстваЗаСмену.Изменение.Организации
	|Документ.ОтчетПроизводстваЗаСмену.Чтение.Организации
	|Документ.ОтчетыПоСоциальномуФонду.Изменение.Организации
	|Документ.ОтчетыПоСоциальномуФонду.Чтение.Организации
	|Документ.ОтчетыПоПодоходномуНалогу.Изменение.Организации
	|Документ.ОтчетыПоПодоходномуНалогу.Чтение.Организации
	|Документ.ОтчетПоВыплатамИУдержаниямПН.Изменение.Организации
	|Документ.ОтчетПоВыплатамИУдержаниямПН.Чтение.Организации
	|Документ.ПеремещениеОС.Изменение.Организации
	|Документ.ПеремещениеОС.Чтение.Организации
	|Документ.ПеремещениеТоваров.Изменение.Организации
	|Документ.ПеремещениеТоваров.Чтение.Организации
	|Документ.ПлановоеУдержание.Изменение.Организации
	|Документ.ПлановоеУдержание.Чтение.Организации
	|Документ.ПлатежноеПоручениеВходящее.Изменение.Организации
	|Документ.ПлатежноеПоручениеВходящее.Чтение.Организации
	|Документ.ПлатежноеПоручениеИсходящее.Изменение.Организации
	|Документ.ПлатежноеПоручениеИсходящее.Чтение.Организации
	|Документ.ПлатежныйОрдерСписаниеДС.Изменение.Организации
	|Документ.ПлатежныйОрдерСписаниеДС.Чтение.Организации
	|Документ.ПоступлениеБланковСчетовФактур.Изменение.Организации
	|Документ.ПоступлениеБланковСчетовФактур.Чтение.Организации
	|Документ.ПоступлениеТоваровУслуг.Чтение.Организации
	|Документ.ПоступлениеТоваровУслуг.Изменение.Организации
	|Документ.ПриемНаРаботу.Изменение.Организации
	|Документ.ПриемНаРаботу.Чтение.Организации
	|Документ.ПринятиеКУчетуОС.Изменение.Организации
	|Документ.ПринятиеКУчетуОС.Чтение.Организации
	|Документ.ПриходныйКассовыйОрдер.Изменение.Организации
	|Документ.ПриходныйКассовыйОрдер.Чтение.Организации
	|Документ.Профвзносы.Изменение.Организации
	|Документ.Профвзносы.Чтение.Организации
	|Документ.РаботаВВыходныеИПраздничныеДни.Изменение.Организации
	|Документ.РаботаВВыходныеИПраздничныеДни.Чтение.Организации
	|Документ.РаботаСверхурочно.Изменение.Организации
	|Документ.РаботаСверхурочно.Чтение.Организации
	|Документ.РазовоеУдержание.Изменение.Организации
	|Документ.РазовоеУдержание.Чтение.Организации
	|Документ.РасходныйКассовыйОрдер.Изменение.Организации
	|Документ.РасходныйКассовыйОрдер.Чтение.Организации
	|Документ.РеализацияТоваровУслуг.Изменение.Организации
	|Документ.РеализацияТоваровУслуг.Чтение.Организации
	|Документ.РегламентированныйОтчет.Изменение.Организации
	|Документ.РегламентированныйОтчет.Чтение.Организации
	|Документ.СписаниеОС.Изменение.Организации
	|Документ.СписаниеОС.Чтение.Организации
	|Документ.СписаниеТоваров.Изменение.Организации
	|Документ.СписаниеТоваров.Чтение.Организации
	|Документ.СправкиДляПН.Изменение.Организации
	|Документ.СправкиДляПН.Чтение.Организации
	|Документ.СчетНаОплатуПокупателю.Изменение.Организации
	|Документ.СчетНаОплатуПокупателю.Чтение.Организации
	|Документ.СчетНаОплатуПоставщика.Изменение.Организации
	|Документ.СчетНаОплатуПоставщика.Чтение.Организации
	|Документ.СчетФактураПолученный.Изменение.Организации
	|Документ.СчетФактураПолученный.Чтение.Организации
	|Документ.СчетФактураВыписанный.Изменение.Организации
	|Документ.СчетФактураВыписанный.Чтение.Организации
	|Документ.ТекущийРасчетНалогаНаПрибыль.Изменение.Организации
	|Документ.ТекущийРасчетНалогаНаПрибыль.Чтение.Организации
	|Документ.ТребованиеНакладная.Изменение.Организации
	|Документ.ТребованиеНакладная.Чтение.Организации
	|Документ.ТрудовоеСоглашение.Изменение.Организации
	|Документ.ТрудовоеСоглашение.Чтение.Организации
	|Документ.УведомлениеОПолученииТоваров.Изменение.Организации
	|Документ.УведомлениеОПолученииТоваров.Чтение.Организации
	|Документ.Увольнение.Изменение.Организации
	|Документ.Увольнение.Чтение.Организации
	|Документ.УдержаниеПоГрафику.Изменение.Организации
	|Документ.УдержаниеПоГрафику.Чтение.Организации
	|Документ.УстановкаТарифовКомандировочных.Изменение.Организации
	|Документ.УстановкаТарифовКомандировочных.Чтение.Организации
	|Документ.УстановкаЦенНоменклатуры.Изменение.Организации
	|Документ.УстановкаЦенНоменклатуры.Чтение.Организации
	|";
	
	// Журналы документов
	Описание = Описание + "
	|ЖурналДокументов.ДокументыПоБанку.Чтение.Организации
	|ЖурналДокументов.ДокументыПоКассе.Чтение.Организации
	|";
	
	// Регистры
	Описание = Описание + "
	|РегистрБухгалтерии.Хозрасчетный.Чтение.Организации
	|РегистрРасчета.Начисления.Чтение.Организации
	|РегистрРасчета.Удержания.Чтение.Организации
	|";

	// КонтрольВеденияУчета
	Описание = Описание + "
	|РегистрСведений.РезультатыПроверкиУчета.Чтение.Организации
	|";
	// Конец БПКР
	
	// ЭлектронноеВзаимодействие
	ЭлектронноеВзаимодействие.ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание);
	// Конец ЭлектронноеВзаимодействие
	
КонецПроцедуры

// Позволяет реализовать перезапись зависимых наборов значений доступа других объектов.
//
// Вызывается из процедур
//  УправлениеДоступомСлужебный.ЗаписатьНаборыЗначенийДоступа,
//  УправлениеДоступомСлужебный.ЗаписатьЗависимыеНаборыЗначенийДоступа.
//
// Параметры:
//  Ссылка       - СправочникСсылка, ДокументСсылка, ... - ссылка на объект, для которого
//                 записаны наборы значений доступа.
//
//  СсылкиНаЗависимыеОбъекты - Массив - массив элементов типа СправочникСсылка, ДокументСсылка и т. п.
//                 Содержит ссылки на объекты с зависимыми наборами значений доступа.
//                 Начальное значение - пустой массив.
//
Процедура ПриИзмененииНаборовЗначенийДоступа(Ссылка, СсылкиНаЗависимыеОбъекты) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииБПКР

// Процедура - Добавить роли БСПВОписание профиля
//
// Параметры:
//  ОписаниеПрофиля    - Структура - структура, в который нужно добавить описания.
//                        Пустая структура должна быть получена при помощи функции.
//                        УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа.
//
Процедура ДобавитьРолиБСПВОписаниеПрофиля(ОписаниеПрофиля)
	
	// БПКР
	// Использование 1С:Предприятия.
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	
	// Использование программы.
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИПП");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОписанияИзмененийПрограммы");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеПечатныхФорм");
	
	// Использование НСИ.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКурсовВалют");
	
	// Типовые возможности.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛичныхВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрСвязанныеДокументы");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиТекущиеДела");
	
	// Основные возможности профиля.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаметок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");
	
	// Виды ограничения доступа профиля.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи", "Предустановленный");
	
	// ОтветственныйЗаНормативноСправочнуюИнформацию
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовКонтактнойИнформации");
	
	// Руководитель
	ОписаниеПрофиля.Роли.Добавить("ИзменениеМакетовПечатныхФорм");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУчетныхЗаписейЭлектроннойПочты");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрЖурналаРегистрации");
	
	// Использование онлайн-поддержки
	ОписаниеПрофиля.Роли.Добавить("ВызовОнлайнПоддержки");
	ОписаниеПрофиля.Роли.Добавить("ПодключениеИнтернетПоддержки");
	
	// Административные возможности.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеРеквизитовОбъектов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеУниверсальногоОтчета");
	
	// Использование подсистемы контроля ведения учета.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРезультатовПроверкиУчета");

	//ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРассылокОтчетов");
	//ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРолейИсполнителей");
	//ОписаниеПрофиля.Роли.Добавить("ЧтениеВнешнихПользователей");
	//ОписаниеПрофиля.Роли.Добавить("ЧтениеВерсийОбъектов");
	//ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУчетныхЗаписейЭлектроннойПочты");
	
	// БП
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваПользователяБП");
	// Конец БПКР
	
КонецПроцедуры // ()

#КонецОбласти
