
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СчетаВыборкаНаСервере();
КонецПроцедуры

&НаСервере
Процедура СчетаВыборкаНаСервере()
	Запрос  = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Код,
	|	Хозрасчетный.Наименование,
	|	Хозрасчетный.Вид
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	НЕ Хозрасчетный.Предопределенный";
	
	Результат = Запрос.Выполнить();
	Объект.СчетаВведенныеВручную.Загрузить(Результат.Выгрузить());

КонецПроцедуры

&НаКлиенте
Процедура СчетаВведенныеВручнуюВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
	ТекДанные =  Элемент.ТекущиеДанные;
	П = ТекДанные.Код;
	ЗначОтбора = Новый Структура;
	ЗначОтбора.Вставить("Ключ",П);
	ОткрытьФорму("ПланСчетов.Хозрасчетный.ФормаОбъекта",ЗначОтбора);
КонецПроцедуры
