
#Область ОбработчикиСобытийФормы

// Процедура - обработчик события ПриСозданииНаСервере.
// В процедуре осуществляется
// - инициализация реквизитов формы,
// - установка параметров функциональных опций формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("Организация") Тогда
		Организация = Параметры.Отбор.Организация;
	Иначе
		Организация = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьЗначениеНастройки("ОсновнаяОрганизация");
	КонецЕсли;
	
	РаботаСОтборамиКлиентСервер.УстановитьЭлементОтбораСписка(Список,"Организация",Организация);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Процедура - обработчик события ПриИзменении поля ввода Организация.
//
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	РаботаСОтборамиКлиентСервер.ИзменитьЭлементОтбораСписка(Подразделения, "Владелец", Организация, ЗначениеЗаполнено(Организация));
	РаботаСОтборамиКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Организация", Организация, ЗначениеЗаполнено(Организация));
КонецПроцедуры

&НаКлиенте
// Процедура - обработка события ПриАктивизацииСтроки таблицы Подразделения
//
Процедура ПодразделенияПриАктивизацииСтроки(Элемент)
	СтрокаДинамическогоСписка = Элемент.ТекущиеДанные;
	
	Если СтрокаДинамическогоСписка <> Неопределено Тогда
		РаботаСОтборамиКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Подразделение", СтрокаДинамическогоСписка.Ссылка, Истина);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти





