
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события ПриСозданииНаСервере формы.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Отбор.Свойство("Организация") Тогда
		Организация = Параметры.Отбор.Организация;
	Иначе
		Организация = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьЗначениеНастройки("ОсновнаяОрганизация");
	КонецЕсли;
	
	РаботаСОтборамиКлиентСервер.УстановитьЭлементОтбораСписка(Список,"Организация",Организация);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура - обработка события ПриИзменении реквизита Организация
//
Процедура ОрганизацияПриИзменении(Элемент)
	РаботаСОтборамиКлиентСервер.ИзменитьЭлементОтбораСписка(Подразделения, "Организация", Организация, ЗначениеЗаполнено(Организация));
	РаботаСОтборамиКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Организация", Организация, ЗначениеЗаполнено(Организация));
КонецПроцедуры

&НаКлиенте
// Процедура - обработка события ПриАктивизацииСтроки таблицы Подразделения
//
Процедура ПодразделенияПриАктивизацииСтроки(Элемент)
	РаботаСОтборамиКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Подразделение", Элемент.ТекущиеДанные.Ссылка, Истина);
КонецПроцедуры

#КонецОбласти





