
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ЗаголовокФормы", НСтр("ru = 'План счетов (с подробными описаниями)'"));
	
	ПараметрыКомандыПечати = Новый Массив;
	ПараметрыКомандыПечати.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ПустаяСсылка"));
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("ПланСчетов.Хозрасчетный", "СПодробнымиОписаниями", ПараметрыКомандыПечати,
		ПараметрыВыполненияКоманды, ПараметрыПечати);
	
КонецПроцедуры

#КонецОбласти