//Используется в БСП/КД, дергается из макета

Функция ПолучитьРеквизитОбъектаИзБазы(Ссылка, Метаданные, Реквизит) Экспорт 
	
	ЗапросВладельца = Новый Запрос;
	ЗапросВладельца.Текст = "
	| ВЫБРАТЬ
	| Объект." + Реквизит + "
	| ИЗ
	| " + Метаданные + " КАК Объект
	| ГДЕ
	| Объект.Ссылка = &Ссылка";
	
	ЗапросВладельца.УстановитьПараметр("Ссылка",Ссылка);
	Выборка = ЗапросВладельца.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка[Реквизит];
	
КонецФункции

Процедура ВыполнитьРегистрациюСвязанныхПрисоединенныхФайлов(Документ,Получатели,ИмяСправочника) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	| ВЫБРАТЬ РАЗЛИЧНЫЕ Спр.Ссылка
	| ИЗ
	| Справочник." + ИмяСправочника + " КАК Спр
	| ГДЕ
	| Спр.ВладелецФайла = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",Документ);
	МассивИзСправочника = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

	Для Каждого Элемент Из МассивИзСправочника Цикл
		ПланыОбмена.ЗарегистрироватьИзменения(Получатели,Элемент.ПолучитьОбъект())
	КонецЦикла;
	
КонецПроцедуры
