
#Область ПрограммныйИнтерфейс

// Обработчик нажатия на гиперссылку ЭСФ в форме документа.
//
// Параметры:
//  ПредставлениеЭСФ - Строка, ДокументСсылка.ЭлектронныйСчетФактура - Представление ЭСФ, нажатие на который нужно обработать
//  ЭтаФорма		 - УправляемаяФорма - Форма, в которой нужно обработать открытие
//
Процедура ПредставлениеЭСФНажатие(ПредставлениеЭСФ, ЭтаФорма) Экспорт
	
	Если ТипЗнч(ПредставлениеЭСФ) = Тип("Строка") Тогда
		// Создать новый ЭСФ.
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Основание", ЭтаФорма.Объект.Ссылка);
		ОткрытьФорму("Документ.ЭлектронныйСчетФактура.ФормаОбъекта", СтруктураПараметров, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ИначеЕсли ТипЗнч(ПредставлениеЭСФ) = Тип("ДокументСсылка.ЭлектронныйСчетФактура") Тогда 
		ПоказатьЗначение(, ПредставлениеЭСФ);
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

