////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ ПО СОТРУДНИКУ

// Нужно использовать функцию ПроведениеРасчетовПоЗарплатеСервер.СведенияОСотруднике 
//Функция - получает Сведения о сотруднике
//
// Возвращаемое значение:
//  СведенияОСотруднике - Структура
Функция СведенияОСотруднике(Период, Организация, ФизЛицо) Экспорт 
	СведенияОСотруднике = РегистрыСведений.Сотрудники.ПолучитьПоследнее(Период, Новый Структура("Организация, ФизЛицо", Организация, ФизЛицо));
	СведенияОСотруднике.Вставить("РазмерОсновногоВидаРасчета", 0);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПлановыеНачисленияНачалоСрезПоследних.ФизЛицо КАК ФизЛицо,
		|	ПлановыеНачисленияНачалоСрезПоследних.Размер КАК РазмерОсновногоВидаРасчета
		|ИЗ
		|	РегистрСведений.ПлановыеНачисленияНачало.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И ФизЛицо = &ФизЛицо) КАК ПлановыеНачисленияНачалоСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияОкончание.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И ФизЛицо = &ФизЛицо) КАК ПлановыеНачисленияОкончаниеСрезПоследних
		|		ПО ПлановыеНачисленияНачалоСрезПоследних.Организация = ПлановыеНачисленияОкончаниеСрезПоследних.Организация
		|			И ПлановыеНачисленияНачалоСрезПоследних.ФизЛицо = ПлановыеНачисленияОкончаниеСрезПоследних.ФизЛицо
		|			И ПлановыеНачисленияНачалоСрезПоследних.ВидРасчета = ПлановыеНачисленияОкончаниеСрезПоследних.ВидРасчета
		|			И ПлановыеНачисленияНачалоСрезПоследних.Регистратор = ПлановыеНачисленияОкончаниеСрезПоследних.ДокументСсылка
		|ГДЕ
		|	ПлановыеНачисленияНачалоСрезПоследних.Основной
		|	И ПлановыеНачисленияОкончаниеСрезПоследних.Организация ЕСТЬ NULL";
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		СведенияОСотруднике.РазмерОсновногоВидаРасчета = Выборка.РазмерОсновногоВидаРасчета;	
	КонецЕсли;	

	Возврат СведенияОСотруднике;
КонецФункции // СведенияОСотруднике()

// Нужно использовать функцию ПроведениеРасчетовПоЗарплатеСервер.СтатусСотрудникаКакНалогоплательщика 
//Функция - получает статус сотрудника
//
// Возвращаемое значение:
//  Структура
Функция СтатусСотрудникаКакНалогоплательщика(Период, Организация, ФизЛицо) Экспорт 
	Возврат РегистрыСведений.СтатусыСотрудников.ПолучитьПоследнее(Период, Новый Структура("Организация, ФизЛицо", Организация, ФизЛицо));
КонецФункции // СтатусСотрудникаКакНалогоплательщика()

// Нужно использовать функцию ПроведениеРасчетовПоЗарплатеСервер.ДанныеСчетаУчетаЗП 
//Функция - получает статус сотрудника
//
// Возвращаемое значение:
//  Структура
Функция ДанныеСчетаУчетаЗП(СтруктураОтбора) Экспорт 

	// Выбирается значение по всем параметрам
	// по убыванию от максимально подходящего
	РезультатСчетаУчетаЗП = Новый Структура("СчетУчетаЗатрат, СтатьяЗатрат, СчетУчетаЗатратСоцОтчисления, СтатьяЗатратСоцОтчисления", 
		ПланыСчетов.Хозрасчетный.ПустаяСсылка(), 
		Справочники.СтатьиЗатрат.ПустаяСсылка(),
		ПланыСчетов.Хозрасчетный.ПустаяСсылка(), 
		Справочники.СтатьиЗатрат.ПустаяСсылка());
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетаУчетаЗП.Подразделение КАК Подразделение,
		|	СчетаУчетаЗП.ВидРасчетаНачисления КАК ВидРасчетаНачисления,
		|	СчетаУчетаЗП.СчетУчетаЗатрат КАК СчетУчетаЗатрат,
		|	СчетаУчетаЗП.СтатьяЗатрат КАК СтатьяЗатрат,
		|	СчетаУчетаЗП.СчетУчетаЗатратСоцОтчисления КАК СчетУчетаЗатратСоцОтчисления,
		|	СчетаУчетаЗП.СтатьяЗатратСоцОтчисления КАК СтатьяЗатратСоцОтчисления
		|ПОМЕСТИТЬ ВременнаяТаблицаСчетаУчетаЗП
		|ИЗ
		|	РегистрСведений.СчетаУчетаЗП КАК СчетаУчетаЗП
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Подразделение,
		|	ВидРасчетаНачисления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		// 1. По Виду расчета и Подразделению.
		|ВЫБРАТЬ
		|	СчетаУчетаЗП.СчетУчетаЗатрат КАК СчетУчетаЗатрат,
		|	СчетаУчетаЗП.СтатьяЗатрат КАК СтатьяЗатрат,
		|	СчетаУчетаЗП.СчетУчетаЗатратСоцОтчисления КАК СчетУчетаЗатратСоцОтчисления,
		|	СчетаУчетаЗП.СтатьяЗатратСоцОтчисления КАК СтатьяЗатратСоцОтчисления
		|ПОМЕСТИТЬ ВременнаяТаблицаСчетаУчетаЗПОтбор
		|ИЗ
		|	ВременнаяТаблицаСчетаУчетаЗП КАК СчетаУчетаЗП
		|ГДЕ
		|	СчетаУчетаЗП.Подразделение = &Подразделение
		|	И СчетаУчетаЗП.ВидРасчетаНачисления = &ВидРасчетаНачисления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		// 2. По Виду расчета и пустому подразделению.
		|ВЫБРАТЬ
		|	СчетаУчетаЗП.СчетУчетаЗатрат КАК СчетУчетаЗатрат,
		|	СчетаУчетаЗП.СтатьяЗатрат КАК СтатьяЗатрат,
		|	СчетаУчетаЗП.СчетУчетаЗатратСоцОтчисления КАК СчетУчетаЗатратСоцОтчисления,
		|	СчетаУчетаЗП.СтатьяЗатратСоцОтчисления КАК СтатьяЗатратСоцОтчисления
		|ИЗ
		|	ВременнаяТаблицаСчетаУчетаЗП КАК СчетаУчетаЗП
		|ГДЕ
		|	СчетаУчетаЗП.Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		|	И СчетаУчетаЗП.ВидРасчетаНачисления = &ВидРасчетаНачисления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		// 3. По подразделению и пустому виду расчета.
		|ВЫБРАТЬ
		|	СчетаУчетаЗП.СчетУчетаЗатрат,
		|	СчетаУчетаЗП.СтатьяЗатрат,
		|	СчетаУчетаЗП.СчетУчетаЗатратСоцОтчисления,
		|	СчетаУчетаЗП.СтатьяЗатратСоцОтчисления
		|ИЗ
		|	ВременнаяТаблицаСчетаУчетаЗП КАК СчетаУчетаЗП
		|ГДЕ
		|	СчетаУчетаЗП.Подразделение = &Подразделение
		|	И СчетаУчетаЗП.ВидРасчетаНачисления = ЗНАЧЕНИЕ(ПланВидовРасчета.ВидыНачислений.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		// 4. По пустому подразделению и пустому виду расчета.
		|ВЫБРАТЬ
		|	СчетаУчетаЗП.СчетУчетаЗатрат,
		|	СчетаУчетаЗП.СтатьяЗатрат,
		|	СчетаУчетаЗП.СчетУчетаЗатратСоцОтчисления,
		|	СчетаУчетаЗП.СтатьяЗатратСоцОтчисления
		|ИЗ
		|	ВременнаяТаблицаСчетаУчетаЗП КАК СчетаУчетаЗП
		|ГДЕ
		|	СчетаУчетаЗП.Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		|	И СчетаУчетаЗП.ВидРасчетаНачисления = ЗНАЧЕНИЕ(ПланВидовРасчета.ВидыНачислений.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВременнаяТаблицаСчетаУчетаЗПОтбор.СчетУчетаЗатрат КАК СчетУчетаЗатрат,
		|	ВременнаяТаблицаСчетаУчетаЗПОтбор.СтатьяЗатрат КАК СтатьяЗатрат,
		|	ВременнаяТаблицаСчетаУчетаЗПОтбор.СчетУчетаЗатратСоцОтчисления КАК СчетУчетаЗатратСоцОтчисления,
		|	ВременнаяТаблицаСчетаУчетаЗПОтбор.СтатьяЗатратСоцОтчисления КАК СтатьяЗатратСоцОтчисления
		|ИЗ
		|	ВременнаяТаблицаСчетаУчетаЗПОтбор КАК ВременнаяТаблицаСчетаУчетаЗПОтбор";
	Запрос.УстановитьПараметр("Подразделение", СтруктураОтбора.Подразделение);
	Запрос.УстановитьПараметр("ВидРасчетаНачисления", СтруктураОтбора.ВидРасчетаНачисления);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		ЗаполнитьЗначенияСвойств(РезультатСчетаУчетаЗП, ВыборкаДетальныеЗаписи);
	КонецЕсли;;
	
	Возврат РезультатСчетаУчетаЗП;	
КонецФункции // ПараметрыОтраженияВУчете()

// Нужно использовать функцию ПроведениеРасчетовПоЗарплатеСервер.НормыБольничныхЛистов 
//Функция - получает размеры для расчета больничных личтов в зависимости от стажа
//
// Возвращаемое значение:
//  Структура
Функция НормыБольничныхЛистов(КоличествоЛетСтажа) Экспорт 

	Размеры = Новый Структура("НижняяГраница, ДнейОрганизации, Процент, ПроцентБеременность, РазмерЗаСчетСФ, РазмерБеременностьЗаСчетСФ",0,0,0,0,0,0);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НормыБольничныхЛистов.НижняяГраница КАК НижняяГраница,
		|	НормыБольничныхЛистов.ДнейОрганизации КАК ДнейОрганизации,
		|	НормыБольничныхЛистов.Процент КАК Процент,
		|	НормыБольничныхЛистов.ПроцентБеременность КАК ПроцентБеременность,
		|	НормыБольничныхЛистов.РазмерЗаСчетСФ КАК РазмерЗаСчетСФ,
		|	НормыБольничныхЛистов.РазмерБеременностьЗаСчетСФ КАК РазмерБеременностьЗаСчетСФ
		|ИЗ
		|	РегистрСведений.НормыБольничныхЛистов КАК НормыБольничныхЛистов
		|ГДЕ
		|	НормыБольничныхЛистов.НижняяГраница <= &КоличествоЛетСтажа
		|
		|УПОРЯДОЧИТЬ ПО
		|	НижняяГраница УБЫВ";
	Запрос.УстановитьПараметр("КоличествоЛетСтажа", КоличествоЛетСтажа);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Размеры, ВыборкаДетальныеЗаписи);	
	КонецЕсли;
	
	Возврат Размеры;	
КонецФункции // НормыБольничныхЛистов()
