#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПроцедурыИФункцииОбщегоНазначения

Функция ЕстьДокументВУказанныйПериод(Дата)

	Запрос = Новый Запрос;
	Запрос.Текст = 	
	"ВЫБРАТЬ
	|	ОтчетПоКосвеннымНалогам.Ссылка
	|ИЗ
	|	Документ.ОтчетПоКосвеннымНалогам КАК ОтчетПоКосвеннымНалогам
	|ГДЕ
	|	НЕ ОтчетПоКосвеннымНалогам.ПометкаУдаления
	|	И КОНЕЦПЕРИОДА(ОтчетПоКосвеннымНалогам.Дата, МЕСЯЦ) = &Дата";

	Запрос.УстановитьПараметр("Дата", Дата);		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка.Количество() > 0 	

КонецФункции // КонтрольСозданияНовогоДокумента(Отказ, Объект)

#КонецОбласти

#Область ОбработчикиСобытий

// Процедура - обработчик события ОбработкаЗаполнения объекта.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеОбъектов.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения);
	
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Дата = КонецМесяца(ТекущаяДата());
		Если ЕстьДокументВУказанныйПериод(Дата) Тогда
			Дата = Дата('00010101');
		КонецЕсли;		
	КонецЕсли;		
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

