#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

Процедура СформироватьТабличныйДокументМониторИзДокумента(ТабличныйДокумент, СтруктураДанных) Экспорт
			
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.МониторПоНоменклатуре.РасшифровкаДокумента");
	
	ОбластьМакета	= Макет.ПолучитьОбласть("Строка");
	Для каждого Поле Из СтруктураДанных Цикл
		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Поле);
		ТабличныйДокумент.Вывести(ОбластьМакета);	
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли