#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Процедура - обработчик события ОбработкаЗаполнения объекта.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеОбъектовБП.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения);
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Дата = КонецМесяца(ТекущаяДатаСеанса());
		Если ЕстьДокументВУказанныйПериод(Дата) Тогда
			Дата = Дата('00010101');
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаПроверкиЗаполнения объекта.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	// Предварительный контроль
	ВыполнитьПредварительныйКонтроль(Отказ);	
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

#КонецОбласти
	
#Область СлужебныеПроцедурыИФункции

// Процедура выполняет контроль противоречий.
//
Процедура ВыполнитьПредварительныйКонтроль(Отказ)
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;	
КонецПроцедуры

Функция ЕстьДокументВУказанныйПериод(Дата)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетПоНСП.Ссылка
		|ИЗ
		|	Документ.ОтчетПоНСП КАК ОтчетПоНСП
		|ГДЕ
		|	НЕ ОтчетПоНСП.ПометкаУдаления
		|	И КОНЕЦПЕРИОДА(ОтчетПоНСП.Дата, МЕСЯЦ) = &Дата";
	
	Запрос.УстановитьПараметр("Дата", Дата);		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка.Количество() > 0 	

КонецФункции 

// Процедура заполняет табличную часть ОтчетОсновной
//
Процедура ЗаполнитьТабличнуюЧастьОтчетПоНСП() Экспорт

	ДанныеУчетнойПолитики = БухгалтерскийУчетСервер.ПолучитьДанныеУчетнойПолитикиОрганизаций(Дата, Организация);	
		
	Если ДанныеУчетнойПолитики.ПлательщикНДС Тогда 
		Секция = 1;
	Иначе 
		Секция = 2;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	СтавкиНСПСрезПоследних.Ставка КАК Ставка,
		|	СтавкиНСПСрезПоследних.СтавкаНСП КАК СтавкаНСП
		|ПОМЕСТИТЬ ВременнаяТаблицаСтавкиНСПСрезПоследних
		|ИЗ
		|	РегистрСведений.СтавкиНСП.СрезПоследних(&КонецПериода, Организация = &Организация) КАК СтавкиНСПСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПродажиОбороты.БезналичныйРасчет КАК БезналичныйРасчет,
		|	ПродажиОбороты.СуммаДоходаОборот КАК Выручка,
		|	ПродажиОбороты.СуммаНСПОборот КАК СуммаНСП,
		|	ВременнаяТаблицаСтавкиНСПСрезПоследних.Ставка КАК Ставка,
		|	ПродажиОбороты.СтавкаНСП КАК СтавкаНСП
		|ПОМЕСТИТЬ ВременнаяТаблицаПродажа
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			,
		|			Организация = &Организация
		|				И Склад В (&СкладыПоГНС)) КАК ПродажиОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСтавкиНСПСрезПоследних КАК ВременнаяТаблицаСтавкиНСПСрезПоследних
		|		ПО ПродажиОбороты.СтавкаНСП = ВременнаяТаблицаСтавкиНСПСрезПоследних.СтавкаНСП
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПродажиОсновныхСредствОбороты.БезналичныйРасчет,
		|	ПродажиОсновныхСредствОбороты.СуммаДоходаОборот,
		|	ПродажиОсновныхСредствОбороты.СуммаНСПОборот,
		|	ВременнаяТаблицаСтавкиНСПСрезПоследних.Ставка,
		|	ПродажиОсновныхСредствОбороты.СтавкаНСП
		|ИЗ
		|	РегистрНакопления.ПродажиОсновныхСредств.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			,
		|			Организация = &Организация
		|				И Склад В (&СкладыПоГНС)) КАК ПродажиОсновныхСредствОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСтавкиНСПСрезПоследних КАК ВременнаяТаблицаСтавкиНСПСрезПоследних
		|		ПО ПродажиОсновныхСредствОбороты.СтавкаНСП = ВременнаяТаблицаСтавкиНСПСрезПоследних.СтавкаНСП
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаПродажа.БезналичныйРасчет КАК БезналичныйРасчет,
		|	СУММА(ВременнаяТаблицаПродажа.Выручка) КАК Выручка,
		|	СУММА(ВременнаяТаблицаПродажа.СуммаНСП) КАК СуммаНСП,
		|	ВременнаяТаблицаПродажа.Ставка КАК Ставка,
		|	ВременнаяТаблицаПродажа.СтавкаНСП КАК СтавкаНСП
		|ИЗ
		|	ВременнаяТаблицаПродажа КАК ВременнаяТаблицаПродажа
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаПродажа.БезналичныйРасчет,
		|	ВременнаяТаблицаПродажа.Ставка,
		|	ВременнаяТаблицаПродажа.СтавкаНСП";	
	
	// Если отчеты формируются дл разных ГНС,
	// то добавим отбор по складам
	Если ПолучитьФункциональнуюОпцию("ОтчетыВРазныеГНС") 
		И ЗначениеЗаполнено(ГНС) Тогда
		Запрос.УстановитьПараметр("СкладыПоГНС", СкладыПоГНС());
	Иначе 	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Склад В (&СкладыПоГНС)", "Истина");	
	КонецЕсли;	
	
	Запрос.Текст = ТекстЗапроса;
	
	Если ВидСубъекта = 0 ИЛИ ВидСубъекта = 1 Тогда
		Запрос.УстановитьПараметр("НачалоПериода", НачалоКвартала(Дата));
		Запрос.УстановитьПараметр("КонецПериода", КонецКвартала(Дата));
	Иначе 
		Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));
		Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
	КонецЕсли; 
	Запрос.УстановитьПараметр("Организация", Организация);	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если ДанныеУчетнойПолитики.Контракт Тогда
		
		ТаблицаВыручкиСПродаж = РезультатЗапроса.Выгрузить();
		ТаблицаВыручкиСПродаж.Свернуть("БезналичныйРасчет", "Выручка");
		
		Для Каждого СтрокаТаблицы Из ТаблицаВыручкиСПродаж Цикл
			СтрокаТабличнойЧасти = ОтчетОсновной.Добавить();
			
			СтрокаТабличнойЧасти.Строка 		= ?(СтрокаТаблицы.БезналичныйРасчет, "085", "084");
			СтрокаТабличнойЧасти.Содержание 	= ?(СтрокаТаблицы.БезналичныйРасчет, 
										НСтр("ru = 'В БЕЗНАЛИЧНОЙ ФОРМЕ'"),
										НСтр("ru = 'В НАЛИЧНОЙ ФОРМЕ'"));
			СтрокаТабличнойЧасти.Выручка 	= СтрокаТаблицы.Выручка;
		КонецЦикла;	
		
	Иначе		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			СтрокаТабличнойЧасти = ОтчетОсновной.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, Выборка);
			
			Если Выборка.СтавкаНСП = Справочники.СтавкиНСП.СотоваяСвязь Тогда
				СтрокаТабличнойЧасти.Строка 	= "076";
				СтрокаТабличнойЧасти.Содержание = НСтр("ru = 'ПО ДЕЯТЕЛЬНОСТИ В СФЕРЕ СОТОВОЙ СВЯЗИ'");
				Продолжить;
				
			ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.УслугиБанка Тогда
				СтрокаТабличнойЧасти.Строка 	= "079";
				СтрокаТабличнойЧасти.Содержание = НСтр("ru = 'ПО БАНКОВСКОЙ ДЕЯТЕЛЬНОСТИ'");
				Продолжить;
			КонецЕсли;
			
			Если Выборка.БезналичныйРасчет Тогда
				СтрокаТабличнойЧасти.Ставка = 0;
				Если Выборка.СтавкаНСП = Справочники.СтавкиНСП.Торговля Тогда
					СтрокаТабличнойЧасти.Строка 	= ?(Секция = 1, "053", "066");
					СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В БЕЗНАЛИЧНОЙ ФОРМЕ'");					
				ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.Прочее Тогда
					СтрокаТабличнойЧасти.Строка 	= ?(Секция = 1, "059", "072");
					СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ДЕЯТЕЛЬНОСТИ, ЗА ИСКЛЮЧЕНИЕМ ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В БЕЗНАЛИЧНОЙ ФОРМЕ'");						
			    КонецЕсли;							
			Иначе
				Если Выборка.СтавкаНСП = Справочники.СтавкиНСП.Торговля Тогда
					СтрокаТабличнойЧасти.Строка 	= ?(Секция = 1, "050", "063");
					СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В НАЛИЧНОЙ ФОРМЕ'");					
				ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.Прочее Тогда
					СтрокаТабличнойЧасти.Строка 	= ?(Секция = 1, "056", "069");
					СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ДЕЯТЕЛЬНОСТИ, ЗА ИСКЛЮЧЕНИЕМ ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В НАЛИЧНОЙ ФОРМЕ'");						
			    КонецЕсли;					
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры // ЗаполнитьТабличнуюЧастьОтчетПоНСП()

// Процедура заполняет табличные части Приложения
//
Процедура ЗаполнитьТабличныеЧастиПриложениеКОтчетуПоНСП() Экспорт 

	ДанныеУчетнойПолитики = БухгалтерскийУчетСервер.ПолучитьДанныеУчетнойПолитикиОрганизаций(КонецМесяца(Дата), Организация);	
		
	Если ДанныеУчетнойПолитики.ПлательщикНДС Тогда 
		Секция = 1;
	Иначе 
		Секция = 2;
	КонецЕсли;

	Запрос = Новый Запрос;
	ТекстЗапроса =	
		"ВЫБРАТЬ
		|	ПродажиОбороты.БезналичныйРасчет КАК БезналичныйРасчет,
		|	СУММА(ПродажиОбороты.СуммаОборот) КАК Выручка,
		|	СУММА(ПродажиОбороты.СуммаНСПОборот) КАК СуммаНСП,
		|	СтавкиНСПСрезПоследних.Ставка КАК Ставка,
		|	ПродажиОбороты.СтавкаНСП КАК СтавкаНСП
		|ПОМЕСТИТЬ ВременнаяТаблицаПервыйМесяц
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(
		|			&НачалоКвартала,
		|			КОНЕЦПЕРИОДА(&НачалоКвартала, МЕСЯЦ),
		|			,
		|			Организация = &Организация
		|				И Склад В (&СкладыПоГНС)) КАК ПродажиОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНСП.СрезПоследних(КОНЕЦПЕРИОДА(&НачалоКвартала, МЕСЯЦ), Организация = &Организация) КАК СтавкиНСПСрезПоследних
		|		ПО ПродажиОбороты.СтавкаНСП = СтавкиНСПСрезПоследних.СтавкаНСП
		|
		|СГРУППИРОВАТЬ ПО
		|	СтавкиНСПСрезПоследних.Ставка,
		|	ПродажиОбороты.БезналичныйРасчет,
		|	ПродажиОбороты.СтавкаНСП
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПродажиОсновныхСредствОбороты.БезналичныйРасчет,
		|	СУММА(ПродажиОсновныхСредствОбороты.СуммаОборот),
		|	СУММА(ПродажиОсновныхСредствОбороты.СуммаНСПОборот),
		|	СтавкиНСПСрезПоследних.Ставка,
		|	ПродажиОсновныхСредствОбороты.СтавкаНСП
		|ИЗ
		|	РегистрНакопления.ПродажиОсновныхСредств.Обороты(
		|			&НачалоКвартала,
		|			КОНЕЦПЕРИОДА(&НачалоКвартала, МЕСЯЦ),
		|			,
		|			Организация = &Организация
		|				И Склад В (&СкладыПоГНС)) КАК ПродажиОсновныхСредствОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНСП.СрезПоследних(КОНЕЦПЕРИОДА(&НачалоКвартала, МЕСЯЦ), Организация = &Организация) КАК СтавкиНСПСрезПоследних
		|		ПО ПродажиОсновныхСредствОбороты.СтавкаНСП = СтавкиНСПСрезПоследних.СтавкаНСП
		|
		|СГРУППИРОВАТЬ ПО
		|	СтавкиНСПСрезПоследних.Ставка,
		|	ПродажиОсновныхСредствОбороты.БезналичныйРасчет,
		|	ПродажиОсновныхСредствОбороты.СтавкаНСП
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПродажиОбороты.БезналичныйРасчет КАК БезналичныйРасчет,
		|	СУММА(ПродажиОбороты.СуммаОборот) КАК Выручка,
		|	СУММА(ПродажиОбороты.СуммаНСПОборот) КАК СуммаНСП,
		|	СтавкиНСПСрезПоследних.Ставка КАК Ставка,
		|	ПродажиОбороты.СтавкаНСП КАК СтавкаНСП
		|ПОМЕСТИТЬ ВременнаяТаблицаВторойМесяц
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(
		|			НАЧАЛОПЕРИОДА(&ВторойМесяцКвартала, МЕСЯЦ),
		|			КОНЕЦПЕРИОДА(&ВторойМесяцКвартала, МЕСЯЦ),
		|			,
		|			Организация = &Организация
		|				И Склад В (&СкладыПоГНС)) КАК ПродажиОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНСП.СрезПоследних(КОНЕЦПЕРИОДА(&ВторойМесяцКвартала, МЕСЯЦ), Организация = &Организация) КАК СтавкиНСПСрезПоследних
		|		ПО ПродажиОбороты.СтавкаНСП = СтавкиНСПСрезПоследних.СтавкаНСП
		|
		|СГРУППИРОВАТЬ ПО
		|	СтавкиНСПСрезПоследних.Ставка,
		|	ПродажиОбороты.БезналичныйРасчет,
		|	ПродажиОбороты.СтавкаНСП
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПродажиОсновныхСредствОбороты.БезналичныйРасчет,
		|	СУММА(ПродажиОсновныхСредствОбороты.СуммаОборот),
		|	СУММА(ПродажиОсновныхСредствОбороты.СуммаНСПОборот),
		|	СтавкиНСПСрезПоследних.Ставка,
		|	ПродажиОсновныхСредствОбороты.СтавкаНСП
		|ИЗ
		|	РегистрНакопления.ПродажиОсновныхСредств.Обороты(
		|			НАЧАЛОПЕРИОДА(&ВторойМесяцКвартала, МЕСЯЦ),
		|			КОНЕЦПЕРИОДА(&ВторойМесяцКвартала, МЕСЯЦ),
		|			,
		|			Организация = &Организация
		|				И Склад В (&СкладыПоГНС)) КАК ПродажиОсновныхСредствОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНСП.СрезПоследних(КОНЕЦПЕРИОДА(&ВторойМесяцКвартала, МЕСЯЦ), Организация = &Организация) КАК СтавкиНСПСрезПоследних
		|		ПО ПродажиОсновныхСредствОбороты.СтавкаНСП = СтавкиНСПСрезПоследних.СтавкаНСП
		|
		|СГРУППИРОВАТЬ ПО
		|	СтавкиНСПСрезПоследних.Ставка,
		|	ПродажиОсновныхСредствОбороты.БезналичныйРасчет,
		|	ПродажиОсновныхСредствОбороты.СтавкаНСП
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПродажиОбороты.БезналичныйРасчет КАК БезналичныйРасчет,
		|	СУММА(ПродажиОбороты.СуммаОборот) КАК Выручка,
		|	СУММА(ПродажиОбороты.СуммаНСПОборот) КАК СуммаНСП,
		|	СтавкиНСПСрезПоследних.Ставка КАК Ставка,
		|	ПродажиОбороты.СтавкаНСП КАК СтавкаНСП
		|ПОМЕСТИТЬ ВременнаяТаблицаТретийМесяц
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(
		|			НАЧАЛОПЕРИОДА(&КонецКвартала, МЕСЯЦ),
		|			КОНЕЦПЕРИОДА(&КонецКвартала, МЕСЯЦ),
		|			,
		|			Организация = &Организация
		|				И Склад В (&СкладыПоГНС)) КАК ПродажиОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНСП.СрезПоследних(КОНЕЦПЕРИОДА(&КонецКвартала, МЕСЯЦ), Организация = &Организация) КАК СтавкиНСПСрезПоследних
		|		ПО ПродажиОбороты.СтавкаНСП = СтавкиНСПСрезПоследних.СтавкаНСП
		|
		|СГРУППИРОВАТЬ ПО
		|	СтавкиНСПСрезПоследних.Ставка,
		|	ПродажиОбороты.БезналичныйРасчет,
		|	ПродажиОбороты.СтавкаНСП
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПродажиОсновныхСредствОбороты.БезналичныйРасчет,
		|	СУММА(ПродажиОсновныхСредствОбороты.СуммаОборот),
		|	СУММА(ПродажиОсновныхСредствОбороты.СуммаНСПОборот),
		|	СтавкиНСПСрезПоследних.Ставка,
		|	ПродажиОсновныхСредствОбороты.СтавкаНСП
		|ИЗ
		|	РегистрНакопления.ПродажиОсновныхСредств.Обороты(
		|			НАЧАЛОПЕРИОДА(&КонецКвартала, МЕСЯЦ),
		|			КОНЕЦПЕРИОДА(&КонецКвартала, МЕСЯЦ),
		|			,
		|			Организация = &Организация
		|				И Склад В (&СкладыПоГНС)) КАК ПродажиОсновныхСредствОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНСП.СрезПоследних(КОНЕЦПЕРИОДА(&КонецКвартала, МЕСЯЦ), Организация = &Организация) КАК СтавкиНСПСрезПоследних
		|		ПО ПродажиОсновныхСредствОбороты.СтавкаНСП = СтавкиНСПСрезПоследних.СтавкаНСП
		|
		|СГРУППИРОВАТЬ ПО
		|	СтавкиНСПСрезПоследних.Ставка,
		|	ПродажиОсновныхСредствОбороты.БезналичныйРасчет,
		|	ПродажиОсновныхСредствОбороты.СтавкаНСП
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаПервыйМесяц.БезналичныйРасчет КАК БезналичныйРасчет,
		|	СУММА(ВременнаяТаблицаПервыйМесяц.Выручка) КАК Выручка,
		|	СУММА(ВременнаяТаблицаПервыйМесяц.СуммаНСП) КАК СуммаНСП,
		|	ВременнаяТаблицаПервыйМесяц.Ставка КАК Ставка,
		|	ВременнаяТаблицаПервыйМесяц.СтавкаНСП КАК СтавкаНСП
		|ИЗ
		|	ВременнаяТаблицаПервыйМесяц КАК ВременнаяТаблицаПервыйМесяц
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаПервыйМесяц.БезналичныйРасчет,
		|	ВременнаяТаблицаПервыйМесяц.Ставка,
		|	ВременнаяТаблицаПервыйМесяц.СтавкаНСП
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаВторойМесяц.БезналичныйРасчет КАК БезналичныйРасчет,
		|	СУММА(ВременнаяТаблицаВторойМесяц.Выручка) КАК Выручка,
		|	СУММА(ВременнаяТаблицаВторойМесяц.СуммаНСП) КАК СуммаНСП,
		|	ВременнаяТаблицаВторойМесяц.Ставка КАК Ставка,
		|	ВременнаяТаблицаВторойМесяц.СтавкаНСП КАК СтавкаНСП
		|ИЗ
		|	ВременнаяТаблицаВторойМесяц КАК ВременнаяТаблицаВторойМесяц
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаВторойМесяц.БезналичныйРасчет,
		|	ВременнаяТаблицаВторойМесяц.Ставка,
		|	ВременнаяТаблицаВторойМесяц.СтавкаНСП
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаТретийМесяц.БезналичныйРасчет КАК БезналичныйРасчет,
		|	СУММА(ВременнаяТаблицаТретийМесяц.Выручка) КАК Выручка,
		|	СУММА(ВременнаяТаблицаТретийМесяц.СуммаНСП) КАК СуммаНСП,
		|	ВременнаяТаблицаТретийМесяц.Ставка КАК Ставка,
		|	ВременнаяТаблицаТретийМесяц.СтавкаНСП КАК СтавкаНСП
		|ИЗ
		|	ВременнаяТаблицаТретийМесяц КАК ВременнаяТаблицаТретийМесяц
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаТретийМесяц.БезналичныйРасчет,
		|	ВременнаяТаблицаТретийМесяц.Ставка,
		|	ВременнаяТаблицаТретийМесяц.СтавкаНСП";	
	// Если отчеты формируются дл разных ГНС,
	// то добавим отбор по складам
	Если ПолучитьФункциональнуюОпцию("ОтчетыВРазныеГНС") 
		И ЗначениеЗаполнено(ГНС) Тогда
		Запрос.УстановитьПараметр("СкладыПоГНС", СкладыПоГНС());
	Иначе 	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Склад В (&СкладыПоГНС)", "Истина");	
	КонецЕсли;	
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("НачалоКвартала", НачалоКвартала(Дата));	
	Запрос.УстановитьПараметр("ВторойМесяцКвартала", ДобавитьМесяц(НачалоКвартала(Дата),+1));	
	Запрос.УстановитьПараметр("КонецКвартала", КонецКвартала(Дата));	
	Запрос.УстановитьПараметр("Организация", Организация);	
	Запрос.УстановитьПараметр("ПлательщикНДС", ?(Секция = 2, Ложь, Истина));
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();		
	
	Если ДанныеУчетнойПолитики.Контракт Тогда
		
		// Первый месяц
		ТаблцаВыручкиЗаПервыйМесяц = РезультатЗапроса[3].Выгрузить();
		ТаблцаВыручкиЗаПервыйМесяц.Свернуть("БезналичныйРасчет", "Выручка");
		
		Для Каждого СтрокаТаблицы Из ТаблцаВыручкиЗаПервыйМесяц Цикл
			СтрокаТабличнойЧасти = ПриложениеПервыйМесяцКвартала.Добавить();
			
			СтрокаТабличнойЧасти.Строка 		= ?(СтрокаТаблицы.БезналичныйРасчет, "185", "184");
			СтрокаТабличнойЧасти.Содержание 	= ?(СтрокаТаблицы.БезналичныйРасчет, 
										НСтр("ru = 'В БЕЗНАЛИЧНОЙ ФОРМЕ'"),
										НСтр("ru = 'В НАЛИЧНОЙ ФОРМЕ'"));
			СтрокаТабличнойЧасти.Выручка 	= СтрокаТаблицы.Выручка;
		КонецЦикла;
		
		// Второй месяц
		ТаблцаВыручкиЗаВторойМесяц = РезультатЗапроса[4].Выгрузить();
		ТаблцаВыручкиЗаВторойМесяц.Свернуть("БезналичныйРасчет", "Выручка");
		
		Для Каждого СтрокаТаблицы Из ТаблцаВыручкиЗаВторойМесяц Цикл
			СтрокаТабличнойЧасти = ПриложениеВторойМесяцКвартала.Добавить();
			
			СтрокаТабличнойЧасти.Строка 		= ?(СтрокаТаблицы.БезналичныйРасчет, "235", "234");
			СтрокаТабличнойЧасти.Содержание 	= ?(СтрокаТаблицы.БезналичныйРасчет, 
										НСтр("ru = 'В БЕЗНАЛИЧНОЙ ФОРМЕ'"),
										НСтр("ru = 'В НАЛИЧНОЙ ФОРМЕ'"));
			СтрокаТабличнойЧасти.Выручка 	= СтрокаТаблицы.Выручка;
		КонецЦикла;
		
		// Третий месяц
		ТаблцаВыручкиЗаТретийМесяц = РезультатЗапроса[5].Выгрузить();
		ТаблцаВыручкиЗаТретийМесяц.Свернуть("БезналичныйРасчет", "Выручка");
		
		Для Каждого СтрокаТаблицы Из ТаблцаВыручкиЗаТретийМесяц Цикл
			СтрокаТабличнойЧасти = ПриложениеТретийМесяцКвартала.Добавить();
			
			СтрокаТабличнойЧасти.Строка 		= ?(СтрокаТаблицы.БезналичныйРасчет, "285", "284");
			СтрокаТабличнойЧасти.Содержание 	= ?(СтрокаТаблицы.БезналичныйРасчет, 
										НСтр("ru = 'В БЕЗНАЛИЧНОЙ ФОРМЕ'"),
										НСтр("ru = 'В НАЛИЧНОЙ ФОРМЕ'"));
			СтрокаТабличнойЧасти.Выручка 	= СтрокаТаблицы.Выручка;
		КонецЦикла;
		
	Иначе	
		// Первый месяц
		Выборка = РезультатЗапроса[3].Выбрать();	
		Пока Выборка.Следующий() Цикл
			
			СтрокаТабличнойЧасти = ПриложениеПервыйМесяцКвартала.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, Выборка);
					
			Если Выборка.СтавкаНСП = Справочники.СтавкиНСП.СотоваяСвязь Тогда
				СтрокаТабличнойЧасти.Строка 	= "176";
				СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ДЕЯТЕЛЬНОСТИ В СФЕРЕ СОТОВОЙ СВЯЗИ'");
				Продолжить;
				
			ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.УслугиБанка Тогда
				СтрокаТабличнойЧасти.Строка 	= "179";
				СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО БАНКОВСКОЙ ДЕЯТЕЛЬНОСТИ'");
				Продолжить;
			КонецЕсли;
					
			Если Выборка.БезналичныйРасчет Тогда
				СтрокаТабличнойЧасти.Ставка = 0;

				Если Выборка.СтавкаНСП = Справочники.СтавкиНСП.Торговля Тогда
					СтрокаТабличнойЧасти.Строка 	= ?(Секция = 1, "153", "166");
					СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В БЕЗНАЛИЧНОЙ ФОРМЕ'");					
				ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.Прочее Тогда
					СтрокаТабличнойЧасти.Строка 	= ?(Секция = 1, "159", "172");
					СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ДЕЯТЕЛЬНОСТИ, ЗА ИСКЛЮЧЕНИЕМ ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В БЕЗНАЛИЧНОЙ ФОРМЕ'");						
			    КонецЕсли;							
			Иначе
				Если Выборка.СтавкаНСП = Справочники.СтавкиНСП.Торговля Тогда
					СтрокаТабличнойЧасти.Строка 	= ?(Секция = 1, "150", "163");
					СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В НАЛИЧНОЙ ФОРМЕ'");					
				ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.Прочее Тогда
					СтрокаТабличнойЧасти.Строка 	= ?(Секция = 1, "156", "169");
					СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ДЕЯТЕЛЬНОСТИ, ЗА ИСКЛЮЧЕНИЕМ ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В НАЛИЧНОЙ ФОРМЕ'");						
			    КонецЕсли;					
			КонецЕсли;
		КонецЦикла;

		// Второй месяц
		Выборка = РезультатЗапроса[4].Выбрать();	
		Пока Выборка.Следующий() Цикл
			
			СтрокаТабличнойЧасти = ПриложениеВторойМесяцКвартала.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, Выборка);
					
			Если Выборка.СтавкаНСП = Справочники.СтавкиНСП.СотоваяСвязь Тогда
				СтрокаТабличнойЧасти.Строка 	= "226";
				СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ДЕЯТЕЛЬНОСТИ В СФЕРЕ СОТОВОЙ СВЯЗИ'");
				Продолжить;
				
			ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.УслугиБанка Тогда
				СтрокаТабличнойЧасти.Строка 	= "229";
				СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО БАНКОВСКОЙ ДЕЯТЕЛЬНОСТИ'");
				Продолжить;
			КонецЕсли;
					
			Если Выборка.БезналичныйРасчет Тогда
				СтрокаТабличнойЧасти.Ставка = 0;

				Если Выборка.СтавкаНСП = Справочники.СтавкиНСП.Торговля Тогда
					СтрокаТабличнойЧасти.Строка 	= ?(Секция = 1, "203", "216");
					СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В БЕЗНАЛИЧНОЙ ФОРМЕ'");					
				ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.Прочее Тогда
					СтрокаТабличнойЧасти.Строка 	= ?(Секция = 1, "209", "222");
					СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ДЕЯТЕЛЬНОСТИ, ЗА ИСКЛЮЧЕНИЕМ ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В БЕЗНАЛИЧНОЙ ФОРМЕ'");						
			    КонецЕсли;							
			Иначе
				Если Выборка.СтавкаНСП = Справочники.СтавкиНСП.Торговля Тогда
					СтрокаТабличнойЧасти.Строка 	= ?(Секция = 1, "200", "213");
					СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В НАЛИЧНОЙ ФОРМЕ'");					
				ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.Прочее Тогда
					СтрокаТабличнойЧасти.Строка 	= ?(Секция = 1, "206", "219");
					СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ДЕЯТЕЛЬНОСТИ, ЗА ИСКЛЮЧЕНИЕМ ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В НАЛИЧНОЙ ФОРМЕ'");						
			    КонецЕсли;					
			КонецЕсли;
		КонецЦикла;

		
		// Третий месяц
		Выборка = РезультатЗапроса[5].Выбрать();	
		Пока Выборка.Следующий() Цикл
			СтрокаТабличнойЧасти = ПриложениеТретийМесяцКвартала.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, Выборка);
			
			Если Выборка.СтавкаНСП = Справочники.СтавкиНСП.СотоваяСвязь Тогда
				СтрокаТабличнойЧасти.Строка 	= "276";
				СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ДЕЯТЕЛЬНОСТИ В СФЕРЕ СОТОВОЙ СВЯЗИ'");
				Продолжить;
				
			ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.УслугиБанка Тогда
				СтрокаТабличнойЧасти.Строка 	= "279";
				СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО БАНКОВСКОЙ ДЕЯТЕЛЬНОСТИ'");
				Продолжить;	
			КонецЕсли;
			
			Если Выборка.БезналичныйРасчет Тогда
				СтрокаТабличнойЧасти.Ставка = 0;

				Если Выборка.СтавкаНСП = Справочники.СтавкиНСП.Торговля Тогда
					СтрокаТабличнойЧасти.Строка 	= ?(Секция = 1, "253", "266");
					СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В БЕЗНАЛИЧНОЙ ФОРМЕ'");					
				ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.Прочее Тогда
					СтрокаТабличнойЧасти.Строка 	= ?(Секция = 1, "259", "272");
					СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ДЕЯТЕЛЬНОСТИ, ЗА ИСКЛЮЧЕНИЕМ ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В БЕЗНАЛИЧНОЙ ФОРМЕ'");						
				КонецЕсли;							
			Иначе
				Если Выборка.СтавкаНСП = Справочники.СтавкиНСП.Торговля Тогда
					СтрокаТабличнойЧасти.Строка 	= ?(Секция = 1, "250", "263");
					СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В НАЛИЧНОЙ ФОРМЕ'");					
				ИначеЕсли Выборка.СтавкаНСП = Справочники.СтавкиНСП.Прочее Тогда
					СтрокаТабличнойЧасти.Строка 	= ?(Секция = 1, "256", "269");
					СтрокаТабличнойЧасти.Содержание 	= НСтр("ru = 'ПО ДЕЯТЕЛЬНОСТИ, ЗА ИСКЛЮЧЕНИЕМ ТОРГОВОЙ ДЕЯТЕЛЬНОСТИ, ОПЛАЧЕННЫХ: В НАЛИЧНОЙ ФОРМЕ'");						
				КонецЕсли;					
			КонецЕсли;		
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Функция СкладыПоГНС()
	
	ПодразделенияПоГНС = БухгалтерскиеОтчеты.ПодразделенияПоГНС(Организация, ГНС);
	
	// Склады по подразделениям.
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Склады.Ссылка КАК Склад
		|ИЗ
		|	Справочник.Склады КАК Склады
		|ГДЕ
		|	Склады.ПодразделениеОрганизации В(&ПодразделенияПоГНС)";
	Запрос.УстановитьПараметр("ПодразделенияПоГНС", ПодразделенияПоГНС);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Склад");

КонецФункции // СкладыПоГНС()

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли