
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	РаботаСОтборамиКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Организация", Организация, ЗначениеЗаполнено(Организация));
	РаботаСОтборамиКлиентСервер.УстановитьЭлементОтбораСписка(Список, "ФизЛицо", ФизЛицо, ЗначениеЗаполнено(ФизЛицо));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Процедура - обработчик события ПриИзменении поля ввода Организация.
//
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	РаботаСОтборамиКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Организация", Организация, ЗначениеЗаполнено(Организация));
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода ФизЛицо.
//
&НаКлиенте
Процедура ФизЛицоПриИзменении(Элемент)
	РаботаСОтборамиКлиентСервер.УстановитьЭлементОтбораСписка(Список, "ФизЛицо", ФизЛицо, ЗначениеЗаполнено(ФизЛицо));
КонецПроцедуры

#КонецОбласти

