
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	БухгалтерскийУчетКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Организация", Организация, ЗначениеЗаполнено(Организация));
	БухгалтерскийУчетКлиентСервер.УстановитьЭлементОтбораСписка(Список, "ФизЛицо", ФизЛицо, ЗначениеЗаполнено(ФизЛицо));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	БухгалтерскийУчетКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Организация", Организация, ЗначениеЗаполнено(Организация));
КонецПроцедуры

&НаКлиенте
Процедура ФизЛицоПриИзменении(Элемент)
	БухгалтерскийУчетКлиентСервер.УстановитьЭлементОтбораСписка(Список, "ФизЛицо", ФизЛицо, ЗначениеЗаполнено(ФизЛицо));
КонецПроцедуры

#КонецОбласти

