///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Процедура - Изменить настройки получения временных паролей
//
// Параметры:
//  Сертификат - Произвольный - сертификат
//  ОповещениеОЗавершении - ОписаниеОповещения - оповещение о завершении.
//
Процедура ИзменитьНастройкиПолученияВременныхПаролей(Сертификат, ОповещениеОЗавершении = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура("Сертификат", Сертификат);
	ОткрытьФорму(
		"ОбщаяФорма.НастройкиПолученияВременныхПаролей",
		ПараметрыФормы,,,,,
		ОповещениеОЗавершении);
	
КонецПроцедуры

#КонецОбласти