#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Процедура - обработчик события ОбработкаЗаполнения объекта.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда 
		// Установка флага "Услуга" по значению родителя.
		Если ДанныеЗаполнения.Свойство("Родитель")
			И Не ДанныеЗаполнения.Свойство("Услуга") Тогда 
			
			Услуга = ДанныеЗаполнения.Родитель.Услуга;
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

// Процедура - обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоГруппа 
		И НЕ ЗначениеЗаполнено(НаименованиеПолное) Тогда 
		НаименованиеПолное = Наименование;
	КонецЕсли;
	
	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры

#КонецОбласти

#КонецЕсли

