
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ДокументВозвратаТоваров") Тогда
		ДокументВозвратаТоваров = Параметры.ДокументВозвратаТоваров;
	Иначе
		ДокументВозвратаТоваров = Ложь;
	КонецЕсли;
	
	РаботаСОтборами.ВосстановитьНастройкиОтборов(ЭтотОбъект, Список);
	
	Если Параметры.Отбор.Свойство("ДатаДопРасходов") Тогда
		ОтборПериод.ДатаОкончания = Параметры.Отбор.ДатаДопРасходов;
	КонецЕсли;
	
	// РаботаСФормами
	РаботаСФормамиСервер.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец РаботаСФормами	

	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Список.Параметры.УстановитьЗначениеПараметра("ДокументВозвратаТоваров", ДокументВозвратаТоваров);
	
	ПараметрыПериода = Новый Структура();
	ПараметрыПериода.Вставить("ИмяПоляОтбора", "Дата");
	ПараметрыПериода.Вставить("ИмяСпискаОтбора", "Список");
	ПараметрыПериода.Вставить("Форма", ЭтотОбъект);
	
	РаботаСОтборамиКлиент.ПредставлениеПериодаНажатиеЗавершение(ОтборПериод, ПараметрыПериода);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПредставлениеПериодаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РаботаСОтборамиКлиент.ПредставлениеПериодаВыбратьПериод(ЭтотОбъект, "Список", "Дата");
	
КонецПроцедуры

#КонецОбласти

	