#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПроцедурыПроведенияДокумента

// Формирует таблицу значений, содержащую данные для проведения по регистру бухгалтерии Хозрасчетный.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаХозрасчетный(ДокументСсылка, СтруктураДополнительныеСвойства, Отказ)	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	// 1. Розничная оплата наличными
	// 2. Розничная оплата наличными сумма НДС
	// 3. Розничная оплата наличными сумма НСП
	// 4. Розничная оплата картами
	// 5. Розничная оплата картами сумма НДС
	// 6. Себестоимость розничных продаж
	// 7. Приход в кассу розничных продаж
	// 8. Оптовые поступления товаров
	// 9. Оптовые поступления товаров (возврат)
	// 10. Оптовые поступления товаров сумма НДС
	// 11. Оптовые поступления товаров сумма НДС (возврат)
	// 12. Оплата поставщикам - безналичная оплата
	// 13. Оплата поставщикам - безналичная оплата (возврат)
	// 14. Оплата поставщикам - наличная оплата
	// 15. Оплата поставщикам - наличная оплата (возврат)
	// 16. Оплата от покупателей - наличная оплата
	// 17. Оплата от покупателей - наличная оплата (возврат)
	// 18. Оплата от покупателей - безналичная оплата
	// 19. Оплата от покупателей - безналичная оплата (возврат)
	// 20. Оптовая реализация товаров
	// 21. Оптовая реализация товаров (возврат)
	// 22. Оптовая реализация товаров - себестоимость
	// 23. Оптовая реализация товаров - себестоимость (возврат)
	// 24. Оптовая реализация товаров - доход
	// 25. Оптовая реализация товаров - доход (возврат)
	// 26. Оптовая реализация товаров сумма НДС
	// 27. Оптовая реализация товаров сумма НСП
	// 28. Оптовая реализация товаров сумма НДС (возврат)
	// 29. Оптовая реализация товаров сумма НСП (возврат)
	
	// Оплата наличными
	ТекстЗапроса = "ВЫБРАТЬ
		|	1 КАК Порядок,
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаШапка.СчетРасчетовПокупателя КАК СчетДт,
		|	ВременнаяТаблицаШапка.СчетУчетаДоходаТоваров КАК СчетКт,
		|	ВременнаяТаблицаШапка.Контрагент КАК СубконтоДт1,
		|	ВременнаяТаблицаШапка.ДоговорКонтрагента КАК СубконтоДт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
		|	ВременнаяТаблицаШапка.СтатьяРасхода КАК СубконтоКт1,
		|	ВременнаяТаблицаШапка.Номенклатура КАК СубконтоКт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
		|	ВременнаяТаблицаШапка.РозничнаяОплатаНаличными - ВременнаяТаблицаШапка.РозничнаяОплатаНаличнымиСуммаНДС - ВременнаяТаблицаШапка.РозничнаяОплатаНаличнымиСуммаНСП КАК Сумма,
		|	&ВалютаРегламентированногоУчета КАК ВалютаДт,
		|	&ВалютаРегламентированногоУчета КАК ВалютаКт,
		|	ВременнаяТаблицаШапка.РозничнаяОплатаНаличными КАК ВалютнаяСуммаДт,
		|	0 КАК ВалютнаяСуммаКт,
		|	&РозничнаяОплатаНаличными КАК Содержание
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|ГДЕ
		|	ВременнаяТаблицаШапка.РозничнаяОплатаНаличными <> 0";
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияБПСервер.ТекстОбъединитьВсе();
	
	// Оплата наличными Сумма НДС
	ТекстЗапроса = ТекстЗапроса + "ВЫБРАТЬ
		|	2 КАК Порядок,
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаШапка.СчетРасчетовПокупателя КАК СчетДт,
		|	Значение(ПланСчетов.Хозрасчетный.НДСКОплате) КАК СчетКт,
		|	ВременнаяТаблицаШапка.Контрагент КАК СубконтоДт1,
		|	ВременнаяТаблицаШапка.ДоговорКонтрагента КАК СубконтоДт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
		|	ВременнаяТаблицаШапка.СтатьяРасхода КАК СубконтоКт1,
		|	ВременнаяТаблицаШапка.Номенклатура КАК СубконтоКт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
		|	ВременнаяТаблицаШапка.РозничнаяОплатаНаличнымиСуммаНДС КАК Сумма,
		|	&ВалютаРегламентированногоУчета КАК ВалютаДт,
		|	&ВалютаРегламентированногоУчета КАК ВалютаКт,
		|	ВременнаяТаблицаШапка.РозничнаяОплатаНаличнымиСуммаНДС КАК ВалютнаяСуммаДт,
		|	0 КАК ВалютнаяСуммаКт,
		|	&РозничнаяОплатаНаличнымиСуммаНДС КАК Содержание
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|ГДЕ
		|	ВременнаяТаблицаШапка.РозничнаяОплатаНаличнымиСуммаНДС <> 0";
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияБПСервер.ТекстОбъединитьВсе();
	
	// Оплата наличными Сумма НСП
	ТекстЗапроса = ТекстЗапроса + "ВЫБРАТЬ
		|	3 КАК Порядок,
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаШапка.СчетРасчетовПокупателя КАК СчетДт,
		|	Значение(ПланСчетов.Хозрасчетный.НалогСПродаж) КАК СчетКт,
		|	ВременнаяТаблицаШапка.Контрагент КАК СубконтоДт1,
		|	ВременнаяТаблицаШапка.ДоговорКонтрагента КАК СубконтоДт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
		|	ВременнаяТаблицаШапка.СтатьяРасхода КАК СубконтоКт1,
		|	ВременнаяТаблицаШапка.Номенклатура КАК СубконтоКт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
		|	ВременнаяТаблицаШапка.РозничнаяОплатаНаличнымиСуммаНСП КАК Сумма,
		|	&ВалютаРегламентированногоУчета КАК ВалютаДт,
		|	&ВалютаРегламентированногоУчета КАК ВалютаКт,
		|	ВременнаяТаблицаШапка.РозничнаяОплатаНаличнымиСуммаНСП КАК ВалютнаяСуммаДт,
		|	0 КАК ВалютнаяСуммаКт,
		|	&РозничнаяОплатаНаличнымиСуммаНСП КАК Содержание
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|ГДЕ
		|	ВременнаяТаблицаШапка.РозничнаяОплатаНаличнымиСуммаНСП <> 0";
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияБПСервер.ТекстОбъединитьВсе();
	
	// Оплата по картам
	ТекстЗапроса = ТекстЗапроса +
		"ВЫБРАТЬ
		|	4 КАК Порядок,
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаШапка.СчетРасчетовПокупателя КАК СчетДт,
		|	ВременнаяТаблицаШапка.СчетУчетаДоходаТоваров КАК СчетКт,
		|	ВременнаяТаблицаШапка.Контрагент КАК СубконтоДт1,
		|	ВременнаяТаблицаШапка.ДоговорКонтрагента КАК СубконтоДт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
		|	ВременнаяТаблицаШапка.СтатьяРасхода КАК СубконтоКт1,
		|	ВременнаяТаблицаШапка.Номенклатура КАК СубконтоКт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
		|	ВременнаяТаблицаШапка.РозничнаяОплатаПоКартам - ВременнаяТаблицаШапка.РозничнаяОплатаПоКартамСуммаНДС КАК Сумма,
		|	&ВалютаРегламентированногоУчета КАК ВалютаДт,
		|	&ВалютаРегламентированногоУчета КАК ВалютаКт,
		|	ВременнаяТаблицаШапка.РозничнаяОплатаПоКартам КАК ВалютнаяСуммаДт,
		|	0 КАК ВалютнаяСуммаКт,
		|	&РозничнаяОплатаКартами КАК Содержание
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|ГДЕ
		|	ВременнаяТаблицаШапка.РозничнаяОплатаПоКартам <> 0";
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияБПСервер.ТекстОбъединитьВсе();
	
	// Оплата по картам Сумма НДС
	ТекстЗапроса = ТекстЗапроса +
		"ВЫБРАТЬ
		|	5 КАК Порядок,
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаШапка.СчетРасчетовПокупателя КАК СчетДт,
		|	Значение(ПланСчетов.Хозрасчетный.НДСКОплате) КАК СчетКт,
		|	ВременнаяТаблицаШапка.Контрагент КАК СубконтоДт1,
		|	ВременнаяТаблицаШапка.ДоговорКонтрагента КАК СубконтоДт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
		|	ВременнаяТаблицаШапка.СтатьяРасхода КАК СубконтоКт1,
		|	ВременнаяТаблицаШапка.Номенклатура КАК СубконтоКт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
		|	ВременнаяТаблицаШапка.РозничнаяОплатаПоКартамСуммаНДС КАК Сумма,
		|	&ВалютаРегламентированногоУчета КАК ВалютаДт,
		|	&ВалютаРегламентированногоУчета КАК ВалютаКт,
		|	ВременнаяТаблицаШапка.РозничнаяОплатаПоКартамСуммаНДС КАК ВалютнаяСуммаДт,
		|	0 КАК ВалютнаяСуммаКт,
		|	&РозничнаяОплатаКартамиСуммаНДС КАК Содержание
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|ГДЕ
		|	ВременнаяТаблицаШапка.РозничнаяОплатаПоКартам <> 0";
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияБПСервер.ТекстОбъединитьВсе();
	
	// Себестоимость продаж
	ТекстЗапроса = ТекстЗапроса +
		"ВЫБРАТЬ
		|	6 КАК Порядок,
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаШапка.СчетУчетаРасходаТоваров КАК СчетДт,
		|	ВременнаяТаблицаШапка.СчетУчетаТоваров КАК СчетКт,
		|	ВременнаяТаблицаШапка.Склад КАК СубконтоДт1,
		|	ВременнаяТаблицаШапка.Номенклатура КАК СубконтоДт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
		|	ВременнаяТаблицаШапка.Номенклатура КАК СубконтоКт1,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
		|	ВременнаяТаблицаШапка.СебестоимостьРозничныхПродаж КАК Сумма,
		|	&ВалютаРегламентированногоУчета КАК ВалютаДт,
		|	&ВалютаРегламентированногоУчета КАК ВалютаКт,
		|	ВременнаяТаблицаШапка.СебестоимостьРозничныхПродаж КАК ВалютнаяСуммаДт,
		|	0 КАК ВалютнаяСуммаКт,
		|	&СебестоимостьРозничныхПродаж КАК Содержание
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|ГДЕ
		|	ВременнаяТаблицаШапка.РозничнаяОплатаНаличными <> 0";
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияБПСервер.ТекстОбъединитьВсе();
	
	// Приход в кассу
	ТекстЗапроса = ТекстЗапроса + "ВЫБРАТЬ
		|	7 КАК Порядок,
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаШапка.Касса.СчетУчета КАК СчетДт,
		|	ВременнаяТаблицаШапка.СчетРасчетовПокупателя КАК СчетКт,
		|	ВременнаяТаблицаШапка.Касса КАК СубконтоДт1,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
		|	ВременнаяТаблицаШапка.Контрагент КАК СубконтоКт1,
		|	ВременнаяТаблицаШапка.ДоговорКонтрагента КАК СубконтоКт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
		|	ВременнаяТаблицаШапка.РозничнаяОплатаНаличными КАК Сумма,
		|	&ВалютаРегламентированногоУчета КАК ВалютаДт,
		|	&ВалютаРегламентированногоУчета КАК ВалютаКт,
		|	0 КАК ВалютнаяСуммаДт,
		|	ВременнаяТаблицаШапка.РозничнаяОплатаНаличными КАК ВалютнаяСуммаКт,
		|	&ПриходВКассуРозничныхПродаж КАК Содержание
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|ГДЕ
		|	ВременнаяТаблицаШапка.РозничнаяОплатаНаличными <> 0";
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияБПСервер.ТекстОбъединитьВсе();
	
	// Поступления
	ТекстЗапроса = ТекстЗапроса +
		"ВЫБРАТЬ
		|	8 КАК Порядок,
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаШапка.СчетУчетаТоваров КАК СчетДт,
		|	ВременнаяТаблицаПоступления.СчетРасчетов КАК СчетКт,
		|	ВременнаяТаблицаШапка.Номенклатура КАК СубконтоДт1,
		|	ВременнаяТаблицаШапка.Склад КАК СубконтоДт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
		|	ВременнаяТаблицаПоступления.Поставщик КАК СубконтоКт1,
		|	ВременнаяТаблицаПоступления.ДоговорКонтрагента КАК СубконтоКт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
		|	ВременнаяТаблицаПоступления.Сумма - ВременнаяТаблицаПоступления.СуммаНДС КАК Сумма,
		|	&ВалютаРегламентированногоУчета КАК ВалютаДт,
		|	&ВалютаРегламентированногоУчета КАК ВалютаКт,
		|	0 КАК ВалютнаяСуммаДт,
		|	ВременнаяТаблицаПоступления.Сумма - ВременнаяТаблицаПоступления.СуммаНДС КАК ВалютнаяСуммаКт,
		|	&ОптовыеПоступленияТоваров КАК Содержание
		|ИЗ
		|	ВременнаяТаблицаПоступления КАК ВременнаяТаблицаПоступления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|ГДЕ
		|	НЕ ВременнаяТаблицаПоступления.Возврат";
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияБПСервер.ТекстОбъединитьВсе();
	
	// Поступления (возврат)
	ТекстЗапроса = ТекстЗапроса +
		"ВЫБРАТЬ
		|	9 КАК Порядок,
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаШапка.СчетУчетаТоваров КАК СчетДт,
		|	ВременнаяТаблицаПоступления.СчетРасчетов КАК СчетКт,
		|	ВременнаяТаблицаШапка.Номенклатура КАК СубконтоДт1,
		|	ВременнаяТаблицаШапка.Склад КАК СубконтоДт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
		|	ВременнаяТаблицаПоступления.Поставщик КАК СубконтоКт1,
		|	ВременнаяТаблицаПоступления.ДоговорКонтрагента КАК СубконтоКт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
		|	-(ВременнаяТаблицаПоступления.Сумма - ВременнаяТаблицаПоступления.СуммаНДС) КАК Сумма,
		|	&ВалютаРегламентированногоУчета КАК ВалютаДт,
		|	&ВалютаРегламентированногоУчета КАК ВалютаКт,
		|	0 КАК ВалютнаяСуммаДт,
		|	-(ВременнаяТаблицаПоступления.Сумма - ВременнаяТаблицаПоступления.СуммаНДС) КАК ВалютнаяСуммаКт,
		|	&ОптовыеПоступленияТоваровВозврат КАК Содержание
		|ИЗ
		|	ВременнаяТаблицаПоступления КАК ВременнаяТаблицаПоступления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВременнаяТаблицаПоступления.Возврат";
		
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияБПСервер.ТекстОбъединитьВсе();
	
	// НДС поступления
	ТекстЗапроса = ТекстЗапроса +
		"ВЫБРАТЬ
		|	10 КАК Порядок,
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	Значение(ПланСчетов.Хозрасчетный.НДС_ПодлежащийВозмещению) КАК СчетДт,
		|	ВременнаяТаблицаПоступления.СчетРасчетов КАК СчетКт,
		|	ВременнаяТаблицаШапка.Номенклатура КАК СубконтоДт1,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
		|	ВременнаяТаблицаПоступления.Поставщик КАК СубконтоКт1,
		|	ВременнаяТаблицаПоступления.ДоговорКонтрагента КАК СубконтоКт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
		|	ВременнаяТаблицаПоступления.СуммаНДС КАК Сумма,
		|	&ВалютаРегламентированногоУчета КАК ВалютаДт,
		|	&ВалютаРегламентированногоУчета КАК ВалютаКт,
		|	0 КАК ВалютнаяСуммаДт,
		|	ВременнаяТаблицаПоступления.СуммаНДС КАК ВалютнаяСуммаКт,
		|	&ОптовыеПоступленияТоваровСуммаНДС КАК Содержание
		|ИЗ
		|	ВременнаяТаблицаПоступления КАК ВременнаяТаблицаПоступления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|ГДЕ
		|	НЕ ВременнаяТаблицаПоступления.Возврат И ВременнаяТаблицаПоступления.СуммаНДС <> 0";
	
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияБПСервер.ТекстОбъединитьВсе();
	
	// НДС поступления (Возврат)
	ТекстЗапроса = ТекстЗапроса +
		"ВЫБРАТЬ
		|	11 КАК Порядок,
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	Значение(ПланСчетов.Хозрасчетный.НДС_ПодлежащийВозмещению) КАК СчетДт,
		|	ВременнаяТаблицаПоступления.СчетРасчетов КАК СчетКт,
		|	ВременнаяТаблицаШапка.Номенклатура КАК СубконтоДт1,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
		|	ВременнаяТаблицаПоступления.Поставщик КАК СубконтоКт1,
		|	ВременнаяТаблицаПоступления.ДоговорКонтрагента КАК СубконтоКт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
		|	-ВременнаяТаблицаПоступления.СуммаНДС КАК Сумма,
		|	&ВалютаРегламентированногоУчета КАК ВалютаДт,
		|	&ВалютаРегламентированногоУчета КАК ВалютаКт,
		|	0 КАК ВалютнаяСуммаДт,
		|	-ВременнаяТаблицаПоступления.СуммаНДС КАК ВалютнаяСуммаКт,
		|	&ОптовыеПоступленияТоваровСуммаНДСВозврат КАК Содержание
		|ИЗ
		|	ВременнаяТаблицаПоступления КАК ВременнаяТаблицаПоступления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВременнаяТаблицаПоступления.Возврат И ВременнаяТаблицаПоступления.СуммаНДС <> 0";
	
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияБПСервер.ТекстОбъединитьВсе();
	
	//// Оплата поставщикам безнал
	//ТекстЗапроса = ТекстЗапроса +
	//	"ВЫБРАТЬ
	//	|	12 КАК Порядок,
	//	|	ВременнаяТаблицаШапка.Дата КАК Период,
	//	|	ВременнаяТаблицаШапка.Организация КАК Организация,
	//	|	ВременнаяТаблицаОплатаПоставщикам.СчетАвансов КАК СчетДт,
	//	|	ВременнаяТаблицаШапка.Касса.СчетУчета КАК СчетКт,
	//	|	ВременнаяТаблицаОплатаПоставщикам.Поставщик КАК СубконтоДт1,
	//	|	ВременнаяТаблицаОплатаПоставщикам.ДоговорКонтрагента КАК СубконтоДт2,
	//	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	//	|	ВременнаяТаблицаШапка.БанковскийСчет КАК СубконтоКт1,
	//	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	//	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	//	|	ВременнаяТаблицаОплатаПоставщикам.Сумма КАК Сумма,
	//	|	&ВалютаРегламентированногоУчета КАК ВалютаДт,
	//	|	&ВалютаРегламентированногоУчета КАК ВалютаКт,
	//	|	ВременнаяТаблицаОплатаПоставщикам.Сумма КАК ВалютнаяСуммаДт,
	//	|	0 КАК ВалютнаяСуммаКт,
	//	|	&ОплатаПоставщикамБезналичнаяОплата КАК Содержание
	//	|ИЗ
	//	|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаОплатаПоставщикам КАК ВременнаяТаблицаОплатаПоставщикам
	//	|		ПО (ИСТИНА)
	//	|ГДЕ
	//	|	НЕ ВременнаяТаблицаОплатаПоставщикам.Возврат И ВременнаяТаблицаОплатаПоставщикам.БезналичнаяОплата";
	//ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияБПСервер.ТекстОбъединитьВсе();
	//
	//// Оплата поставщикам безнал (возврат)
	//ТекстЗапроса = ТекстЗапроса +
	//	"ВЫБРАТЬ
	//	|	13 КАК Порядок,
	//	|	ВременнаяТаблицаШапка.Дата КАК Период,
	//	|	ВременнаяТаблицаШапка.Организация КАК Организация,
	//	|	ВременнаяТаблицаОплатаПоставщикам.СчетАвансов КАК СчетДт,
	//	|	ВременнаяТаблицаШапка.Касса.СчетУчета КАК СчетКт,
	//	|	ВременнаяТаблицаОплатаПоставщикам.Поставщик КАК СубконтоДт1,
	//	|	ВременнаяТаблицаОплатаПоставщикам.ДоговорКонтрагента КАК СубконтоДт2,
	//	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	//	|	ВременнаяТаблицаШапка.БанковскийСчет КАК СубконтоКт1,
	//	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	//	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	//	|	-ВременнаяТаблицаОплатаПоставщикам.Сумма КАК Сумма,
	//	|	&ВалютаРегламентированногоУчета КАК ВалютаДт,
	//	|	&ВалютаРегламентированногоУчета КАК ВалютаКт,
	//	|	-ВременнаяТаблицаОплатаПоставщикам.Сумма КАК ВалютнаяСуммаДт,
	//	|	0 КАК ВалютнаяСуммаКт,
	//	|	&ОплатаПоставщикамБезналичнаяОплатаВозврат КАК Содержание
	//	|ИЗ
	//	|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаОплатаПоставщикам КАК ВременнаяТаблицаОплатаПоставщикам
	//	|		ПО (ИСТИНА)
	//	|ГДЕ
	//	|	ВременнаяТаблицаОплатаПоставщикам.Возврат И ВременнаяТаблицаОплатаПоставщикам.БезналичнаяОплата";
	//ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияБПСервер.ТекстОбъединитьВсе();
	
	// Оплата поставщикам наличка
	ТекстЗапроса = ТекстЗапроса +
		"ВЫБРАТЬ
		|	14 КАК Порядок,
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаОплатаПоставщикам.СчетАвансов КАК СчетДт,
		|	ВременнаяТаблицаШапка.Касса.СчетУчета КАК СчетКт,
		|	ВременнаяТаблицаОплатаПоставщикам.Поставщик КАК СубконтоДт1,
		|	ВременнаяТаблицаОплатаПоставщикам.ДоговорКонтрагента КАК СубконтоДт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
		|	ВременнаяТаблицаШапка.Касса КАК СубконтоКт1,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
		|	ВременнаяТаблицаОплатаПоставщикам.Сумма КАК Сумма,
		|	&ВалютаРегламентированногоУчета КАК ВалютаДт,
		|	&ВалютаРегламентированногоУчета КАК ВалютаКт,
		|	ВременнаяТаблицаОплатаПоставщикам.Сумма КАК ВалютнаяСуммаДт,
		|	0 КАК ВалютнаяСуммаКт,
		|	&ОплатаПоставщикамНаличнаяОплата КАК Содержание
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаОплатаПоставщикам КАК ВременнаяТаблицаОплатаПоставщикам
		|		ПО (ИСТИНА)
		|ГДЕ
		|	НЕ ВременнаяТаблицаОплатаПоставщикам.Возврат И НЕ ВременнаяТаблицаОплатаПоставщикам.БезналичнаяОплата";
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияБПСервер.ТекстОбъединитьВсе();
	
	// Оплата поставщикам наличка (возврат)
	ТекстЗапроса = ТекстЗапроса +
		"ВЫБРАТЬ
		|	15 КАК Порядок,
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаОплатаПоставщикам.СчетАвансов КАК СчетДт,
		|	ВременнаяТаблицаШапка.Касса.СчетУчета КАК СчетКт,
		|	ВременнаяТаблицаОплатаПоставщикам.Поставщик КАК СубконтоДт1,
		|	ВременнаяТаблицаОплатаПоставщикам.ДоговорКонтрагента КАК СубконтоДт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
		|	ВременнаяТаблицаШапка.Касса КАК СубконтоКт1,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
		|	-ВременнаяТаблицаОплатаПоставщикам.Сумма КАК Сумма,
		|	&ВалютаРегламентированногоУчета КАК ВалютаДт,
		|	&ВалютаРегламентированногоУчета КАК ВалютаКт,
		|	-ВременнаяТаблицаОплатаПоставщикам.Сумма КАК ВалютнаяСуммаДт,
		|	0 КАК ВалютнаяСуммаКт,
		|	&ОплатаПоставщикамНаличнаяОплатаВозврат КАК Содержание
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаОплатаПоставщикам КАК ВременнаяТаблицаОплатаПоставщикам
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВременнаяТаблицаОплатаПоставщикам.Возврат И НЕ ВременнаяТаблицаОплатаПоставщикам.БезналичнаяОплата";
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияБПСервер.ТекстОбъединитьВсе();
	
	// Оплата от покупателей нал
	ТекстЗапроса = ТекстЗапроса +
		"ВЫБРАТЬ
		|	16 КАК Порядок,
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаШапка.Касса.СчетУчета КАК СчетДт,
		|	ВременнаяТаблицаОплатаОтПокупателей.СчетАвансов КАК СчетКт,
		|	ВременнаяТаблицаШапка.Касса КАК СубконтоДт1,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
		|	ВременнаяТаблицаОплатаОтПокупателей.Покупатель КАК СубконтоКт1,
		|	ВременнаяТаблицаОплатаОтПокупателей.ДоговорКонтрагента КАК СубконтоКт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
		|	ВременнаяТаблицаОплатаОтПокупателей.Сумма КАК Сумма,
		|	&ВалютаРегламентированногоУчета КАК ВалютаДт,
		|	&ВалютаРегламентированногоУчета КАК ВалютаКт,
		|	0 КАК ВалютнаяСуммаДт,
		|	ВременнаяТаблицаОплатаОтПокупателей.Сумма КАК ВалютнаяСуммаКт,
		|	&ОплатаОтПокупателейНаличнаяОплата КАК Содержание
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаОплатаОтПокупателей КАК ВременнаяТаблицаОплатаОтПокупателей
		|		ПО (ИСТИНА)
		|ГДЕ
		|	НЕ ВременнаяТаблицаОплатаОтПокупателей.Возврат И НЕ ВременнаяТаблицаОплатаОтПокупателей.БезналичнаяОплата";
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияБПСервер.ТекстОбъединитьВсе();
	
	// Оплата от покупателей нал (возврат)
	ТекстЗапроса = ТекстЗапроса +
		"ВЫБРАТЬ
		|	17 КАК Порядок,
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаШапка.Касса.СчетУчета КАК СчетДт,
		|	ВременнаяТаблицаОплатаОтПокупателей.СчетАвансов КАК СчетКт,
		|	ВременнаяТаблицаШапка.Касса КАК СубконтоДт1,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
		|	ВременнаяТаблицаОплатаОтПокупателей.Покупатель КАК СубконтоКт1,
		|	ВременнаяТаблицаОплатаОтПокупателей.ДоговорКонтрагента КАК СубконтоКт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
		|	-ВременнаяТаблицаОплатаОтПокупателей.Сумма КАК Сумма,
		|	&ВалютаРегламентированногоУчета КАК ВалютаДт,
		|	&ВалютаРегламентированногоУчета КАК ВалютаКт,
		|	0 КАК ВалютнаяСуммаДт,
		|	-ВременнаяТаблицаОплатаОтПокупателей.Сумма КАК ВалютнаяСуммаКт,
		|	&ОплатаОтПокупателейНаличнаяОплатаВозврат КАК Содержание
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаОплатаОтПокупателей КАК ВременнаяТаблицаОплатаОтПокупателей
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВременнаяТаблицаОплатаОтПокупателей.Возврат И НЕ ВременнаяТаблицаОплатаОтПокупателей.БезналичнаяОплата";
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияБПСервер.ТекстОбъединитьВсе();
	
	//// Оплата от покупателей безнал
	//ТекстЗапроса = ТекстЗапроса +
	//	"ВЫБРАТЬ
	//	|	18 КАК Порядок,
	//	|	ВременнаяТаблицаШапка.Дата КАК Период,
	//	|	ВременнаяТаблицаШапка.Организация КАК Организация,
	//	|	ВременнаяТаблицаШапка.Касса.СчетУчета КАК СчетДт,
	//	|	ВременнаяТаблицаОплатаОтПокупателей.СчетАвансов КАК СчетКт,
	//	|	ВременнаяТаблицаШапка.БанковскийСчет КАК СубконтоДт1,
	//	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	//	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	//	|	ВременнаяТаблицаОплатаОтПокупателей.Покупатель КАК СубконтоКт1,
	//	|	ВременнаяТаблицаОплатаОтПокупателей.ДоговорКонтрагента КАК СубконтоКт2,
	//	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	//	|	ВременнаяТаблицаОплатаОтПокупателей.Сумма КАК Сумма,
	//	|	&ВалютаРегламентированногоУчета КАК ВалютаДт,
	//	|	&ВалютаРегламентированногоУчета КАК ВалютаКт,
	//	|	0 КАК ВалютнаяСуммаДт,
	//	|	ВременнаяТаблицаОплатаОтПокупателей.Сумма КАК ВалютнаяСуммаКт,
	//	|	&ОплатаОтПокупателейБезналичнаяОплата КАК Содержание
	//	|ИЗ
	//	|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаОплатаОтПокупателей КАК ВременнаяТаблицаОплатаОтПокупателей
	//	|		ПО (ИСТИНА)
	//	|ГДЕ
	//	|	НЕ ВременнаяТаблицаОплатаОтПокупателей.Возврат И ВременнаяТаблицаОплатаОтПокупателей.БезналичнаяОплата";
	//ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияБПСервер.ТекстОбъединитьВсе();
	//
	//// Оплата от покупателей безнал (возврат)
	//ТекстЗапроса = ТекстЗапроса +
	//	"ВЫБРАТЬ
	//	|	19 КАК Порядок,
	//	|	ВременнаяТаблицаШапка.Дата КАК Период,
	//	|	ВременнаяТаблицаШапка.Организация КАК Организация,
	//	|	ВременнаяТаблицаШапка.Касса.СчетУчета КАК СчетДт,
	//	|	ВременнаяТаблицаОплатаОтПокупателей.СчетАвансов КАК СчетКт,
	//	|	ВременнаяТаблицаШапка.БанковскийСчет КАК СубконтоДт1,
	//	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	//	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	//	|	ВременнаяТаблицаОплатаОтПокупателей.Покупатель КАК СубконтоКт1,
	//	|	ВременнаяТаблицаОплатаОтПокупателей.ДоговорКонтрагента КАК СубконтоКт2,
	//	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	//	|	-ВременнаяТаблицаОплатаОтПокупателей.Сумма КАК Сумма,
	//	|	&ВалютаРегламентированногоУчета КАК ВалютаДт,
	//	|	&ВалютаРегламентированногоУчета КАК ВалютаКт,
	//	|	0 КАК ВалютнаяСуммаДт,
	//	|	-ВременнаяТаблицаОплатаОтПокупателей.Сумма КАК ВалютнаяСуммаКт,
	//	|	&ОплатаОтПокупателейБезналичнаяОплатаВозврат КАК Содержание
	//	|ИЗ
	//	|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаОплатаОтПокупателей КАК ВременнаяТаблицаОплатаОтПокупателей
	//	|		ПО (ИСТИНА)
	//	|ГДЕ
	//	|	ВременнаяТаблицаОплатаОтПокупателей.Возврат И ВременнаяТаблицаОплатаОтПокупателей.БезналичнаяОплата";
	//ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияБПСервер.ТекстОбъединитьВсе();
	
	// Реализация
	ТекстЗапроса = ТекстЗапроса +
		"ВЫБРАТЬ
		|	20 КАК Порядок,
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаРеализация.СчетРасчетов КАК СчетДт,
		|	ВременнаяТаблицаШапка.СчетУчетаДоходаТоваров КАК СчетКт,
		|	ВременнаяТаблицаРеализация.Покупатель КАК СубконтоДт1,
		|	ВременнаяТаблицаРеализация.ДоговорКонтрагента КАК СубконтоДт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
		|	ВременнаяТаблицаШапка.Номенклатура КАК СубконтоКт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
		|	ВременнаяТаблицаРеализация.Сумма - ВременнаяТаблицаРеализация.СуммаНДС - ВременнаяТаблицаРеализация.СуммаНСП КАК Сумма,
		|	&ВалютаРегламентированногоУчета КАК ВалютаДт,
		|	&ВалютаРегламентированногоУчета КАК ВалютаКт,
		|	ВременнаяТаблицаРеализация.Сумма КАК ВалютнаяСуммаДт,
		|	0 КАК ВалютнаяСуммаКт,
		|	&ОптоваяРеализацияТоваров КАК Содержание
		|ИЗ
		|	ВременнаяТаблицаРеализация КАК ВременнаяТаблицаРеализация
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|ГДЕ
		|	НЕ ВременнаяТаблицаРеализация.Возврат";
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияБПСервер.ТекстОбъединитьВсе();
	
	// Реализация (возврат)
	ТекстЗапроса = ТекстЗапроса +
		"ВЫБРАТЬ
		|	21 КАК Порядок,
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаРеализация.СчетРасчетов КАК СчетДт,
		|	ВременнаяТаблицаШапка.СчетУчетаДоходаТоваров КАК СчетКт,
		|	ВременнаяТаблицаРеализация.Покупатель КАК СубконтоДт1,
		|	ВременнаяТаблицаРеализация.ДоговорКонтрагента КАК СубконтоДт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
		|	ВременнаяТаблицаШапка.Номенклатура КАК СубконтоКт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
		|	-(ВременнаяТаблицаРеализация.Сумма - ВременнаяТаблицаРеализация.СуммаНДС - ВременнаяТаблицаРеализация.СуммаНСП) КАК Сумма,
		|	&ВалютаРегламентированногоУчета КАК ВалютаДт,
		|	&ВалютаРегламентированногоУчета КАК ВалютаКт,
		|	-ВременнаяТаблицаРеализация.Сумма КАК ВалютнаяСуммаДт,
		|	0 КАК ВалютнаяСуммаКт,
		|	&ОптоваяРеализацияТоваровВозврат КАК Содержание
		|ИЗ
		|	ВременнаяТаблицаРеализация КАК ВременнаяТаблицаРеализация
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВременнаяТаблицаРеализация.Возврат";
		
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияБПСервер.ТекстОбъединитьВсе();
	
	// Реализация себестоимость
	ТекстЗапроса = ТекстЗапроса +
		"ВЫБРАТЬ
		|	22 КАК Порядок,
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаШапка.СчетУчетаРасходаТоваров КАК СчетДт,
		|	ВременнаяТаблицаШапка.СчетУчетаТоваров КАК СчетКт,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДт1,
		|	ВременнаяТаблицаШапка.Номенклатура КАК СубконтоДт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
		|	ВременнаяТаблицаШапка.Номенклатура КАК СубконтоКт1,
		|	ВременнаяТаблицаШапка.Склад КАК СубконтоКт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
		|	ВременнаяТаблицаРеализация.Себестоимость КАК Сумма,
		|	&ВалютаРегламентированногоУчета КАК ВалютаДт,
		|	&ВалютаРегламентированногоУчета КАК ВалютаКт,
		|	0 КАК ВалютнаяСуммаДт,
		|	0 КАК ВалютнаяСуммаКт,
		|	&ОптоваяРеализацияТоваровСебестоимость КАК Содержание
		|ИЗ
		|	ВременнаяТаблицаРеализация КАК ВременнаяТаблицаРеализация
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|ГДЕ
		|	НЕ ВременнаяТаблицаРеализация.Возврат";
		
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияБПСервер.ТекстОбъединитьВсе();
	
	// Реализация себестоимость возврат
	ТекстЗапроса = ТекстЗапроса +
		"ВЫБРАТЬ
		|	23 КАК Порядок,
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаШапка.СчетУчетаРасходаТоваров КАК СчетДт,
		|	ВременнаяТаблицаШапка.СчетУчетаТоваров КАК СчетКт,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДт1,
		|	ВременнаяТаблицаШапка.Номенклатура КАК СубконтоДт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
		|	ВременнаяТаблицаШапка.Номенклатура КАК СубконтоКт1,
		|	ВременнаяТаблицаШапка.Склад КАК СубконтоКт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
		|	-ВременнаяТаблицаРеализация.Себестоимость КАК Сумма,
		|	&ВалютаРегламентированногоУчета КАК ВалютаДт,
		|	&ВалютаРегламентированногоУчета КАК ВалютаКт,
		|	0 КАК ВалютнаяСуммаДт,
		|	0 КАК ВалютнаяСуммаКт,
		|	&ОптоваяРеализацияТоваровСебестоимостьВозврат КАК Содержание
		|ИЗ
		|	ВременнаяТаблицаРеализация КАК ВременнаяТаблицаРеализация
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВременнаяТаблицаРеализация.Возврат";
		
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияБПСервер.ТекстОбъединитьВсе();
	
	// Закомментировано 14.08.19 на время разбирательства
	//// Реализация доход
	//ТекстЗапроса = ТекстЗапроса +
	//	"ВЫБРАТЬ
	//	|	24 КАК Порядок,
	//	|	ВременнаяТаблицаШапка.Дата КАК Период,
	//	|	ВременнаяТаблицаШапка.Организация КАК Организация,
	//	|	ВременнаяТаблицаШапка.СчетУчетаРасходаТоваров КАК СчетДт,
	//	|	Значение(ПланСчетов.Хозрасчетный.ВыручкаОтРеализацииТоваровИУслуг) КАК СчетКт,
	//	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт1,
	//	|	ВременнаяТаблицаШапка.Номенклатура КАК СубконтоДт2,
	//	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	//	|	ВременнаяТаблицаШапка.Номенклатура КАК СубконтоКт1,
	//	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	//	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	//	|	ВременнаяТаблицаРеализация.Себестоимость КАК Сумма,
	//	|	&ВалютаРегламентированногоУчета КАК ВалютаДт,
	//	|	&ВалютаРегламентированногоУчета КАК ВалютаКт,
	//	|	0 КАК ВалютнаяСуммаДт,
	//	|	0 КАК ВалютнаяСуммаКт,
	//	|	&ОптоваяРеализацияТоваровДоход КАК Содержание
	//	|ИЗ
	//	|	ВременнаяТаблицаРеализация КАК ВременнаяТаблицаРеализация
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
	//	|		ПО (ИСТИНА)
	//	|ГДЕ
	//	|	НЕ ВременнаяТаблицаРеализация.Возврат";
	//	
	//ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияБПСервер.ТекстОбъединитьВсе();
	//
	//// Реализация доход возврат
	//ТекстЗапроса = ТекстЗапроса +
	//	"ВЫБРАТЬ
	//	|	25 КАК Порядок,
	//	|	ВременнаяТаблицаШапка.Дата КАК Период,
	//	|	ВременнаяТаблицаШапка.Организация КАК Организация,
	//	|	ВременнаяТаблицаШапка.СчетУчетаРасходаТоваров КАК СчетДт,
	//	|	Значение(ПланСчетов.Хозрасчетный.ВыручкаОтРеализацииТоваровИУслуг) КАК СчетКт,
	//	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт1,
	//	|	ВременнаяТаблицаШапка.Номенклатура КАК СубконтоДт2,
	//	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	//	|	ВременнаяТаблицаШапка.Номенклатура КАК СубконтоКт1,
	//	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	//	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	//	|	-ВременнаяТаблицаРеализация.Себестоимость КАК Сумма,
	//	|	&ВалютаРегламентированногоУчета КАК ВалютаДт,
	//	|	&ВалютаРегламентированногоУчета КАК ВалютаКт,
	//	|	0 КАК ВалютнаяСуммаДт,
	//	|	0 КАК ВалютнаяСуммаКт,
	//	|	&ОптоваяРеализацияТоваровДоходВозврат КАК Содержание
	//	|ИЗ
	//	|	ВременнаяТаблицаРеализация КАК ВременнаяТаблицаРеализация
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
	//	|		ПО (ИСТИНА)
	//	|ГДЕ
	//	|	ВременнаяТаблицаРеализация.Возврат";
	//	
	//ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияБПСервер.ТекстОбъединитьВсе();
	
	// НДС Реализация
	ТекстЗапроса = ТекстЗапроса +
		"ВЫБРАТЬ
		|	26 КАК Порядок,
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаРеализация.СчетРасчетов КАК СчетДт,
		|	Значение(ПланСчетов.Хозрасчетный.НДСКОплате) КАК СчетКт,
		|	ВременнаяТаблицаРеализация.Покупатель КАК СубконтоДт1,
		|	ВременнаяТаблицаРеализация.ДоговорКонтрагента КАК СубконтоДт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
		|	ВременнаяТаблицаРеализация.СуммаНДС КАК Сумма,
		|	&ВалютаРегламентированногоУчета КАК ВалютаДт,
		|	&ВалютаРегламентированногоУчета КАК ВалютаКт,
		|	ВременнаяТаблицаРеализация.СуммаНДС КАК ВалютнаяСуммаДт,
		|	0 КАК ВалютнаяСуммаКт,
		|	&ОптоваяРеализацияТоваровСуммаНДС КАК Содержание
		|ИЗ
		|	ВременнаяТаблицаРеализация КАК ВременнаяТаблицаРеализация
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|ГДЕ
		|	НЕ ВременнаяТаблицаРеализация.Возврат И ВременнаяТаблицаРеализация.СуммаНДС <> 0";
	
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияБПСервер.ТекстОбъединитьВсе();
	
	// НСП Реализация
	ТекстЗапроса = ТекстЗапроса +
		"ВЫБРАТЬ
		|	27 КАК Порядок,
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаРеализация.СчетРасчетов КАК СчетДт,
		|	Значение(ПланСчетов.Хозрасчетный.НалогСПродаж) КАК СчетКт,
		|	ВременнаяТаблицаРеализация.Покупатель КАК СубконтоДт1,
		|	ВременнаяТаблицаРеализация.ДоговорКонтрагента КАК СубконтоДт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
		|	ВременнаяТаблицаРеализация.СуммаНСП КАК Сумма,
		|	&ВалютаРегламентированногоУчета КАК ВалютаДт,
		|	&ВалютаРегламентированногоУчета КАК ВалютаКт,
		|	ВременнаяТаблицаРеализация.СуммаНСП КАК ВалютнаяСуммаДт,
		|	0 КАК ВалютнаяСуммаКт,
		|	&ОптоваяРеализацияТоваровСуммаНСП КАК Содержание
		|ИЗ
		|	ВременнаяТаблицаРеализация КАК ВременнаяТаблицаРеализация
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|ГДЕ
		|	НЕ ВременнаяТаблицаРеализация.Возврат И ВременнаяТаблицаРеализация.СуммаНСП <> 0";
	
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияБПСервер.ТекстОбъединитьВсе();
	
	// НДС Реализация (возврат)
	ТекстЗапроса = ТекстЗапроса +
		"ВЫБРАТЬ
		|	28 КАК Порядок,
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаРеализация.СчетРасчетов КАК СчетДт,
		|	Значение(ПланСчетов.Хозрасчетный.НДСКОплате) КАК СчетКт,
		|	ВременнаяТаблицаРеализация.Покупатель КАК СубконтоДт1,
		|	ВременнаяТаблицаРеализация.ДоговорКонтрагента КАК СубконтоДт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
		|	-ВременнаяТаблицаРеализация.СуммаНДС КАК Сумма,
		|	&ВалютаРегламентированногоУчета КАК ВалютаДт,
		|	&ВалютаРегламентированногоУчета КАК ВалютаКт,
		|	-ВременнаяТаблицаРеализация.СуммаНДС КАК ВалютнаяСуммаДт,
		|	0 КАК ВалютнаяСуммаКт,
		|	&ОптоваяРеализацияТоваровСуммаНДСВозврат КАК Содержание
		|ИЗ
		|	ВременнаяТаблицаРеализация КАК ВременнаяТаблицаРеализация
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВременнаяТаблицаРеализация.Возврат И ВременнаяТаблицаРеализация.СуммаНДС <> 0";
	
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияБПСервер.ТекстОбъединитьВсе();
	
	// НСП Реализация (возврат)
	ТекстЗапроса = ТекстЗапроса +
		"ВЫБРАТЬ
		|	29 КАК Порядок,
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаРеализация.СчетРасчетов КАК СчетДт,
		|	Значение(ПланСчетов.Хозрасчетный.НалогСПродаж) КАК СчетКт,
		|	ВременнаяТаблицаРеализация.Покупатель КАК СубконтоДт1,
		|	ВременнаяТаблицаРеализация.ДоговорКонтрагента КАК СубконтоДт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
		|	-ВременнаяТаблицаРеализация.СуммаНСП КАК Сумма,
		|	&ВалютаРегламентированногоУчета КАК ВалютаДт,
		|	&ВалютаРегламентированногоУчета КАК ВалютаКт,
		|	-ВременнаяТаблицаРеализация.СуммаНСП КАК ВалютнаяСуммаДт,
		|	0 КАК ВалютнаяСуммаКт,
		|	&ОптоваяРеализацияТоваровСуммаНСПВозврат КАК Содержание
		|ИЗ
		|	ВременнаяТаблицаРеализация КАК ВременнаяТаблицаРеализация
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВременнаяТаблицаРеализация.Возврат И ВременнаяТаблицаРеализация.СуммаНСП <> 0";
	
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("РозничнаяОплатаНаличными", 						НСтр("ru = 'Розница наличные доход'"));
	Запрос.УстановитьПараметр("РозничнаяОплатаНаличнымиСуммаНДС", 				НСтр("ru = 'Розница наличные НДС'"));
	Запрос.УстановитьПараметр("РозничнаяОплатаНаличнымиСуммаНСП", 				НСтр("ru = 'Розница наличные НСП'"));
	Запрос.УстановитьПараметр("РозничнаяОплатаКартами", 						НСтр("ru = 'Розница по картам доход'"));
	Запрос.УстановитьПараметр("РозничнаяОплатаКартамиСуммаНДС", 				НСтр("ru = 'Розница по картам НДС'"));
	Запрос.УстановитьПараметр("СебестоимостьРозничныхПродаж", 					НСтр("ru = 'Розница себестоимость'"));
	Запрос.УстановитьПараметр("ПриходВКассуРозничныхПродаж", 					НСтр("ru = 'Розница оплата'"));
	
	Запрос.УстановитьПараметр("ОптовыеПоступленияТоваров", 						НСтр("ru = 'Поступление себестоимости'"));
	Запрос.УстановитьПараметр("ОптовыеПоступленияТоваровВозврат", 				НСтр("ru = 'Возврат поставщику себестоимости'"));
	Запрос.УстановитьПараметр("ОптовыеПоступленияТоваровСуммаНДС", 				НСтр("ru = 'Поступление НДС'"));
	Запрос.УстановитьПараметр("ОптовыеПоступленияТоваровСуммаНДСВозврат", 		НСтр("ru = 'Возврат поставщику НДС'"));
	
	//Запрос.УстановитьПараметр("ОплатаПоставщикамБезналичнаяОплата", 			НСтр("ru = 'Оплата поставщикам - безналичная оплата'"));
	//Запрос.УстановитьПараметр("ОплатаПоставщикамБезналичнаяОплатаВозврат", 		НСтр("ru = 'Оплата поставщикам - безналичная оплата (возврат)'"));
	Запрос.УстановитьПараметр("ОплатаПоставщикамНаличнаяОплата", 				НСтр("ru = 'Оплата поставщику'"));
	Запрос.УстановитьПараметр("ОплатаПоставщикамНаличнаяОплатаВозврат", 		НСтр("ru = 'Оплата поставщику - возврат'"));
	
	Запрос.УстановитьПараметр("ОплатаОтПокупателейНаличнаяОплата", 				НСтр("ru = 'Оплата от покупателей'"));
	Запрос.УстановитьПараметр("ОплатаОтПокупателейНаличнаяОплатаВозврат", 		НСтр("ru = 'Оплата от покупателей - возврат'"));
	//Запрос.УстановитьПараметр("ОплатаОтПокупателейБезналичнаяОплата", 			НСтр("ru = 'Оплата от покупателей - безналичная оплата'"));
	//Запрос.УстановитьПараметр("ОплатаОтПокупателейБезналичнаяОплатаВозврат", 	НСтр("ru = 'Оплата от покупателей - безналичная оплата (возврат)'"));
	
	Запрос.УстановитьПараметр("ОптоваяРеализацияТоваров", 						НСтр("ru = 'Реализация оптовый Доход'"));
	Запрос.УстановитьПараметр("ОптоваяРеализацияТоваровВозврат", 				НСтр("ru = 'Возврат Реализации оптовый Доход'"));
	Запрос.УстановитьПараметр("ОптоваяРеализацияТоваровСебестоимость", 			НСтр("ru = 'Реализация оптовой себестоимости'"));
	Запрос.УстановитьПараметр("ОптоваяРеализацияТоваровСебестоимостьВозврат", 	НСтр("ru = 'Возврат реализации оптовой себестоимости'"));
	//Запрос.УстановитьПараметр("ОптоваяРеализацияТоваровДоход", 					НСтр("ru = 'Оптовая реализация товаров'"));
	//Запрос.УстановитьПараметр("ОптоваяРеализацияТоваровДоходВозврат", 			НСтр("ru = 'Оптовая реализация товаров (возврат)'"));
	Запрос.УстановитьПараметр("ОптоваяРеализацияТоваровСуммаНДС", 				НСтр("ru = 'Реализация оптовой НДС'"));
	Запрос.УстановитьПараметр("ОптоваяРеализацияТоваровСуммаНСП", 				НСтр("ru = 'Реализация оптовой НСП'"));
	Запрос.УстановитьПараметр("ОптоваяРеализацияТоваровСуммаНДСВозврат", 		НСтр("ru = 'Возврат реализации оптовой НДС'"));
	Запрос.УстановитьПараметр("ОптоваяРеализацияТоваровСуммаНСПВозврат", 		НСтр("ru = 'Возврат реализации оптовой НСП'"));
	
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета());

	РезультатЗапроса = Запрос.Выполнить();	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаХозрасчетный", РезультатЗапроса.Выгрузить());	
	
КонецПроцедуры // СформироватьТаблицаХозрасчетный()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаПоступлениеТоваров(ДокументСсылка, СтруктураДополнительныеСвойства) 
	                   
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаПоступления.Поставщик КАК Контрагент,
		|	ВременнаяТаблицаПоступления.ДоговорКонтрагента КАК Договор,
		|	ВременнаяТаблицаШапка.Номенклатура КАК Номенклатура,
		|	ЛОЖЬ КАК БезналичныйРасчет,
		|	12 КАК ЗначениеСтавкиНДС,
		|	2 КАК ЗначениеСтавкиНСП,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаПоступления.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ИмпортЭкспорт)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.ПустаяСсылка)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Зачет)
		|	КОНЕЦ КАК ЗачетНДС,
		|	ВременнаяТаблицаПоступления.Сумма КАК Сумма,
		|	ВременнаяТаблицаПоступления.СуммаНДС КАК СуммаНДС,
		|	ВременнаяТаблицаПоступления.СуммаНСП КАК СуммаНСП,
		|	1 КАК Количество
		|ИЗ
		|	ВременнаяТаблицаПоступления КАК ВременнаяТаблицаПоступления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|ГДЕ
		|	НЕ ВременнаяТаблицаПоступления.Возврат
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаПоступления.Поставщик,
		|	ВременнаяТаблицаПоступления.ДоговорКонтрагента,
		|	ВременнаяТаблицаШапка.Номенклатура,
		|	ЛОЖЬ,
		|	12,
		|	2,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаПоступления.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ИмпортЭкспорт)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.ПустаяСсылка)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Зачет)
		|	КОНЕЦ,
		|	-ВременнаяТаблицаПоступления.Сумма,
		|	-ВременнаяТаблицаПоступления.СуммаНДС,
		|	-ВременнаяТаблицаПоступления.СуммаНСП,
		|	-1
		|ИЗ
		|	ВременнаяТаблицаПоступления КАК ВременнаяТаблицаПоступления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВременнаяТаблицаПоступления.Возврат";
	Запрос.УстановитьПараметр("УказыватьПризнакЗачетаНДС", СтруктураДополнительныеСвойства.УчетнаяПолитика.УказыватьПризнакЗачетаНДСПриПоступлении);
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПоступлениеТоваров", РезультатЗапроса.Выгрузить());
		
КонецПроцедуры 

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаСведенияОПоступлении(ДокументСсылка, СтруктураДополнительныеСвойства) 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаШапка.Ссылка КАК ДокументСсылка,
		|	ВременнаяТаблицаШапка.Дата КАК Дата,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеТоваровУслуг.Покупка) КАК ВидОперации,
		|	ВременнаяТаблицаПоступления.СерияБланкаСФ КАК СерияБланкаСФ,
		|	ВременнаяТаблицаПоступления.НомерБланкаСФ КАК НомерБланкаСФ,
		|	ВременнаяТаблицаПоступления.Дата КАК ДатаСФ,
		|	ВременнаяТаблицаПоступления.НомерСтроки КАК НомерСтрокиДокументаСвод,
		|	ВременнаяТаблицаПоступления.Поставщик КАК Контрагент,
		|	ВременнаяТаблицаПоступления.ПризнакСтраны КАК ПризнакСтраны,
		|	ВременнаяТаблицаПоступления.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ВременнаяТаблицаПоступления.Дата КАК ДатаПоставки,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Зачет) КАК ЗачетНДС,
		|	ВременнаяТаблицаПоступления.Сумма - ВременнаяТаблицаПоступления.СуммаНДС - ВременнаяТаблицаПоступления.СуммаНСП КАК Сумма,
		|	ВременнаяТаблицаПоступления.СуммаНДС КАК СуммаНДС,
		|	ВременнаяТаблицаПоступления.СуммаНСП КАК СуммаНСП,
		|	ЛОЖЬ КАК НДСНеПодтвержден
		|ПОМЕСТИТЬ ВременнаяТаблицаСтроки
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаПоступления КАК ВременнаяТаблицаПоступления
		|		ПО (ИСТИНА)
		|ГДЕ
		|	НЕ ВременнаяТаблицаПоступления.Возврат
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаШапка.Ссылка КАК ДокументСсылка,
		|	ВременнаяТаблицаШапка.Дата КАК Дата,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеТоваровУслуг.Покупка) КАК ВидОперации,
		|	ВременнаяТаблицаПоступления.СерияБланкаСФ КАК СерияБланкаСФ,
		|	ВременнаяТаблицаПоступления.НомерБланкаСФ КАК НомерБланкаСФ,
		|	ВременнаяТаблицаПоступления.Дата КАК ДатаСФ,
		|	ВременнаяТаблицаПоступления.НомерСтроки КАК НомерСтрокиДокументаСвод,
		|	ВременнаяТаблицаПоступления.Поставщик КАК Контрагент,
		|	ВременнаяТаблицаПоступления.ПризнакСтраны КАК ПризнакСтраны,
		|	ВременнаяТаблицаПоступления.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ВременнаяТаблицаПоступления.Дата КАК ДатаПоставки,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Зачет) КАК ЗачетНДС,
		|	ВременнаяТаблицаПоступления.Сумма - ВременнаяТаблицаПоступления.СуммаНДС - ВременнаяТаблицаПоступления.СуммаНСП КАК Сумма,
		|	ВременнаяТаблицаПоступления.СуммаНДС КАК СуммаНДС,
		|	ВременнаяТаблицаПоступления.СуммаНСП КАК СуммаНСП,
		|	ЛОЖЬ КАК НДСНеПодтвержден
		|ПОМЕСТИТЬ ВременнаяТаблицаСтрокиВозврат
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаПоступления КАК ВременнаяТаблицаПоступления
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВременнаяТаблицаПоступления.Возврат
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаСтроки.Организация КАК Организация,
		|	ВременнаяТаблицаСтроки.ДокументСсылка КАК ДокументСсылка,
		|	ВременнаяТаблицаСтроки.СерияБланкаСФ КАК СерияБланкаСФ,
		|	ВременнаяТаблицаСтроки.НомерБланкаСФ КАК НомерБланкаСФ,
		|	ВременнаяТаблицаСтроки.ДатаСФ КАК ДатаСФ,
		|	ВременнаяТаблицаСтроки.НомерСтрокиДокументаСвод КАК НомерСтрокиДокументаСвод,
		|	ВременнаяТаблицаСтроки.Контрагент КАК Контрагент,
		|	ВременнаяТаблицаСтроки.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ВременнаяТаблицаСтроки.ДатаПоставки КАК ДатаПоставки,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Зачет) КАК ЗачетНДС,
		|	СУММА(ВЫБОР
		|			КОГДА ВременнаяТаблицаСтроки.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ИмпортЭкспорт)
		|				ТОГДА 0
		|			ИНАЧЕ ВременнаяТаблицаСтроки.Сумма
		|		КОНЕЦ) КАК Сумма,
		|	СУММА(ВЫБОР
		|			КОГДА ВременнаяТаблицаСтроки.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ИмпортЭкспорт)
		|				ТОГДА 0
		|			ИНАЧЕ ВременнаяТаблицаСтроки.СуммаНДС
		|		КОНЕЦ) КАК СуммаНДС,
		|	СУММА(ВЫБОР
		|			КОГДА ВременнаяТаблицаСтроки.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ИмпортЭкспорт)
		|				ТОГДА 0
		|			ИНАЧЕ ВременнаяТаблицаСтроки.СуммаНСП
		|		КОНЕЦ) КАК СуммаНСП,
		|	ЛОЖЬ КАК НДСНеПодтвержден
		|ИЗ
		|	ВременнаяТаблицаСтроки КАК ВременнаяТаблицаСтроки
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ВременнаяТаблицаСтроки.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ИмпортЭкспорт)
		|					ИЛИ ВременнаяТаблицаСтроки.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ВременнаяТаблицаСтроки.СерияБланкаСФ <> """"
		|		КОНЕЦ
		|	И (ВременнаяТаблицаСтроки.Сумма <> 0
		|			ИЛИ ВременнаяТаблицаСтроки.СуммаНДС <> 0
		|			ИЛИ ВременнаяТаблицаСтроки.СуммаНСП <> 0)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаСтроки.ДокументСсылка,
		|	ВременнаяТаблицаСтроки.Организация,
		|	ВременнаяТаблицаСтроки.ДатаПоставки,
		|	ВременнаяТаблицаСтроки.Дата,
		|	ВременнаяТаблицаСтроки.ДатаСФ,
		|	ВременнаяТаблицаСтроки.НомерСтрокиДокументаСвод,
		|	ВременнаяТаблицаСтроки.СерияБланкаСФ,
		|	ВременнаяТаблицаСтроки.НомерБланкаСФ,
		|	ВременнаяТаблицаСтроки.Контрагент,
		|	ВременнаяТаблицаСтроки.ДоговорКонтрагента,
		|	ВременнаяТаблицаСтроки.НДСНеПодтвержден
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаСтроки.Организация,
		|	ВременнаяТаблицаСтроки.ДокументСсылка,
		|	ВременнаяТаблицаСтроки.СерияБланкаСФ,
		|	ВременнаяТаблицаСтроки.НомерБланкаСФ,
		|	ВременнаяТаблицаСтроки.ДатаСФ,
		|	ВременнаяТаблицаСтроки.НомерСтрокиДокументаСвод,
		|	ВременнаяТаблицаСтроки.Контрагент,
		|	ВременнаяТаблицаСтроки.ДоговорКонтрагента,
		|	ВременнаяТаблицаСтроки.ДатаПоставки,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Зачет),
		|	-СУММА(ВЫБОР
		|			КОГДА ВременнаяТаблицаСтроки.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ИмпортЭкспорт)
		|				ТОГДА 0
		|			ИНАЧЕ ВременнаяТаблицаСтроки.Сумма
		|		КОНЕЦ),
		|	-СУММА(ВЫБОР
		|			КОГДА ВременнаяТаблицаСтроки.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ИмпортЭкспорт)
		|				ТОГДА 0
		|			ИНАЧЕ ВременнаяТаблицаСтроки.СуммаНДС
		|		КОНЕЦ),
		|	-СУММА(ВЫБОР
		|			КОГДА ВременнаяТаблицаСтроки.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ИмпортЭкспорт)
		|				ТОГДА 0
		|			ИНАЧЕ ВременнаяТаблицаСтроки.СуммаНСП
		|		КОНЕЦ),
		|	ЛОЖЬ
		|ИЗ
		|	ВременнаяТаблицаСтрокиВозврат КАК ВременнаяТаблицаСтроки
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ВременнаяТаблицаСтроки.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ИмпортЭкспорт)
		|					ИЛИ ВременнаяТаблицаСтроки.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ВременнаяТаблицаСтроки.СерияБланкаСФ <> """"
		|		КОНЕЦ
		|	И (ВременнаяТаблицаСтроки.Сумма <> 0
		|			ИЛИ ВременнаяТаблицаСтроки.СуммаНДС <> 0
		|			ИЛИ ВременнаяТаблицаСтроки.СуммаНСП <> 0)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаСтроки.ДокументСсылка,
		|	ВременнаяТаблицаСтроки.Организация,
		|	ВременнаяТаблицаСтроки.ДатаПоставки,
		|	ВременнаяТаблицаСтроки.Дата,
		|	ВременнаяТаблицаСтроки.ДатаСФ,
		|	ВременнаяТаблицаСтроки.НомерСтрокиДокументаСвод,
		|	ВременнаяТаблицаСтроки.СерияБланкаСФ,
		|	ВременнаяТаблицаСтроки.НомерБланкаСФ,
		|	ВременнаяТаблицаСтроки.Контрагент,
		|	ВременнаяТаблицаСтроки.ДоговорКонтрагента,
		|	ВременнаяТаблицаСтроки.НДСНеПодтвержден";
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСведенияОПоступлении", РезультатЗапроса.Выгрузить());
		
КонецПроцедуры 

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРеестрВвезенных(ДокументСсылка, СтруктураДополнительныеСвойства) 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаПоступления.Дата КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаШапка.Номер КАК Номер,
		|	ВременнаяТаблицаПоступления.Дата КАК ДатаСФ,
		|	ВременнаяТаблицаПоступления.Поставщик КАК Контрагент,
		|	ВременнаяТаблицаПоступления.СуммаНДС КАК СуммаНДС,
		|	ВременнаяТаблицаПоступления.Сумма КАК Сумма,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Зачет) КАК ЗачетНДС
		|ИЗ
		|	ВременнаяТаблицаПоступления КАК ВременнаяТаблицаПоступления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВременнаяТаблицаПоступления.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|	И ВременнаяТаблицаПоступления.СуммаНДС <> 0
		|	И НЕ ВременнаяТаблицаПоступления.Возврат
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаПоступления.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаШапка.Номер,
		|	ВременнаяТаблицаПоступления.Дата,
		|	ВременнаяТаблицаПоступления.Поставщик,
		|	-ВременнаяТаблицаПоступления.СуммаНДС,
		|	-ВременнаяТаблицаПоступления.Сумма,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Зачет)
		|ИЗ
		|	ВременнаяТаблицаПоступления КАК ВременнаяТаблицаПоступления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВременнаяТаблицаПоступления.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|	И ВременнаяТаблицаПоступления.СуммаНДС <> 0
		|	И ВременнаяТаблицаПоступления.Возврат";
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРеестрВвезенных", Запрос.Выполнить().Выгрузить());		
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРеестрЗакупок(ДокументСсылка, СтруктураДополнительныеСвойства) 
	                   
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаПоступления.Дата КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаПоступления.Поставщик КАК Контрагент,
		|	ВременнаяТаблицаШапка.Номенклатура КАК Номенклатура,
		|	12 КАК ЗначениеСтавкиНДС,
		|	2 КАК ЗначениеСтавкиНСП,
		|	ВременнаяТаблицаПоступления.Сумма КАК Сумма,
		|	ВременнаяТаблицаПоступления.СуммаНДС КАК СуммаНДС,
		|	ВременнаяТаблицаПоступления.СуммаНСП КАК СуммаНСП,
		|	1 КАК Количество
		|ИЗ
		|	ВременнаяТаблицаПоступления КАК ВременнаяТаблицаПоступления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВременнаяТаблицаПоступления.ПризнакСтраны <> ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ИмпортЭкспорт)
		|	И НЕ ВременнаяТаблицаПоступления.Возврат
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаПоступления.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаПоступления.Поставщик,
		|	ВременнаяТаблицаШапка.Номенклатура,
		|	12,
		|	2,
		|	-ВременнаяТаблицаПоступления.Сумма,
		|	-ВременнаяТаблицаПоступления.СуммаНДС,
		|	-ВременнаяТаблицаПоступления.СуммаНСП,
		|	-1
		|ИЗ
		|	ВременнаяТаблицаПоступления КАК ВременнаяТаблицаПоступления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВременнаяТаблицаПоступления.ПризнакСтраны <> ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ИмпортЭкспорт)
		|	И ВременнаяТаблицаПоступления.Возврат";
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРеестрЗакупок", РезультатЗапроса.Выгрузить());
		
КонецПроцедуры 

// Формирует таблицу значений, содержащую данные для проведения по регистру бухгалтерии Хозрасчетный.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаПродажи(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	// 1. Товары
	// 2. Услуги
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	1 КАК Порядок,
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаШапка.Ссылка КАК ДокументРеализации,
		|	ВременнаяТаблицаШапка.Склад КАК Склад,
		|	ВременнаяТаблицаРеализация.Покупатель КАК Контрагент,
		|	ВременнаяТаблицаРеализация.ДоговорКонтрагента КАК Договор,
		|	ЗНАЧЕНИЕ(Справочник.СтавкиНДС.Стандарт) КАК СтавкаНДС,
		|	ЗНАЧЕНИЕ(Справочник.СтавкиНСП.Торговля) КАК СтавкаНСП,
		|	ЛОЖЬ КАК БезналичныйРасчет,
		|	ЛОЖЬ КАК БезвозмезднаяПоставка,
		|	ВременнаяТаблицаШапка.Номенклатура КАК Номенклатура,
		|	СУММА(1) КАК Количество,
		|	СУММА(ВЫРАЗИТЬ(ВременнаяТаблицаРеализация.Всего - ВременнаяТаблицаРеализация.СуммаНДС - ВременнаяТаблицаРеализация.СуммаНСП КАК ЧИСЛО(15, 2))) КАК Сумма,
		|	СУММА(ВременнаяТаблицаРеализация.СуммаНДС) КАК СуммаНДС,
		|	СУММА(ВременнаяТаблицаРеализация.СуммаНСП) КАК СуммаНСП,
		|	СУММА(0) КАК СуммаСкидки,
		|	СУММА(ВременнаяТаблицаРеализация.Сумма) КАК СуммаДохода,
		|	СУММА(ВременнаяТаблицаРеализация.Себестоимость) КАК Себестоимость
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаРеализация КАК ВременнаяТаблицаРеализация
		|		ПО (ИСТИНА)
		|ГДЕ
		|	НЕ ВременнаяТаблицаРеализация.Всего = 0
		|	И НЕ ВременнаяТаблицаРеализация.Возврат
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаШапка.Ссылка,
		|	ВременнаяТаблицаШапка.Склад,
		|	ВременнаяТаблицаРеализация.Покупатель,
		|	ВременнаяТаблицаРеализация.ДоговорКонтрагента,
		|	ВременнаяТаблицаШапка.Номенклатура
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	1,
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаШапка.Ссылка,
		|	ВременнаяТаблицаШапка.Склад,
		|	ВременнаяТаблицаРеализация.Покупатель,
		|	ВременнаяТаблицаРеализация.ДоговорКонтрагента,
		|	ЗНАЧЕНИЕ(Справочник.СтавкиНДС.Стандарт),
		|	ЗНАЧЕНИЕ(Справочник.СтавкиНСП.Торговля),
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ВременнаяТаблицаШапка.Номенклатура,
		|	-СУММА(1),
		|	-СУММА(ВЫРАЗИТЬ(ВременнаяТаблицаРеализация.Всего - ВременнаяТаблицаРеализация.СуммаНДС - ВременнаяТаблицаРеализация.СуммаНСП КАК ЧИСЛО(15, 2))),
		|	-СУММА(ВременнаяТаблицаРеализация.СуммаНДС),
		|	-СУММА(ВременнаяТаблицаРеализация.СуммаНСП),
		|	-СУММА(0),
		|	-СУММА(ВременнаяТаблицаРеализация.Сумма),
		|	-СУММА(ВременнаяТаблицаРеализация.Себестоимость)
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаРеализация КАК ВременнаяТаблицаРеализация
		|		ПО (ИСТИНА)
		|ГДЕ
		|	НЕ ВременнаяТаблицаРеализация.Всего = 0
		|	И ВременнаяТаблицаРеализация.Возврат
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаШапка.Ссылка,
		|	ВременнаяТаблицаШапка.Склад,
		|	ВременнаяТаблицаРеализация.Покупатель,
		|	ВременнаяТаблицаРеализация.ДоговорКонтрагента,
		|	ВременнаяТаблицаШапка.Номенклатура";
	РезультатЗапроса = Запрос.Выполнить();	
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПродажи", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаРеализацияТоваров(ДокументСсылка, СтруктураДополнительныеСвойства)

// Формирует таблицу значений, содержащую данные для проведения по регистру бухгалтерии Хозрасчетный.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаНДС(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	// 1. Товары
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =	
		"ВЫБРАТЬ
		|	1 КАК Порядок,
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаРеализация.Покупатель КАК Контрагент,
		|	ВременнаяТаблицаРеализация.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ВременнаяТаблицаРеализация.ДоговорКонтрагента.СтавкаНДС КАК СтавкаНДС,
		|	ВременнаяТаблицаРеализация.СуммаНДС КАК СуммаНДС,
		|	ВременнаяТаблицаРеализация.СуммаНСП КАК СуммаНСП,
		|	ВременнаяТаблицаРеализация.Всего - ВременнаяТаблицаРеализация.СуммаНДС - ВременнаяТаблицаРеализация.СуммаНСП КАК СуммаБезНДС
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаРеализация КАК ВременнаяТаблицаРеализация
		|		ПО (ИСТИНА)
		|ГДЕ
		|	НЕ ВременнаяТаблицаРеализация.Всего = 0
		|	И НЕ ВременнаяТаблицаРеализация.Возврат
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	1,
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаРеализация.Покупатель,
		|	ВременнаяТаблицаРеализация.ДоговорКонтрагента,
		|	ВременнаяТаблицаРеализация.ДоговорКонтрагента.СтавкаНДС,
		|	-ВременнаяТаблицаРеализация.СуммаНДС,
		|	-ВременнаяТаблицаРеализация.СуммаНСП,
		|	-ВременнаяТаблицаРеализация.Всего - ВременнаяТаблицаРеализация.СуммаНДС - ВременнаяТаблицаРеализация.СуммаНСП
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаРеализация КАК ВременнаяТаблицаРеализация
		|		ПО (ИСТИНА)
		|ГДЕ
		|	НЕ ВременнаяТаблицаРеализация.Всего = 0
		|	И ВременнаяТаблицаРеализация.Возврат";
	РезультатЗапроса = Запрос.Выполнить();
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаНДС", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРеестрПриобретенныхМатериальныхРесурсов(ДокументСсылка, СтруктураДополнительныеСвойства) 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВложенныйЗапрос.ЗачетНДС КАК ЗачетНДС,
		|	ВложенныйЗапрос.Контрагент КАК Контрагент,
		|	ВложенныйЗапрос.ДатаСФ КАК ДатаСФ,
		|	ВложенныйЗапрос.ПризнакСтраны КАК ПризнакСтраны,
		|	ВложенныйЗапрос.СерияБланкаСФ КАК СерияБланкаСФ,
		|	ВложенныйЗапрос.НомерБланкаСФ КАК НомерБланкаСФ,
		|	СУММА(ВложенныйЗапрос.Сумма) КАК Сумма,
		|	СУММА(ВложенныйЗапрос.СуммаНДС) КАК СуммаНДС
		|ПОМЕСТИТЬ ВременнаяТаблицаДанныеТабличныхЧастей
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Зачет) КАК ЗачетНДС,
		|		ВременнаяТаблицаТовары.Поставщик КАК Контрагент,
		|		ВременнаяТаблицаТовары.ПризнакСтраны КАК ПризнакСтраны,
		|		ВременнаяТаблицаТовары.Дата КАК ДатаСФ,
		|		ВременнаяТаблицаТовары.СерияБланкаСФ КАК СерияБланкаСФ,
		|		ВременнаяТаблицаТовары.НомерБланкаСФ КАК НомерБланкаСФ,
		|		ЕСТЬNULL(СУММА(ВременнаяТаблицаТовары.Сумма - ВременнаяТаблицаТовары.СуммаНДС - ВременнаяТаблицаТовары.СуммаНСП), 0) КАК Сумма,
		|		ЕСТЬNULL(СУММА(ВременнаяТаблицаТовары.СуммаНДС), 0) КАК СуммаНДС
		|	ИЗ
		|		ВременнаяТаблицаПоступления КАК ВременнаяТаблицаТовары
		|	ГДЕ
		|		НЕ ВременнаяТаблицаТовары.Возврат
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВременнаяТаблицаТовары.Поставщик,
		|		ВременнаяТаблицаТовары.Дата,
		|		ВременнаяТаблицаТовары.СерияБланкаСФ,
		|		ВременнаяТаблицаТовары.НомерБланкаСФ,
		|		ВременнаяТаблицаТовары.ПризнакСтраны) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.ЗачетНДС,
		|	ВложенныйЗапрос.Контрагент,
		|	ВложенныйЗапрос.ДатаСФ,
		|	ВложенныйЗапрос.СерияБланкаСФ,
		|	ВложенныйЗапрос.НомерБланкаСФ,
		|	ВложенныйЗапрос.ПризнакСтраны
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.ЗачетНДС КАК ЗачетНДС,
		|	ВложенныйЗапрос.Контрагент КАК Контрагент,
		|	ВложенныйЗапрос.ДатаСФ КАК ДатаСФ,
		|	ВложенныйЗапрос.ПризнакСтраны КАК ПризнакСтраны,
		|	ВложенныйЗапрос.СерияБланкаСФ КАК СерияБланкаСФ,
		|	ВложенныйЗапрос.НомерБланкаСФ КАК НомерБланкаСФ,
		|	СУММА(ВложенныйЗапрос.Сумма) КАК Сумма,
		|	СУММА(ВложенныйЗапрос.СуммаНДС) КАК СуммаНДС
		|ПОМЕСТИТЬ ВременнаяТаблицаДанныеТабличныхЧастейВозврат
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Зачет) КАК ЗачетНДС,
		|		ВременнаяТаблицаТовары.Поставщик КАК Контрагент,
		|		ВременнаяТаблицаТовары.ПризнакСтраны КАК ПризнакСтраны,
		|		ВременнаяТаблицаТовары.Дата КАК ДатаСФ,
		|		ВременнаяТаблицаТовары.СерияБланкаСФ КАК СерияБланкаСФ,
		|		ВременнаяТаблицаТовары.НомерБланкаСФ КАК НомерБланкаСФ,
		|		ЕСТЬNULL(СУММА(ВременнаяТаблицаТовары.Сумма - ВременнаяТаблицаТовары.СуммаНДС - ВременнаяТаблицаТовары.СуммаНСП), 0) КАК Сумма,
		|		ЕСТЬNULL(СУММА(ВременнаяТаблицаТовары.СуммаНДС), 0) КАК СуммаНДС
		|	ИЗ
		|		ВременнаяТаблицаПоступления КАК ВременнаяТаблицаТовары
		|	ГДЕ
		|		ВременнаяТаблицаТовары.Возврат
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВременнаяТаблицаТовары.Поставщик,
		|		ВременнаяТаблицаТовары.Дата,
		|		ВременнаяТаблицаТовары.СерияБланкаСФ,
		|		ВременнаяТаблицаТовары.НомерБланкаСФ,
		|		ВременнаяТаблицаТовары.ПризнакСтраны) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.ЗачетНДС,
		|	ВложенныйЗапрос.Контрагент,
		|	ВложенныйЗапрос.ДатаСФ,
		|	ВложенныйЗапрос.СерияБланкаСФ,
		|	ВложенныйЗапрос.НомерБланкаСФ,
		|	ВложенныйЗапрос.ПризнакСтраны
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаДанныеТабличныхЧастей.ДатаСФ КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаДанныеТабличныхЧастей.Контрагент КАК Контрагент,
		|	ВременнаяТаблицаДанныеТабличныхЧастей.ЗачетНДС КАК ЗачетНДС,
		|	ВременнаяТаблицаДанныеТабличныхЧастей.СерияБланкаСФ КАК СерияБланкаСФ,
		|	ВременнаяТаблицаДанныеТабличныхЧастей.НомерБланкаСФ КАК НомерБланкаСФ,
		|	ВЫРАЗИТЬ(ВременнаяТаблицаДанныеТабличныхЧастей.СуммаНДС КАК ЧИСЛО(15, 2)) КАК СуммаНДС,
		|	ВЫРАЗИТЬ(ВременнаяТаблицаДанныеТабличныхЧастей.Сумма КАК ЧИСЛО(15, 2)) КАК Сумма
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаДанныеТабличныхЧастей КАК ВременнаяТаблицаДанныеТабличныхЧастей
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВременнаяТаблицаДанныеТабличныхЧастей.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|	И НЕ ВременнаяТаблицаДанныеТабличныхЧастей.СерияБланкаСФ = """"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаДанныеТабличныхЧастей.ДатаСФ,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаДанныеТабличныхЧастей.Контрагент,
		|	ВременнаяТаблицаДанныеТабличныхЧастей.ЗачетНДС,
		|	ВременнаяТаблицаДанныеТабличныхЧастей.СерияБланкаСФ,
		|	ВременнаяТаблицаДанныеТабличныхЧастей.НомерБланкаСФ,
		|	-(ВЫРАЗИТЬ(ВременнаяТаблицаДанныеТабличныхЧастей.СуммаНДС КАК ЧИСЛО(15, 2))),
		|	-(ВЫРАЗИТЬ(ВременнаяТаблицаДанныеТабличныхЧастей.Сумма КАК ЧИСЛО(15, 2)))
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаДанныеТабличныхЧастейВозврат КАК ВременнаяТаблицаДанныеТабличныхЧастей
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВременнаяТаблицаДанныеТабличныхЧастей.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|	И НЕ ВременнаяТаблицаДанныеТабличныхЧастей.СерияБланкаСФ = """"";
	Запрос.УстановитьПараметр("УказыватьПризнакЗачетаНДС", СтруктураДополнительныеСвойства.УчетнаяПолитика.УказыватьПризнакЗачетаНДСПриПоступлении);
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРеестрПриобретенныхМатериальныхРесурсов", Запрос.Выполнить().Выгрузить());		
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаЗначенияСтавокНалогов(ДокументСсылка, СтруктураДополнительныеСвойства) 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаПоступления.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ВременнаяТаблицаШапка.ЗначениеСтавкиНДС КАК ЗначениеСтавкиНДС,
		|	ВременнаяТаблицаШапка.ЗначениеСтавкиНСП КАК ЗначениеСтавкиНСП
		|ИЗ
		|	ВременнаяТаблицаПоступления КАК ВременнаяТаблицаПоступления
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)";
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗначенияСтавокНалогов", РезультатЗапроса.Выгрузить());
		
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаНДСНаИмпорт(ДокументСсылка, СтруктураДополнительныеСвойства) 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаПоступления.Дата КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ЗНАЧЕНИЕ(Перечисление.ИмпортОсвобожденныйОтНДС.ПустаяСсылка) КАК ИмпортОсвобожденныйОтНДС,
		|	"""" КАК ПоказательИмпорта,
		|	СУММА(ВременнаяТаблицаПоступления.СуммаНДС) КАК СуммаНДС,
		|	СУММА(ВременнаяТаблицаПоступления.Сумма) КАК Сумма
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаПоступления КАК ВременнаяТаблицаПоступления
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВременнаяТаблицаПоступления.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|	И НЕ ВременнаяТаблицаПоступления.Возврат
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаПоступления.Дата,
		|	ВременнаяТаблицаШапка.Организация
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаПоступления.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	ЗНАЧЕНИЕ(Перечисление.ИмпортОсвобожденныйОтНДС.ПустаяСсылка),
		|	"""",
		|	-СУММА(ВременнаяТаблицаПоступления.СуммаНДС),
		|	-СУММА(ВременнаяТаблицаПоступления.Сумма)
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаПоступления КАК ВременнаяТаблицаПоступления
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВременнаяТаблицаПоступления.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|	И ВременнаяТаблицаПоступления.Возврат
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаПоступления.Дата,
		|	ВременнаяТаблицаШапка.Организация";
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаНДСНаИмпорт", РезультатЗапроса.Выгрузить());
		
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру бухгалтерии Хозрасчетный.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаБланкиСчетовФактур(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаРеализация.Дата КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаРеализация.СерияБланкаСФ КАК СерияБланкаСФ,
		|	ВременнаяТаблицаРеализация.НомерБланкаСФ КАК НомерБланкаСФ,
		|	1 КАК Количество,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаРеализация КАК ВременнаяТаблицаРеализация
		|		ПО (ИСТИНА)
		|ГДЕ
		|	НЕ ВременнаяТаблицаРеализация.СерияБланкаСФ = """"
		|	И НЕ ВременнаяТаблицаРеализация.НомерБланкаСФ = """"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаШапка.СерияБланкаСФНаличными,
		|	ВременнаяТаблицаШапка.НомерБланкаСФНаличными,
		|	1,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|ГДЕ
		|	НЕ ВременнаяТаблицаШапка.СерияБланкаСФНаличными = """"
		|	И НЕ ВременнаяТаблицаШапка.НомерБланкаСФНаличными = """"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаШапка.СерияБланкаСФКартами,
		|	ВременнаяТаблицаШапка.НомерБланкаСФКартами,
		|	1,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|ГДЕ
		|	НЕ ВременнаяТаблицаШапка.СерияБланкаСФКартами = """"
		|	И НЕ ВременнаяТаблицаШапка.НомерБланкаСФКартами = """"";		
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаБланкиСчетовФактур", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаСотрудники()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаСчетаФактурыВыписанные(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;	
	Запрос.Текст =
	
	"ВЫБРАТЬ
	|	1 КАК Порядок,
	|	ВременнаяТаблицаШапка.Дата КАК Дата,
	|	ВременнаяТаблицаРеализация.Дата КАК ДатаПоставки,
	|	ВременнаяТаблицаШапка.Организация КАК Организация,
	|	ВременнаяТаблицаШапка.Ссылка КАК Документ,
	|	ВременнаяТаблицаРеализация.СерияБланкаСФ КАК СерияБланкаСФ,
	|	ВременнаяТаблицаРеализация.НомерБланкаСФ КАК НомерБланкаСФ,
	|	ВременнаяТаблицаРеализация.ПризнакСтраны КАК ПризнакСтраны,
	|	ВременнаяТаблицаШапка.ВидПоставкиНДС КАК ВидПоставкиНДС,
	|	ВременнаяТаблицаРеализация.Дата КАК ДатаСФ,
	|	ВременнаяТаблицаРеализация.Покупатель КАК Контрагент,
	|	ВременнаяТаблицаРеализация.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВременнаяТаблицаШапка.ЗначениеСтавкиНДС КАК СтавкаНДС,
	|	ВременнаяТаблицаРеализация.Всего - ВременнаяТаблицаРеализация.СуммаНДС - ВременнаяТаблицаРеализация.СуммаНСП КАК СуммаБезНДС,
	|	ВременнаяТаблицаРеализация.СуммаНДС КАК СуммаНДС,
	|	ВременнаяТаблицаРеализация.СуммаНСП КАК СуммаНеоблагаемая
	|ПОМЕСТИТЬ ВременнаяТаблицаДокумента
	|ИЗ
	|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаРеализация КАК ВременнаяТаблицаРеализация
	|		ПО (ИСТИНА)
	|ГДЕ
	|	НЕ ВременнаяТаблицаРеализация.Всего = 0
	|	И НЕ ВременнаяТаблицаРеализация.Возврат Объединить все
	|ВЫБРАТЬ
	|	1 КАК Порядок,
	|	ВременнаяТаблицаШапка.Дата КАК Дата,
	|	ВременнаяТаблицаШапка.Дата КАК ДатаПоставки,
	|	ВременнаяТаблицаШапка.Организация КАК Организация,
	|	ВременнаяТаблицаШапка.Ссылка КАК Документ,
	|	ВременнаяТаблицаШапка.СерияБланкаСФНаличными КАК СерияБланкаСФ,
	|	ВременнаяТаблицаШапка.НомерБланкаСФНаличными КАК НомерБланкаСФ,
	|	ВременнаяТаблицаШапка.Контрагент.ПризнакСтраны КАК ПризнакСтраны,
	|	ВременнаяТаблицаШапка.ВидПоставкиНДС КАК ВидПоставкиНДС,
	|	ВременнаяТаблицаШапка.Дата КАК ДатаСФ,
	|	ВременнаяТаблицаШапка.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаШапка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВременнаяТаблицаШапка.ЗначениеСтавкиНДС КАК СтавкаНДС,
	|	ВременнаяТаблицаШапка.РозничнаяОплатаНаличными - ВременнаяТаблицаШапка.РозничнаяОплатаНаличнымиСуммаНДС - ВременнаяТаблицаШапка.РозничнаяОплатаНаличнымиСуммаНСП КАК СуммаБезНДС,
	|	ВременнаяТаблицаШапка.РозничнаяОплатаНаличнымиСуммаНДС КАК СуммаНДС,
	|	ВременнаяТаблицаШапка.РозничнаяОплатаНаличнымиСуммаНСП КАК СуммаНеоблагаемая
	|
	|ИЗ
	|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
	|ГДЕ
	|	НЕ ВременнаяТаблицаШапка.РозничнаяОплатаНаличными = 0 Объединить все
	|ВЫБРАТЬ
	|	1 КАК Порядок,
	|	ВременнаяТаблицаШапка.Дата КАК Дата,
	|	ВременнаяТаблицаШапка.Дата КАК ДатаПоставки,
	|	ВременнаяТаблицаШапка.Организация КАК Организация,
	|	ВременнаяТаблицаШапка.Ссылка КАК Документ,
	|	ВременнаяТаблицаШапка.СерияБланкаСФКартами КАК СерияБланкаСФ,
	|	ВременнаяТаблицаШапка.НомерБланкаСФКартами КАК НомерБланкаСФ,
	|	ВременнаяТаблицаШапка.Контрагент.ПризнакСтраны КАК ПризнакСтраны,
	|	ВременнаяТаблицаШапка.ВидПоставкиНДС КАК ВидПоставкиНДС,
	|	ВременнаяТаблицаШапка.Дата КАК ДатаСФ,
	|	ВременнаяТаблицаШапка.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаШапка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВременнаяТаблицаШапка.ЗначениеСтавкиНДС КАК СтавкаНДС,
	|	ВременнаяТаблицаШапка.РозничнаяОплатаПоКартам - ВременнаяТаблицаШапка.РозничнаяОплатаПоКартамСуммаНДС КАК СуммаБезНДС,
	|	ВременнаяТаблицаШапка.РозничнаяОплатаПоКартамСуммаНДС КАК СуммаНДС,
	|	0 КАК СуммаНеоблагаемая
	|
	|ИЗ
	|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
	|ГДЕ
	|	НЕ ВременнаяТаблицаШапка.РозничнаяОплатаПоКартам = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК Порядок,
	|	ВременнаяТаблицаШапка.Дата КАК Дата,
	|	ВременнаяТаблицаРеализация.Дата КАК ДатаПоставки,
	|	ВременнаяТаблицаШапка.Организация КАК Организация,
	|	ВременнаяТаблицаШапка.Ссылка КАК Документ,
	|	ВременнаяТаблицаРеализация.СерияБланкаСФ КАК СерияБланкаСФ,
	|	ВременнаяТаблицаРеализация.НомерБланкаСФ КАК НомерБланкаСФ,
	|	ВременнаяТаблицаРеализация.ПризнакСтраны КАК ПризнакСтраны,
	|	ВременнаяТаблицаШапка.ВидПоставкиНДС КАК ВидПоставкиНДС,
	|	ВременнаяТаблицаРеализация.Дата КАК ДатаСФ,
	|	ВременнаяТаблицаРеализация.Покупатель КАК Контрагент,
	|	ВременнаяТаблицаРеализация.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВременнаяТаблицаШапка.ЗначениеСтавкиНДС КАК СтавкаНДС,
	|	ВременнаяТаблицаРеализация.Всего - ВременнаяТаблицаРеализация.СуммаНДС - ВременнаяТаблицаРеализация.СуммаНСП КАК СуммаБезНДС,
	|	ВременнаяТаблицаРеализация.СуммаНДС КАК СуммаНДС,
	|	ВременнаяТаблицаРеализация.СуммаНСП КАК СуммаНеоблагаемая
	|ПОМЕСТИТЬ ВременнаяТаблицаДокументаВозврат
	|ИЗ
	|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаРеализация КАК ВременнаяТаблицаРеализация
	|		ПО (ИСТИНА)
	|ГДЕ
	|	НЕ ВременнаяТаблицаРеализация.Всего = 0
	|	И ВременнаяТаблицаРеализация.Возврат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаДокумента.Дата КАК Дата,
	|	ВременнаяТаблицаДокумента.ДатаПоставки КАК ДатаПоставки,
	|	ВременнаяТаблицаДокумента.Организация КАК Организация,
	|	ВременнаяТаблицаДокумента.Документ КАК Документ,
	|	ВременнаяТаблицаДокумента.СерияБланкаСФ КАК СерияБланкаСФ,
	|	ВременнаяТаблицаДокумента.НомерБланкаСФ КАК НомерБланкаСФ,
	|	ВременнаяТаблицаДокумента.ПризнакСтраны КАК ПризнакСтраны,
	|	ВременнаяТаблицаДокумента.ВидПоставкиНДС КАК ВидПоставкиНДС,
	|	ВременнаяТаблицаДокумента.ДатаСФ КАК ДатаСФ,
	|	ВременнаяТаблицаДокумента.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаДокумента.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВременнаяТаблицаДокумента.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ВременнаяТаблицаДокумента.СуммаБезНДС) КАК СуммаБезНДС,
	|	СУММА(ВременнаяТаблицаДокумента.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ВременнаяТаблицаДокумента.СуммаНеоблагаемая) КАК СуммаНеоблагаемая
	|ИЗ
	|	ВременнаяТаблицаДокумента КАК ВременнаяТаблицаДокумента
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаДокумента.Дата,
	|	ВременнаяТаблицаДокумента.ДатаПоставки,
	|	ВременнаяТаблицаДокумента.Организация,
	|	ВременнаяТаблицаДокумента.ДоговорКонтрагента,
	|	ВременнаяТаблицаДокумента.ДатаСФ,
	|	ВременнаяТаблицаДокумента.Документ,
	|	ВременнаяТаблицаДокумента.Контрагент,
	|	ВременнаяТаблицаДокумента.ПризнакСтраны,
	|	ВременнаяТаблицаДокумента.СерияБланкаСФ,
	|	ВременнаяТаблицаДокумента.ВидПоставкиНДС,
	|	ВременнаяТаблицаДокумента.НомерБланкаСФ,
	|	ВременнаяТаблицаДокумента.СтавкаНДС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВременнаяТаблицаДокумента.Дата,
	|	ВременнаяТаблицаДокумента.ДатаПоставки,
	|	ВременнаяТаблицаДокумента.Организация,
	|	ВременнаяТаблицаДокумента.Документ,
	|	ВременнаяТаблицаДокумента.СерияБланкаСФ,
	|	ВременнаяТаблицаДокумента.НомерБланкаСФ,
	|	ВременнаяТаблицаДокумента.ПризнакСтраны,
	|	ВременнаяТаблицаДокумента.ВидПоставкиНДС,
	|	ВременнаяТаблицаДокумента.ДатаСФ,
	|	ВременнаяТаблицаДокумента.Контрагент,
	|	ВременнаяТаблицаДокумента.ДоговорКонтрагента,
	|	ВременнаяТаблицаДокумента.СтавкаНДС,
	|	-СУММА(ВременнаяТаблицаДокумента.СуммаБезНДС),
	|	-СУММА(ВременнаяТаблицаДокумента.СуммаНДС),
	|	-СУММА(ВременнаяТаблицаДокумента.СуммаНеоблагаемая)
	|ИЗ
	|	ВременнаяТаблицаДокументаВозврат КАК ВременнаяТаблицаДокумента
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаДокумента.Дата,
	|	ВременнаяТаблицаДокумента.ДатаПоставки,
	|	ВременнаяТаблицаДокумента.Организация,
	|	ВременнаяТаблицаДокумента.ДоговорКонтрагента,
	|	ВременнаяТаблицаДокумента.ДатаСФ,
	|	ВременнаяТаблицаДокумента.Документ,
	|	ВременнаяТаблицаДокумента.Контрагент,
	|	ВременнаяТаблицаДокумента.ПризнакСтраны,
	|	ВременнаяТаблицаДокумента.СерияБланкаСФ,
	|	ВременнаяТаблицаДокумента.ВидПоставкиНДС,
	|	ВременнаяТаблицаДокумента.НомерБланкаСФ,
	|	ВременнаяТаблицаДокумента.СтавкаНДС";

	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСчетаФактурыВыписанные", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства, Отказ) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СводПоРознице.Ссылка КАК Ссылка,
		|	СводПоРознице.Дата КАК Дата,
		|	СводПоРознице.Организация КАК Организация,
		|	СводПоРознице.СебестоимостьРозничныхПродаж КАК СебестоимостьРозничныхПродаж,
		|	СводПоРознице.РозничнаяОплатаНаличными КАК РозничнаяОплатаНаличными,
		|	СводПоРознице.РозничнаяОплатаПоКартам КАК РозничнаяОплатаПоКартам,
		|	СводПоРознице.СчетРасчетовПокупателя КАК СчетРасчетовПокупателя,
		|	СводПоРознице.СчетАвансовПокупателя КАК СчетАвансовПокупателя,
		|	СводПоРознице.СчетУчетаДоходаТоваров КАК СчетУчетаДоходаТоваров,
		|	СводПоРознице.СчетУчетаРасходаТоваров КАК СчетУчетаРасходаТоваров,
		|	СводПоРознице.СчетУчетаТоваров КАК СчетУчетаТоваров,
		|	СводПоРознице.СтатьяРасхода КАК СтатьяРасхода,
		|	СводПоРознице.Контрагент КАК Контрагент,
		|	СводПоРознице.БанковскийСчет КАК БанковскийСчет,
		|	СводПоРознице.Касса КАК Касса,
		|	СводПоРознице.Номенклатура КАК Номенклатура,
		|	СводПоРознице.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	СводПоРознице.РозничнаяОплатаНаличнымиСуммаНДС КАК РозничнаяОплатаНаличнымиСуммаНДС,
		|	СводПоРознице.РозничнаяОплатаНаличнымиСуммаНСП КАК РозничнаяОплатаНаличнымиСуммаНСП,
		|	СводПоРознице.РозничнаяОплатаПоКартамСуммаНДС КАК РозничнаяОплатаПоКартамСуммаНДС,
		|	СводПоРознице.КассаБП КАК КассаБП,
		|	СводПоРознице.ЗначениеСтавкиНДС КАК ЗначениеСтавкиНДС,
		|	СводПоРознице.ЗначениеСтавкиНСП КАК ЗначениеСтавкиНСП,
		|	СводПоРознице.Номер КАК Номер,
		|	СводПоРознице.Склад КАК Склад,
		|	СводПоРознице.ДоговорКонтрагента.ВидПоставкиНДС КАК ВидПоставкиНДС,
		|	СводПоРознице.СерияБланкаСФНаличными КАК СерияБланкаСФНаличными,
		|	СводПоРознице.НомерБланкаСФНаличными КАК НомерБланкаСФНаличными,
		|	СводПоРознице.СерияБланкаСФКартами КАК СерияБланкаСФКартами,
		|	СводПоРознице.НомерБланкаСФКартами КАК НомерБланкаСФКартами
		|ПОМЕСТИТЬ ВременнаяТаблицаШапка
		|ИЗ
		|	Документ.СводПоРознице КАК СводПоРознице
		|ГДЕ
		|	СводПоРознице.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СводПоРозницеПоступления.Дата КАК Дата,
		|	СводПоРозницеПоступления.Поставщик КАК Поставщик,
		|	СводПоРозницеПоступления.Поставщик.ПризнакСтраны КАК ПризнакСтраны,
		|	СводПоРозницеПоступления.Всего КАК Сумма,
		|	СводПоРозницеПоступления.СуммаНДС КАК СуммаНДС,
		|	СводПоРозницеПоступления.СуммаНСП КАК СуммаНСП,
		|	СводПоРозницеПоступления.Возврат КАК Возврат,
		|	СводПоРозницеПоступления.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	СводПоРозницеПоступления.СчетРасчетов КАК СчетРасчетов,
		|	СводПоРозницеПоступления.СерияБланкаСФ КАК СерияБланкаСФ,
		|	СводПоРозницеПоступления.НомерБланкаСФ КАК НомерБланкаСФ,
		|	СводПоРозницеПоступления.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ ВременнаяТаблицаПоступления
		|ИЗ
		|	Документ.СводПоРознице.Поступления КАК СводПоРозницеПоступления
		|ГДЕ
		|	СводПоРозницеПоступления.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СводПоРозницеРеализация.Дата КАК Дата,
		|	СводПоРозницеРеализация.Всего КАК Сумма,
		|	СводПоРозницеРеализация.СуммаНДС КАК СуммаНДС,
		|	СводПоРозницеРеализация.СуммаНСП КАК СуммаНСП,
		|	СводПоРозницеРеализация.Всего КАК Всего,
		|	СводПоРозницеРеализация.Покупатель КАК Покупатель,
		|	СводПоРозницеРеализация.Покупатель.ПризнакСтраны КАК ПризнакСтраны,
		|	СводПоРозницеРеализация.Себестоимость КАК Себестоимость,
		|	СводПоРозницеРеализация.Возврат КАК Возврат,
		|	СводПоРозницеРеализация.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	СводПоРозницеРеализация.СчетРасчетов КАК СчетРасчетов,
		|	СводПоРозницеРеализация.СерияБланкаСФ КАК СерияБланкаСФ,
		|	СводПоРозницеРеализация.НомерБланкаСФ КАК НомерБланкаСФ,
		|	СводПоРозницеРеализация.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ ВременнаяТаблицаРеализация
		|ИЗ
		|	Документ.СводПоРознице.Реализация КАК СводПоРозницеРеализация
		|ГДЕ
		|	СводПоРозницеРеализация.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СводПоРозницеОплатаПоставщикам.Ссылка КАК Ссылка,
		|	СводПоРозницеОплатаПоставщикам.Дата КАК Дата,
		|	СводПоРозницеОплатаПоставщикам.БезналичнаяОплата КАК БезналичнаяОплата,
		|	СводПоРозницеОплатаПоставщикам.Поставщик КАК Поставщик,
		|	СводПоРозницеОплатаПоставщикам.Сумма КАК Сумма,
		|	СводПоРозницеОплатаПоставщикам.Возврат КАК Возврат,
		|	СводПоРозницеОплатаПоставщикам.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	СводПоРозницеОплатаПоставщикам.СчетАвансов КАК СчетАвансов
		|ПОМЕСТИТЬ ВременнаяТаблицаОплатаПоставщикам
		|ИЗ
		|	Документ.СводПоРознице.ОплатаПоставщикам КАК СводПоРозницеОплатаПоставщикам
		|ГДЕ
		|	СводПоРозницеОплатаПоставщикам.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СводПоРозницеОплатаОтПокупателей.Ссылка КАК Ссылка,
		|	СводПоРозницеОплатаОтПокупателей.Дата КАК Дата,
		|	СводПоРозницеОплатаОтПокупателей.БезналичнаяОплата КАК БезналичнаяОплата,
		|	СводПоРозницеОплатаОтПокупателей.Покупатель КАК Покупатель,
		|	СводПоРозницеОплатаОтПокупателей.Сумма КАК Сумма,
		|	СводПоРозницеОплатаОтПокупателей.Возврат КАК Возврат,
		|	СводПоРозницеОплатаОтПокупателей.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	СводПоРозницеОплатаОтПокупателей.СчетАвансов КАК СчетАвансов
		|ПОМЕСТИТЬ ВременнаяТаблицаОплатаОтПокупателей
		|ИЗ
		|	Документ.СводПоРознице.ОплатаОтПокупателей КАК СводПоРозницеОплатаОтПокупателей
		|ГДЕ
		|	СводПоРозницеОплатаОтПокупателей.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	СформироватьТаблицаХозрасчетный(ДокументСсылка, СтруктураДополнительныеСвойства, Отказ);
	
	// Поступление
	СформироватьТаблицаПоступлениеТоваров(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРеестрВвезенных(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицаСведенияОПоступлении(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРеестрЗакупок(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРеестрПриобретенныхМатериальныхРесурсов(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицаНДСНаИмпорт(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗначенияСтавокНалогов(ДокументСсылка, СтруктураДополнительныеСвойства);
	
	// Реализация
	СформироватьТаблицаПродажи(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицаНДС(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицаБланкиСчетовФактур(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицаСчетаФактурыВыписанные(ДокументСсылка, СтруктураДополнительныеСвойства);
	
	
КонецПроцедуры

#КонецОбласти

#Область ВерсионированиеОбъектов

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#КонецЕсли
