
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	// Установить видимость и доступность элементов формы
	УстановитьВидимостьДоступностьЭлементов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Процедура - обработчик события ПриИзменении поля ввода СпособРасчета.
//
&НаКлиенте
Процедура СпособРасчетаПриИзменении(Элемент)
	// Установить видимость и доступность элементов формы
	УстановитьВидимостьДоступностьЭлементов();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура устанавливает видимость и доступность элементов.
//
&НаСервере
Процедура УстановитьВидимостьДоступностьЭлементов()
	Если Объект.СпособРасчета = Перечисления.СпособыРасчетаУдержаний.Процентом Тогда
		Элементы.РасчетЗаМинусомПН.Видимость = Истина;
		Элементы.РасчетЗаМинусомСФ.Видимость = Истина;
		Элементы.РасчетЗаМинусомПрофВзнос.Видимость = Истина;
		
		Элементы.СтраницаБазовыеВидыРасчета.Видимость = Истина;
	ИначеЕсли Объект.СпособРасчета = Перечисления.СпособыРасчетаУдержаний.ФиксированнойСуммой Тогда 
		Элементы.РасчетЗаМинусомПН.Видимость = Ложь;
		Элементы.РасчетЗаМинусомСФ.Видимость = Ложь;
		Элементы.РасчетЗаМинусомПрофВзнос.Видимость = Ложь;

		Элементы.СтраницаБазовыеВидыРасчета.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры 

#КонецОбласти
