
Процедура ЗаполнитьШапкуСчетФактура(Данные, ОбластьМакета, ДанныеСтроки = Неопределено, РазрешенноеКолвоСтрок = 7) Экспорт
	УПП = БухгалтерскийУчетСервер.ПолучитьДанныеУчетнойПолитикиОрганизаций(Данные.Дата, Данные.Организация);
	
	ГоловнаяОрганизация = Данные.ГоловнаяОрганизация;

	ОбластьМакета.Параметры.НомерОтчета                 = ?(РазрешенноеКолвоСтрок = 20,"001","002");
	ОбластьМакета.Параметры.НомерПриложения             = ?(РазрешенноеКолвоСтрок = 20,"2","3");
	// ОбластьМакета.Параметры.НомерБланкаСФ               = Данные.НомерБланкаСФ;
	//ОбластьМакета.Параметры.СерияБланкаСФ               = Данные.СерияБланкаСФ;

	ОбластьМакета.Параметры.ТекстЗаголовка = "СЧЕТ-ФАКТУРА НДС";

	//////////////////////Данные поставщика НАЧАЛО/////////////////////////////////////
	ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Данные);
	
	ДатаСФ                         						= Строка(Данные.ДатаСФ);
	ОбластьМакета.Параметры.Дата1                       = Сред(ДатаСФ,1,1);
	ОбластьМакета.Параметры.Дата2                       = Сред(ДатаСФ,2,1);
	ОбластьМакета.Параметры.Дата3                       = Сред(ДатаСФ,4,1);
	ОбластьМакета.Параметры.Дата4                       = Сред(ДатаСФ,5,1);
	ОбластьМакета.Параметры.Дата5                       = Сред(ДатаСФ,7,1);
	ОбластьМакета.Параметры.Дата6                       = Сред(ДатаСФ,8,1);
	ОбластьМакета.Параметры.Дата7                       = Сред(ДатаСФ,9,1);
	ОбластьМакета.Параметры.Дата8                       = Сред(ДатаСФ,10,1);

	ОбластьМакета.Параметры.ДатаПоставки                = Формат(Данные.Дата,"ДЛФ=DD");
	//ОбластьМакета.Параметры.ДП1                       = Сред(ДатаСФ,1,1);
	//ОбластьМакета.Параметры.ДП2                       = Сред(ДатаСФ,2,1);
	//ОбластьМакета.Параметры.ДП4                       = Сред(ДатаСФ,4,1);
	//ОбластьМакета.Параметры.ДП5                       = Сред(ДатаСФ,5,1);
	//ОбластьМакета.Параметры.ДП7                       = Сред(ДатаСФ,7,1);
	//ОбластьМакета.Параметры.ДП8                       = Сред(ДатаСФ,8,1);
	//ОбластьМакета.Параметры.ДП9                       = Сред(ДатаСФ,9,1);
	//ОбластьМакета.Параметры.ДП10                      = Сред(ДатаСФ,10,1);

	ИННнаш = ГоловнаяОрганизация.ИНН;	
	ОбластьМакета.Параметры.ИННПост1					= Сред(ИННнаш,1,1);	
	ОбластьМакета.Параметры.ИННПост2					= Сред(ИННнаш,2,1);	
	ОбластьМакета.Параметры.ИННПост3					= Сред(ИННнаш,3,1);
	ОбластьМакета.Параметры.ИННПост4					= Сред(ИННнаш,4,1);
	ОбластьМакета.Параметры.ИННПост5					= Сред(ИННнаш,5,1);
	ОбластьМакета.Параметры.ИННПост6					= Сред(ИННнаш,6,1);
	ОбластьМакета.Параметры.ИННПост7					= Сред(ИННнаш,7,1);
	ОбластьМакета.Параметры.ИННПост8					= Сред(ИННнаш,8,1);
	ОбластьМакета.Параметры.ИННПост9					= Сред(ИННнаш,9,1);
	ОбластьМакета.Параметры.ИННПост10					= Сред(ИННнаш,10,1);
	ОбластьМакета.Параметры.ИННПост11					= Сред(ИННнаш,11,1);
	ОбластьМакета.Параметры.ИННПост12					= Сред(ИННнаш,12,1);
	ОбластьМакета.Параметры.ИННПост13					= Сред(ИННнаш,13,1);
	ОбластьМакета.Параметры.ИННПост14					= Сред(ИННнаш,14,1);

	
	//ОбластьМакета.Параметры.ТипПоставки = ?(Данные.ДокЭкспорт,"Экспорт ","Внутренняя"); 
	
	
	БанкНашСсылка  	= Данные.БанковскийСчет;
	БИКнаш	 = БанкНашСсылка.Банк.Код;
	ОбластьМакета.Параметры.КодБанкаПоставщика1			= Сред(БИКнаш,1,1);
	ОбластьМакета.Параметры.КодБанкаПоставщика2				= Сред(БИКнаш,2,1);
	ОбластьМакета.Параметры.КодБанкаПоставщика3		        = Сред(БИКнаш,3,1);
	ОбластьМакета.Параметры.КодБанкаПоставщика4				= Сред(БИКнаш,4,1);
	ОбластьМакета.Параметры.КодБанкаПоставщика5				= Сред(БИКнаш,5,1);	
	ОбластьМакета.Параметры.КодБанкаПоставщика6				= Сред(БИКнаш,6,1);
	ОбластьМакета.Параметры.КодБанкаПоставщика7				= Сред(БИКнаш,7,1);
	ОбластьМакета.Параметры.КодБанкаПоставщика8				= Сред(БИКнаш,8,1);
	ОбластьМакета.Параметры.КодБанкаПоставщика9				= Сред(БИКнаш,9,1);

	РСчетНаш = ?(не ЗначениеЗаполнено(БанкНашСсылка.НомерСчета),БанкНашСсылка.Наименование,БанкНашСсылка.НомерСчета);
	ОбластьМакета.Параметры.СчетПоставщика1			= Сред(РСчетНаш,1,1);
	ОбластьМакета.Параметры.СчетПоставщика2			= Сред(РСчетНаш,2,1);
	ОбластьМакета.Параметры.СчетПоставщика3			= Сред(РСчетНаш,3,1);
	ОбластьМакета.Параметры.СчетПоставщика4			= Сред(РСчетНаш,4,1);
	ОбластьМакета.Параметры.СчетПоставщика5			= Сред(РСчетНаш,5,1);
	ОбластьМакета.Параметры.СчетПоставщика6			= Сред(РСчетНаш,6,1);
	ОбластьМакета.Параметры.СчетПоставщика7			= Сред(РСчетНаш,7,1);
	ОбластьМакета.Параметры.СчетПоставщика8			= Сред(РСчетНаш,8,1);
	ОбластьМакета.Параметры.СчетПоставщика9			= Сред(РСчетНаш,9,1);
	ОбластьМакета.Параметры.СчетПоставщика10		= Сред(РСчетНаш,10,1);
	ОбластьМакета.Параметры.СчетПоставщика11		= Сред(РСчетНаш,11,1);
	ОбластьМакета.Параметры.СчетПоставщика12		= Сред(РСчетНаш,12,1);
	ОбластьМакета.Параметры.СчетПоставщика13		= Сред(РСчетНаш,13,1);
	ОбластьМакета.Параметры.СчетПоставщика14		= Сред(РСчетНаш,14,1);
	ОбластьМакета.Параметры.СчетПоставщика15		= Сред(РСчетНаш,15,1);
	ОбластьМакета.Параметры.СчетПоставщика16		= Сред(РСчетНаш,16,1);
	//ОбластьМакета.Параметры.СчетПоставщика17		= Сред(РСчетНаш,17,1);
	//ОбластьМакета.Параметры.СчетПоставщика18		= Сред(РСчетНаш,18,1);
	//ОбластьМакета.Параметры.СчетПоставщика19		= Сред(РСчетНаш,19,1);
	//ОбластьМакета.Параметры.СчетПоставщика20		= Сред(РСчетНаш,20,1);
	
	ОбластьМакета.Параметры.БанкПоставщика     = БанкНашСсылка.Банк.Наименование;

	ГНСнаш 										= Данные.ГНС;
	Если ЗначениеЗаполнено(ГНСнаш) Тогда
		ОбластьМакета.Параметры.ГНСПоставщика1		= Сред(ГНСнаш.Код,1,1);
		ОбластьМакета.Параметры.ГНСПоставщика2		= Сред(ГНСнаш.Код,2,1);
		ОбластьМакета.Параметры.ГНСПоставщика3		= Сред(ГНСнаш.Код,3,1);
	КонецЕсли;

	ОбластьМакета.Параметры.НаименованиеГНСПоставщика   = ГНСнаш.Наименование;
	ОбластьМакета.Параметры.ПредставлениеПоставщика    	= СокрЛП(ГоловнаяОрганизация.НаименованиеПолное) + "(" + СокрЛП(Данные.НаименованиеПолное) + ")";
		
	//////////////////////Данные поставщика КОНЕЦ/////////////////////////////////////

	//////////////////////Данные покупателя НАЧАЛО/////////////////////////////////////
	Если ЗначениеЗаполнено(Данные.Контрагент) Тогда 
		ОбластьМакета.Параметры.АдресПокупателя = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Данные.Контрагент, Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента); 
	КонецЕсли;
	Если ЗначениеЗаполнено(Данные.ГоловнаяОрганизация) Тогда 
		ОбластьМакета.Параметры.АдресПоставщика = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Данные.ГоловнаяОрганизация, Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации); 
	КонецЕсли;	
	ОбластьМакета.Параметры.АдресПоставщика = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Данные.ГоловнаяОрганизация, Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
	
	//ПечатьКодаКонтрагентовСФ = Константы.ПечатьКодаКонтрагентовСФ.Получить();
	
	Если ДанныеСтроки = Неопределено Тогда 
		ИННпокупателя = Данные.Контрагент.ИНН;
		ОбластьМакета.Параметры.ПредставлениеПокупателя = СокрЛП(Данные.Контрагент.НаименованиеПолное);
		КодГНСПок = Данные.Контрагент.ГНС.Код;
		ОбластьМакета.Параметры.НаименованиеГНСПокупателя = Данные.Контрагент.ГНС.Наименование;
		БанкСсылкаПок = Данные.ОснБанкСчет_Пок;
		ОбластьМакета.Параметры.АдресПокупателя = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Данные.Контрагент, Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
	Иначе 
		ИННпокупателя = ДанныеСтроки.Контрагент.ИНН;
		ОбластьМакета.Параметры.ПредставлениеПокупателя = СокрЛП(ДанныеСтроки.Контрагент.НаименованиеПолное);
		КодГНСПок = ДанныеСтроки.Контрагент.ГНС.Код;
		ОбластьМакета.Параметры.НаименованиеГНСПок = ДанныеСтроки.Контрагент.ГНС.Наименование;
		БанкСсылкаПок = ДанныеСтроки.ОснБанкСчет_Пок;
		ОбластьМакета.Параметры.АдресПокупателя = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ДанныеСтроки.Контрагент, Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);		
	КонецЕсли;
		
	ОбластьМакета.Параметры.ИННПок1						= Сред(ИННпокупателя,1,1);
	ОбластьМакета.Параметры.ИННПок2						= Сред(ИННпокупателя,2,1);
	ОбластьМакета.Параметры.ИННПок3						= Сред(ИННпокупателя,3,1);
	ОбластьМакета.Параметры.ИННПок4						= Сред(ИННпокупателя,4,1);
	ОбластьМакета.Параметры.ИННПок5						= Сред(ИННпокупателя,5,1);
	ОбластьМакета.Параметры.ИННПок6						= Сред(ИННпокупателя,6,1);
	ОбластьМакета.Параметры.ИННПок7						= Сред(ИННпокупателя,7,1);
	ОбластьМакета.Параметры.ИННПок8						= Сред(ИННпокупателя,8,1);
	ОбластьМакета.Параметры.ИННПок9						= Сред(ИННпокупателя,9,1);
	ОбластьМакета.Параметры.ИННПок10					= Сред(ИННпокупателя,10,1);
	ОбластьМакета.Параметры.ИННПок11					= Сред(ИННпокупателя,11,1);
	ОбластьМакета.Параметры.ИННПок12					= Сред(ИННпокупателя,12,1);
	ОбластьМакета.Параметры.ИННПок13					= Сред(ИННпокупателя,13,1);
	ОбластьМакета.Параметры.ИННПок14					= Сред(ИННпокупателя,14,1);
	
	ОбластьМакета.Параметры.ГНСПокупателя1		= Сред(КодГНСПок,1,1);
	ОбластьМакета.Параметры.ГНСПокупателя2		= Сред(КодГНСПок,2,1);
	ОбластьМакета.Параметры.ГНСПокупателя3		= Сред(КодГНСПок,3,1);
	
	//ДатаСФКор = Данные.ДатаСФКор;
	//СтруктураКроДатаСФ =  Новый Структура;
	//Если ЗначениеЗаполнено(ДатаСФКор) Тогда 
	//	СтруктураКроДатаСФ.Вставить("ДатаСфКор1",Сред(ДатаСФКор,1,1));
	//	СтруктураКроДатаСФ.Вставить("ДатаСфКор2",Сред(ДатаСФКор,2,1));
	//	СтруктураКроДатаСФ.Вставить("ДатаСфКор3",Сред(ДатаСФКор,4,1));
	//	СтруктураКроДатаСФ.Вставить("ДатаСфКор4",Сред(ДатаСФКор,5,1));
	//	СтруктураКроДатаСФ.Вставить("ДатаСфКор5",Сред(ДатаСФКор,7,1));
	//	СтруктураКроДатаСФ.Вставить("ДатаСфКор6",Сред(ДатаСФКор,8,1));
	//	СтруктураКроДатаСФ.Вставить("ДатаСфКор7",Сред(ДатаСФКор,9,1));
	//	СтруктураКроДатаСФ.Вставить("ДатаСфКор8",Сред(ДатаСФКор,10,1));
	//	ОбластьМакета.Параметры.Заполнить(СтруктураКроДатаСФ);
	//КонецЕсли;	
	//
	Если ЗначениеЗаполнено(БанкСсылкаПок)Тогда 
		СчетПок = ?(Не ЗначениеЗаполнено(БанкСсылкаПок.НомерСчета),БанкСсылкаПок.Наименование,БанкСсылкаПок.НомерСчета);
		ОбластьМакета.Параметры.СчетПокупателя1			= Сред(СчетПок,1,1);
		ОбластьМакета.Параметры.СчетПокупателя2			= Сред(СчетПок,2,1);
		ОбластьМакета.Параметры.СчетПокупателя3			= Сред(СчетПок,3,1);
		ОбластьМакета.Параметры.СчетПокупателя4			= Сред(СчетПок,4,1);
		ОбластьМакета.Параметры.СчетПокупателя5			= Сред(СчетПок,5,1);
		ОбластьМакета.Параметры.СчетПокупателя6			= Сред(СчетПок,6,1);
		ОбластьМакета.Параметры.СчетПокупателя7			= Сред(СчетПок,7,1);
		ОбластьМакета.Параметры.СчетПокупателя8			= Сред(СчетПок,8,1);
		ОбластьМакета.Параметры.СчетПокупателя9			= Сред(СчетПок,9,1);
		ОбластьМакета.Параметры.СчетПокупателя10	  		= Сред(СчетПок,10,1);
		ОбластьМакета.Параметры.СчетПокупателя11			= Сред(СчетПок,11,1);
		ОбластьМакета.Параметры.СчетПокупателя12			= Сред(СчетПок,12,1);
		ОбластьМакета.Параметры.СчетПокупателя13			= Сред(СчетПок,13,1);
		ОбластьМакета.Параметры.СчетПокупателя14			= Сред(СчетПок,14,1);
		ОбластьМакета.Параметры.СчетПокупателя15			= Сред(СчетПок,15,1);
		ОбластьМакета.Параметры.СчетПокупателя16			= Сред(СчетПок,16,1);
				
		ДанныеБИКПок = Новый Структура("КодБанкаПокупателя1, КодБанкаПокупателя2, КодБанкаПокупателя3, КодБанкаПокупателя4, КодБанкаПокупателя5, КодБанкаПокупателя6, КодБанкаПокупателя7, КодБанкаПокупателя8, КодБанкаПокупателя9, БанкПокупателя", "0","0","0","0","0","0","","","", "Отсуствует");		
		БИКПок = БанкСсылкаПок.Банк.Код;
		Если ЗначениеЗаполнено(БанкСсылкаПок) Тогда 
			ДанныеБИКПок.КодБанкаПокупателя1 = Сред(БИКПок,1,1);		
			ДанныеБИКПок.КодБанкаПокупателя2 = Сред(БИКПок,2,1);		
			ДанныеБИКПок.КодБанкаПокупателя3 = Сред(БИКПок,3,1);		
			ДанныеБИКПок.КодБанкаПокупателя4 = Сред(БИКПок,4,1);		
			ДанныеБИКПок.КодБанкаПокупателя5 = Сред(БИКПок,5,1);		
			ДанныеБИКПок.КодБанкаПокупателя6 = Сред(БИКПок,6,1);		
			ДанныеБИКПок.КодБанкаПокупателя7 = Сред(БИКПок,7,1);		
			ДанныеБИКПок.КодБанкаПокупателя8 = Сред(БИКПок,8,1);		
			ДанныеБИКПок.КодБанкаПокупателя9 = Сред(БИКПок,9,1);
			ДанныеБИКПок.БанкПокупателя = БанкСсылкаПок.Банк.Наименование;
		КонецЕсли;
		
		ОбластьМакета.Параметры.Заполнить(ДанныеБИКПок);
		
	Иначе 
		ОбластьМакета.Параметры.СчетПокупателя1			= "о";
		ОбластьМакета.Параметры.СчетПокупателя2			= "т";
		ОбластьМакета.Параметры.СчетПокупателя3			= "с";
		ОбластьМакета.Параметры.СчетПокупателя4			= "у";
		ОбластьМакета.Параметры.СчетПокупателя5			= "т";
		ОбластьМакета.Параметры.СчетПокупателя6			= "с";
		ОбластьМакета.Параметры.СчетПокупателя7			= "т";
		ОбластьМакета.Параметры.СчетПокупателя8			= "в";
		ОбластьМакета.Параметры.СчетПокупателя9			= "у";
		ОбластьМакета.Параметры.СчетПокупателя10	  	= "е";
		ОбластьМакета.Параметры.СчетПокупателя11		= "т";	
		
		ОбластьМакета.Параметры.БанкПокупателя = "отсутствует";
		
	КонецЕсли;
	
	//////////////////////Данные покупателя КОНЕЦ/////////////////////////////////////
	
КонецПроцедуры
