
#Область ОбработчикиСобытийФормы

// Процедура - обработчик события ПриСозданииНаСервере.
// В процедуре осуществляется
// - инициализация реквизитов формы,
// - установка параметров функциональных опций формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ОбрабатыватьСобытиеПриОткрытии = Истина;
	
КонецПроцедуры

// Процедура - обработчик события ПриОткрытии.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ОбрабатыватьСобытиеПриОткрытии Тогда
		Отказ = Истина;
		МониторИнтернетПоддержкиКлиент.ОткрытьМониторИнтернетПоддержки();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти