#Область ОбработчикиСобытийФормы

// Процедура - обработчик события ПриОткрытии.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьДоступностьЭлементов();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура устанавливает видимость и доступность элементов.
//
&НаКлиенте
Процедура УстановитьВидимостьДоступностьЭлементов()
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Элементы.Владелец.Доступность = Истина;		
	КонецЕсли;		
КонецПроцедуры

#КонецОбласти
