
#Область ПроцедурыИФункцииОбщегоНазначения

&НаСервере
Процедура ЗаполнитьНаСервере()
	Макет = Справочники.ХарактерСделки.ПолучитьМакет("КлассификаторХарактеровСделки");
	ВысотаТаблицы = Макет.ВысотаТаблицы;
	ТаблицаЗначений = Новый ТаблицаЗначений;
	
	КС150 	= Новый КвалификаторыСтроки(150);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповС150 = Новый ОписаниеТипов(Массив, , КС150);
	
	ТаблицаЗначений.Колонки.Добавить("Наименование", ОписаниеТиповС150);
	Для Счетчик = 5 По ВысотаТаблицы Цикл
		СтрокаКлассификатора = ТаблицаЗначений.Добавить();
	    СтрокаКлассификатора.Наименование = Макет.Область(Счетчик, 3, ВысотаТаблицы, 3).Текст;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Классификатор.Наименование
		|ПОМЕСТИТЬ ВременнаяТаблицаКлассификатор
		|ИЗ
		|	&Классификатор КАК Классификатор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаКлассификатор.Наименование
		|ИЗ
		|	ВременнаяТаблицаКлассификатор КАК ВременнаяТаблицаКлассификатор
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыТранспорта КАК ВидыТранспорта
		|		ПО ВременнаяТаблицаКлассификатор.Наименование = ВидыТранспорта.Наименование
		|ГДЕ
		|	ВидыТранспорта.Код ЕСТЬ NULL ";
	
	Запрос.Параметры.Вставить("Классификатор", ТаблицаЗначений);	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовыйЭлемент = Справочники.ВидыТранспорта.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(НовыйЭлемент, ВыборкаДетальныеЗаписи);
		НовыйЭлемент.Записать();
	КонецЦикла;

КонецПроцедуры // ЗаполнитьНаСервере()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодобратьИзМакета(Команда)
	
	СтрокаПоиска = "";
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		СтрокаПоиска = ТекДанные.Код;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура("СтрокаПоиска", СтрокаПоиска);
	ОткрытьФорму("Справочник.ХарактерСделки.Форма.ФормаВыбораИзКлассификатора",
		СтруктураПараметров, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере()
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиРезультатовИнтерактивныхДействий

&НаКлиенте
Процедура ВопросПодобратьЕдиницуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПодобратьИзМакета(Неопределено);
	Иначе
		ОткрытьФорму("Справочник.ХарактерСделки.Форма.ФормаЭлемента", ДополнительныеПараметры, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиТабличныхЧастей

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	Текст = НСтр("ru = 'Есть возможность подобрать характер сделки из классификатора.
		|Подобрать?'");
		
	ДополнительныеПараметры = Новый Структура;
	Если Копирование Тогда
		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("Код", Элемент.ТекущиеДанные.Код);
		ЗначенияЗаполнения.Вставить("Наименование", Элемент.ТекущиеДанные.Наименование);
		ЗначенияЗаполнения.Вставить("НаименованиеПолное", Элемент.ТекущиеДанные.НаименованиеПолное);
		ДополнительныеПараметры.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ВопросПодобратьЕдиницуЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(Оповещение, Текст, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
	
КонецПроцедуры

#КонецОбласти


