
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ЗаголовокФормы", НСтр("ru = 'План счетов'"));
	
	ПараметрыКомандыПечати = Новый Массив;
	ПараметрыКомандыПечати.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ПустаяСсылка"));
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("ПланСчетов.Хозрасчетный", "ПростойСписок", ПараметрыКомандыПечати,
		ПараметрыВыполненияКоманды, ПараметрыПечати);
	
КонецПроцедуры
