///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2018, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "Интернет-поддержка пользователей".
// ОбщийМодуль.ИнтернетПоддержкаПользователейПереопределяемый.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ОбщегоНазначения

// Определяет имя текущей программы, по которому программа идентифицируется в
// сервисах Интернет-поддержки.
//
// Пример:
//	ИмяПрограммы = "Trade";
//
Функция ИмяПрограммы() Экспорт
	
	ИмяПрограммы = "";
	
	Если ВРег(Метаданные.Имя) = ВРег("БухгалтерияДляКыргызстана") Тогда
		ИмяПрограммы = "AccountingKy";
	ИначеЕсли ВРег(Метаданные.Имя) = ВРег("БухгалтерияДляКыргызстанаБазовая") Тогда
		ИмяПрограммы = "AccountingKyBase";
	КонецЕсли;
	
	Возврат ИмяПрограммы;
	
КонецФункции

// В процедуре заполняется код языка интерфейса конфигурации (Метаданные.Языки),
// который передается сервисам Интернет-поддержки.
// Код языка заполняется в формате ISO-639-1.
// Если коды языков интерфейса конфигурации определены в формате ISO-639-1,
// тогда тело метода заполнять не нужно.
//
// Параметры:
//	КодЯзыка - Строка - в параметре передается код языка, указанный в
//		Метаданные.Языки;
//	КодЯзыкаВФорматеISO639_1 - Строка - в параметре возвращается
//		код языка в формате ISO-639-1.
//
// Пример:
//	Если КодЯзыка = "rus" Тогда
//		КодЯзыкаВФорматеISO639_1 = "ru";
//	ИначеЕсли КодЯзыка = "english" Тогда
//		КодЯзыкаВФорматеISO639_1 = "en";
//	КонецЕсли;
//
Процедура ПриОпределенииКодаЯзыкаИнтерфейсаКонфигурации(КодЯзыка, КодЯзыкаВФорматеISO639_1) Экспорт
	
	// БПКР
	Если КодЯзыка = "rus" Тогда
		КодЯзыкаВФорматеISO639_1 = "ru";
	ИначеЕсли КодЯзыка = "english" Тогда
		КодЯзыкаВФорматеISO639_1 = "en";
	КонецЕсли;
	// Конец БПКР
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

//#Область ИнтернетПоддержкаПользователейБП

//#Область ОбработкаНовостей

//// Возвращает значение варианта отбора по ленте новостей
//// Подробнее в описании метода Справочник.Новости.ПолучитьСписокНовостей()
////
//Функция ВариантОтбораПоЛентеНовостей() Экспорт
//	
//	Возврат 1;
//	
//КонецФункции

//Функция КоличествоКонтекстныхНовостей() Экспорт
//	
//	Возврат 50;
//	
//КонецФункции

//// Функция - возвращает ссылку на элемент справочника "Ленты новостей"
//// 
//// Возвращаемое значение:
////  СправочникСсылка.ЛентыНовостей - ссылка на справочник
////
//Функция ЛентаНовостейЧтоНового() Экспорт
//	
//	Возврат ОбработкаНовостейПовтИсп.ПолучитьЛентуНовостейПоКоду("WhatIsNew");
//	
//КонецФункции

//// Функция - Порядок контекстных новостей
//// 
//// Возвращаемое значение:
////  Строка - перечисление через запятую порядка сортировки новостей
////
//Функция ПорядокКонтекстныхНовостей() Экспорт
//	
//	Возврат  "Прочтена Возр, ДатаПубликации Убыв, Важность Убыв";
//	
//КонецФункции

//// Процедура - Снятие выделения элементов дерева
////
//// Параметры:
////  СтрокаДерева - СтрокаДереваЗначений - строка дерева значений, с которого нужно снять пометку "Прочитано"
////
//Процедура СнятиеВыделенияЭлементовДерева(СтрокаДерева) Экспорт
//	
//	СписокЭлементовДерева = СтрокаДерева.ПолучитьЭлементы();
//	Для Каждого ЭлементДерева Из СписокЭлементовДерева Цикл
//		
//		ЭлементДерева.ВыделеннаяСтрока = Ложь;
//		СнятиеВыделенияЭлементовДерева(ЭлементДерева);
//		
//	КонецЦикла;
//	
//КонецПроцедуры

//#КонецОбласти

//#КонецОбласти
