
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтраныМира.Ссылка КАК Наименование,
		|	СтраныМира.КодАльфа2,
		|	СтраныМира.Код
		|ИЗ
		|	Справочник.СтраныМира КАК СтраныМира
		|ГДЕ
		|	СтраныМира.Предопределенный";
	
	
	Результат = Запрос.Выполнить();
    Объект.СтраныМира.Загрузить(Результат.Выгрузить());

КонецПроцедуры

&НаКлиенте
Процедура СтраныМираВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекДанные =  Элемент.ТекущиеДанные;
	П = ТекДанные.Наименование;
	ЗначОтбора = Новый Структура;
	ЗначОтбора.Вставить("Ключ",П);
	ОткрытьФорму("Справочник.СтраныМира.ФормаОбъекта",ЗначОтбора);

КонецПроцедуры
