#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Процедура - обработчик события ОбработкаПроверкиЗаполнения объекта.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	// Предварительный контроль
	ВыполнитьПредварительныйКонтроль(Отказ);	
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Процедура - обработчик события ОбработкаЗаполнения объекта.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ЗаполнениеОбъектовБП.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения);
КонецПроцедуры

#КонецОбласти
	
#Область СлужебныеПроцедурыИФункции

// Процедура выполняет контроль противоречий.
//
Процедура ВыполнитьПредварительныйКонтроль(Отказ)
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;	
КонецПроцедуры

Процедура ЗаполнитьПоДаннымБухгалтерскогоУчета() Экспорт
	Отказ = Ложь;
	ФильтрСписокСчетов = Новый Массив();
	Для каждого СтрокаСчета Из СписокСчетов Цикл
		ФильтрСписокСчетов.Добавить(СтрокаСчета.СчетУчета); 
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	
	Если СверкаПоСоцФонду Тогда 
		ЗапросТекст = 
			"ВЫБРАТЬ
			|	ХозрасчетныйОстаткиИОбороты.ПериодСекунда КАК Дата,
			|	ХозрасчетныйОстаткиИОбороты.Регистратор КАК Документ,
			|	СУММА(ХозрасчетныйОстаткиИОбороты.СуммаОборотДт) КАК Дебет,
			|	СУММА(0) КАК Кредит,
			|	1 КАК Группа
			|ПОМЕСТИТЬ ВременнаяТаблицаДанные
			|ИЗ
			|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
			|			&ДатаНачала,
			|			&ДатаОкончания,
			|			Авто,
			|			,
			|			Счет В (&СписокСчетов),
			|			,
			|			Организация = &Организация
			|				И Валюта = &Валюта) КАК ХозрасчетныйОстаткиИОбороты
			|ГДЕ
			|	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт <> 0
			|
			|СГРУППИРОВАТЬ ПО
			|	ХозрасчетныйОстаткиИОбороты.ПериодСекунда,
			|	ХозрасчетныйОстаткиИОбороты.Регистратор
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ХозрасчетныйОстаткиИОбороты.ПериодСекунда,
			|	ХозрасчетныйОстаткиИОбороты.Регистратор,
			|	СУММА(0),
			|	СУММА(ХозрасчетныйОстаткиИОбороты.СуммаОборотКт),
			|	2
			|ИЗ
			|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
			|			&ДатаНачала,
			|			&ДатаОкончания,
			|			Авто,
			|			,
			|			Счет В (&СписокСчетов),
			|			,
			|			Организация = &Организация
			|				И Валюта = &Валюта) КАК ХозрасчетныйОстаткиИОбороты
			|ГДЕ
			|	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт <> 0
			|
			|СГРУППИРОВАТЬ ПО
			|	ХозрасчетныйОстаткиИОбороты.Регистратор,
			|	ХозрасчетныйОстаткиИОбороты.ПериодСекунда
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВременнаяТаблицаДанные.Дата КАК Дата,
			|	ВременнаяТаблицаДанные.Документ КАК Документ,
			|	СУММА(ВременнаяТаблицаДанные.Дебет) КАК Дебет,
			|	СУММА(ВременнаяТаблицаДанные.Кредит) КАК Кредит,
			|	ВременнаяТаблицаДанные.Группа КАК Группа
			|ИЗ
			|	ВременнаяТаблицаДанные КАК ВременнаяТаблицаДанные
			|
			|СГРУППИРОВАТЬ ПО
			|	ВременнаяТаблицаДанные.Документ,
			|	ВременнаяТаблицаДанные.Дата,
			|	ВременнаяТаблицаДанные.Группа
			|
			|УПОРЯДОЧИТЬ ПО
			|	Дата,
			|	Документ,
			|	Группа";

	Иначе 		
		ЗапросТекст = 
			"ВЫБРАТЬ
			|	ХозрасчетныйОстаткиИОбороты.ПериодСекунда КАК Дата,
			|	ХозрасчетныйОстаткиИОбороты.Регистратор КАК Документ,
			|	СУММА(ХозрасчетныйОстаткиИОбороты.ВалютнаяСуммаОборотДт) КАК Дебет,
			|	СУММА(0) КАК Кредит,
			|	1 КАК Группа
			|ПОМЕСТИТЬ ВременнаяТаблицаДанные
			|ИЗ
			|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
			|			&ДатаНачала,
			|			&ДатаОкончания,
			|			Авто,
			|			,
			|			Счет В (&СписокСчетов),
			|			,
			|			Организация = &Организация
			|				И Валюта = &Валюта
			|				И Субконто1 = &Контрагент
			|				И Субконто2 = &Договор) КАК ХозрасчетныйОстаткиИОбороты
			|ГДЕ
			|	ХозрасчетныйОстаткиИОбороты.ВалютнаяСуммаОборотДт <> 0
			|
			|СГРУППИРОВАТЬ ПО
			|	ХозрасчетныйОстаткиИОбороты.Регистратор,
			|	ХозрасчетныйОстаткиИОбороты.ПериодСекунда
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ХозрасчетныйОстаткиИОбороты.ПериодСекунда,
			|	ХозрасчетныйОстаткиИОбороты.Регистратор,
			|	СУММА(0),
			|	СУММА(ХозрасчетныйОстаткиИОбороты.ВалютнаяСуммаОборотКт),
			|	2
			|ИЗ
			|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
			|			&ДатаНачала,
			|			&ДатаОкончания,
			|			Авто,
			|			,
			|			Счет В (&СписокСчетов),
			|			,
			|			Организация = &Организация
			|				И Валюта = &Валюта
			|				И Субконто1 = &Контрагент
			|				И Субконто2 = &Договор) КАК ХозрасчетныйОстаткиИОбороты
			|ГДЕ
			|	ХозрасчетныйОстаткиИОбороты.ВалютнаяСуммаОборотКт <> 0
			|
			|СГРУППИРОВАТЬ ПО
			|	ХозрасчетныйОстаткиИОбороты.Регистратор,
			|	ХозрасчетныйОстаткиИОбороты.ПериодСекунда
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВременнаяТаблицаДанные.Дата КАК Дата,
			|	ВременнаяТаблицаДанные.Документ КАК Документ,
			|	СУММА(ВременнаяТаблицаДанные.Дебет) КАК Дебет,
			|	СУММА(ВременнаяТаблицаДанные.Кредит) КАК Кредит,
			|	ВременнаяТаблицаДанные.Группа КАК Группа
			|ИЗ
			|	ВременнаяТаблицаДанные КАК ВременнаяТаблицаДанные
			|
			|СГРУППИРОВАТЬ ПО
			|	ВременнаяТаблицаДанные.Дата,
			|	ВременнаяТаблицаДанные.Документ,
			|	ВременнаяТаблицаДанные.Группа
			|
			|УПОРЯДОЧИТЬ ПО
			|	Дата,
			|	Документ,
			|	Группа";			
		Если ДоговорКонтрагента.Пустая() Тогда
			ЗапросТекст = СтрЗаменить(ЗапросТекст, "И Субконто2 = &Договор", "");
		КонецЕсли;
		
		Если ВалютаСверки.Пустая() Тогда
			ЗапросТекст = СтрЗаменить(ЗапросТекст, "И Валюта = &Валюта", "");		
		КонецЕсли;			
	КонецЕсли;
	
		Запрос.Текст = ЗапросТекст;
		Запрос.УстановитьПараметр("Организация", 	Организация);
		Запрос.УстановитьПараметр("Контрагент", 	Контрагент);
		Запрос.УстановитьПараметр("Договор", 		ДоговорКонтрагента);
		Запрос.УстановитьПараметр("ДатаНачала", 	НачалоДня(ДатаНачала));
		Запрос.УстановитьПараметр("ДатаОкончания", 	КонецДня(ДатаОкончания));
		Запрос.УстановитьПараметр("СписокСчетов",	ФильтрСписокСчетов);
		Запрос.УстановитьПараметр("Валюта",   		ВалютаСверки);
		
		Выборка = Запрос.Выполнить().Выбрать();
	
		Пока Выборка.Следующий() Цикл 
			СТЧ = ПоДаннымОрганизации.Добавить();
			СТЧ.ДокументСверки = Выборка.Документ;
			
			Если Выборка.Дебет-Выборка.Кредит > 0 Тогда 
				СТЧ.СуммаДт = Выборка.Дебет-Выборка.Кредит;
			Иначе 
				СТЧ.СуммаКт = Выборка.Кредит-Выборка.Дебет;
			КонецЕсли;
			
		КонецЦикла;
		Если Запрос.Выполнить().Пустой() Тогда 
			ТекстСообщения = НСтр("ru = 'Проверьте правильность заполнения контрагента и договора, для введенных данных за указанный период нет никаких операций.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		КонецЕсли;
		
		ПоДаннымОрганизации.Сортировать("ДокументСверки");
КонецПроцедуры

#КонецОбласти

#КонецЕсли