#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	// Определение базовых и ведущих
	Если СпособРасчета = ПредопределенноеЗначение("Перечисление.СпособыРасчетаУдержаний.ФиксированнойСуммой") Тогда 
		БазовыеВидыРасчета.Очистить();
		ВедущиеВидыРасчета.Очистить();
		
		РасчетЗаМинусомПН = Ложь;
		РасчетЗаМинусомСФ = Ложь;
		РасчетЗаМинусомПрофВзнос = Ложь;
	КонецЕсли;
	
	// Определение ТребуетсяРасчетБазы 
	ТребуетсяРасчетБазы = НЕ БазовыеВидыРасчета.Количество() = 0;
	
	// Определение ТребуетсяРасчетВремени 
	ТребуетсяРасчетВремени = Ложь;
	
	// Определение для ПроизвольнаяФормула
	
	// Определение Категории
	КатегорияРасчета = ПредопределенноеЗначение("Перечисление.КатегорииРасчетов.Первичное");
КонецПроцедуры

// Процедура - обработчик события ОбработкаПроверкиЗаполнения объекта.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если СпособРасчета = ПредопределенноеЗначение("Перечисление.СпособыРасчетаУдержаний.Процентом") Тогда 
		ПроверяемыеРеквизиты.Добавить("БазовыеВидыРасчета");		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецЕсли


