#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыПроведенияДокумента

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаТарифы(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВТ_Шапка.Дата КАК Период,
		|	ВТ_Шапка.Организация КАК Организация,
		|	ВременнаяТаблицаТарифыКомандировочных.Страна КАК Страна,
		|	ВременнаяТаблицаТарифыКомандировочных.Город КАК Город,
		|	ВременнаяТаблицаТарифыКомандировочных.Валюта КАК Валюта,
		|	ВременнаяТаблицаТарифыКомандировочных.Суточные КАК СуммаСуточные,
		|	ВременнаяТаблицаТарифыКомандировочных.Проживание КАК СуммаПроживание,
		|	ВременнаяТаблицаТарифыКомандировочных.Проездные КАК СуммаПроездные
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВТ_Шапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаТарифыКомандировочных КАК ВременнаяТаблицаТарифыКомандировочных
		|		ПО (ИСТИНА)";
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаТарифыКомандировочных", РезультатЗапроса.Выгрузить());
КонецПроцедуры // СформироватьТаблицаСотрудники()

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	УстановкаТарифовКомандировочных.Ссылка,
		|	УстановкаТарифовКомандировочных.Дата,
		|	УстановкаТарифовКомандировочных.Организация
		|ПОМЕСТИТЬ ВременнаяТаблицаШапка
		|ИЗ
		|	Документ.УстановкаТарифовКомандировочных КАК УстановкаТарифовКомандировочных
		|ГДЕ
		|	УстановкаТарифовКомандировочных.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УстановкаТарифовКомандировочныхТарифы.Страна,
		|	УстановкаТарифовКомандировочныхТарифы.Город,
		|	УстановкаТарифовКомандировочныхТарифы.Валюта,
		|	УстановкаТарифовКомандировочныхТарифы.Суточные,
		|	УстановкаТарифовКомандировочныхТарифы.Проживание,
		|	УстановкаТарифовКомандировочныхТарифы.Проездные
		|ПОМЕСТИТЬ ВременнаяТаблицаТарифыКомандировочных
		|ИЗ
		|	Документ.УстановкаТарифовКомандировочных.Тарифы КАК УстановкаТарифовКомандировочныхТарифы
		|ГДЕ
		|	УстановкаТарифовКомандировочныхТарифы.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Выполнить();
	
	СформироватьТаблицаТарифы(ДокументСсылка, СтруктураДополнительныеСвойства);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

#КонецОбласти

#Область ВерсионированиеОбъектов

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#КонецЕсли