#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВалютаРегламентированногоУчета = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
	Валюта = ВалютаРегламентированногоУчета;
		
	// РаботаСФормами
	РаботаСФормамиСервер.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец РаботаСФормами	

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидНачисленияПриИзменении(Элемент)

	// Установить видимость и доступность элементов формы
	УстановитьВидимостьДоступностьЭлементов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьТЧ(Команда)
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("ВидРасчета", ВидРасчета);
	СтруктураДанные.Вставить("Валюта", Валюта);
	СтруктураДанные.Вставить("Размер", Размер);

	Оповестить("ВыборНачисления", СтруктураДанные, ВладелецФормы);
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура устанавливает видимость и доступность элементов.
//
&НаСервере
Процедура УстановитьВидимостьДоступностьЭлементов()
	
	Если ВидРасчета.СпособРасчета = Перечисления.СпособыРасчетаНачислений.Процентом Тогда 
		Валюта = ВалютаРегламентированногоУчета;
		Элементы.Валюта.ТолькоПросмотр = Истина;
	Иначе 
		Элементы.Валюта.ТолькоПросмотр = Ложь;
	КонецЕсли;	
	
КонецПроцедуры // УстановитьВидимостьДоступностьЭлементов()

#КонецОбласти