#Область ОбработчикиСобытийФормы

// Процедура - обработчик события ПриСозданииНаСервере.
// В процедуре осуществляется
// - инициализация реквизитов формы,
// - установка параметров функциональных опций формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

	Если Объект.Владелец.Пустая() Тогда // Возможно, вручную создают
		Элементы.Владелец.ТолькоПросмотр = Ложь;
	Иначе
		Элементы.Владелец.ТолькоПросмотр = Истина;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
