
#Область ОбработчикиСобытийФормы

// Процедура - обработчик события ПриСозданииНаСервере.
// В процедуре осуществляется
// - инициализация реквизитов формы,
// - установка параметров функциональных опций формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Стоимость = Параметры.Стоимость;
	
	УстановитьДоступность(Параметры.КешНастройкиПодбора);
	
	Элементы.ДекорацияСумма.Заголовок = 
		ОбщегоНазначенияБПКлиентСервер.СуммаФорматированнойСтрокой(Стоимость);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтоимостьПриИзменении(Элемент)
	ОбновитьНадписьИтоговаяСумма();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	Закрыть(Новый Структура("Стоимость", Стоимость));
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьДоступность(Параметры)
	РазрешеноИзменятьСтоимость = ?(Параметры.ЗапрашиватьСтоимость, Параметры.РазрешеноИзменятьСтоимость, Параметры.ЗапрашиватьСтоимость);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Стоимость", "Доступность", РазрешеноИзменятьСтоимость);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНадписьИтоговаяСумма()
	Элементы.ДекорацияСумма.Заголовок = 
		ОбщегоНазначенияБПКлиентСервер.СуммаФорматированнойСтрокой(Стоимость);
КонецПроцедуры

#КонецОбласти
