#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает массив разделов монитора руководителя по умолчанию
// Возвращаемое значение:
// Массив - Список разделов монитора руководителя доступных по умолчанию
Функция РазделыМонитораРуководителяПоУмолчанию() Экспорт
	
	РазделыПоУмолчанию = Новый Массив;
	РазделыПоУмолчанию.Добавить(ОстаткиДенежныхСредств);
	РазделыПоУмолчанию.Добавить(ПоступлениеДенежныхСредств);
	РазделыПоУмолчанию.Добавить(РасходДенежныхСредств);
	РазделыПоУмолчанию.Добавить(ПродажиПоКонтрагентам);
	РазделыПоУмолчанию.Добавить(ЗадолженностьПокупателей);
	РазделыПоУмолчанию.Добавить(ЗадолженностьПоставщикам);
	
	Возврат РазделыПоУмолчанию;
	
КонецФункции

// Возвращает массив оборотных разделов монитора руководителя
// Возвращаемое значение:
// Массив - Список оборотных разделов монитора руководителя
Функция ОборотныеРазделы() Экспорт
	
	ОборотныеРазделы = Новый Массив;
	ОборотныеРазделы.Добавить(ПоступлениеДенежныхСредств);
	ОборотныеРазделы.Добавить(РасходДенежныхСредств);
	ОборотныеРазделы.Добавить(ПродажиПоКонтрагентам);
	ОборотныеРазделы.Добавить(ПродажиПоНоменклатурнымГруппам);
	
	Возврат ОборотныеРазделы;
	
КонецФункции

// Определяет перечень разделов, к данным которых у пользователя есть доступ.
// 
// Возвращаемое значение:
//  ФиксированныйМассив - содержит элементы перечисления
//
Функция РазрешенныеПользователюРазделы() Экспорт
	
	РазрешенныеРазделы = Новый Массив;
	
	ПолноправныйПользователь = Пользователи.ЭтоПолноправныйПользователь( , , Ложь);
	
	Для Каждого МетаданныеЗначения Из Метаданные.Перечисления.РазделыМонитораРуководителя.ЗначенияПеречисления Цикл
		
		Раздел = Перечисления.РазделыМонитораРуководителя[МетаданныеЗначения.Имя];
		
		Если Не ПолноправныйПользователь И Не ДанныеРазделаДоступны(Раздел) Тогда
			Продолжить;
		КонецЕсли;
		
		РазрешенныеРазделы.Добавить(Раздел);
		
	КонецЦикла;
	
	Возврат Новый ФиксированныйМассив(РазрешенныеРазделы);
	
КонецФункции

// Проверяет достаточность прав пользователя для просмотра данных раздела монитора руководителя.
// Эти права определяются правами пользователя на просмотр исходных данных,
// на основании которых рассчитаны показатели монитора руководителя.
//
// Может быть вызвана в привилегированном режиме.
//
// Параметры:
//  Раздел	 - ПеречислениеСсылка.РазделыМонитораРуководителя - раздел монитора,
//             доступ к данным раздела которого проверяется
// 
// Возвращаемое значение:
//  Булево - Истина, если данные раздела доступны пользователю.
//
Функция ДанныеРазделаДоступны(Раздел) Экспорт
	
	// Может быть вызвана в привилегированном режиме.
	// В этом случае в ПравоДоступа() следует указывать параметр Пользователь.
	// Но может быть вызвана и вне привилегированного режима.
	// В этом случае параметр Пользователь указывать не следует.
	// Чтобы не делать две ветки, устанавливаем привилегированный режим.
	//УстановитьПривилегированныйРежим(Истина);
	
	Возврат Истина;	
КонецФункции

#КонецОбласти

#КонецЕсли