
#Область ОбработчикиСобытийФормы

// Процедура - обработчик события ПриСозданииНаСервере.
// В процедуре осуществляется
// - инициализация реквизитов формы,
// - установка параметров функциональных опций формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ДатаНачала") И Параметры.Свойство("ДатаОкончания") Тогда
		ДатаНачала 		= Параметры.ДатаНачала;
		ДатаОкончания 	= Параметры.ДатаОкончания;
	Иначе
		Дата = ТекущаяДатаСеанса();		
		ДатаНачала 		= НачалоГода(Дата);
		ДатаОкончания 	= КонецМесяца(Дата);
	КонецЕсли;
	
	Если Параметры.Свойство("Организация") Тогда 
		Организация = Параметры.Организация;
	Иначе                            
		Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	КонецЕсли;
	
	ПолучитьТаблицуРасшифровкиПоСобытиямОСНаСервере();
	ЗаполнитьНастройки();
	
	ДобавитьПорядок(ВыработкаОС.Порядок);
	ДобавитьПорядок(ДвижениеОСНУ.Порядок);
	ДобавитьПорядок(ЗемельныйНалог.Порядок);
	ДобавитьПорядок(МестонахождениеОС.Порядок);
	//ДобавитьПорядок(НалоговаяАмортизация.Порядок);
	//ДобавитьПорядок(ПараметрыРасчетаЗемельногоНалога.Порядок);
	ДобавитьПорядок(ПараметрыУчетаОС.Порядок);
	ДобавитьПорядок(ПродажиОсновныхСредств.Порядок);
	ДобавитьПорядок(СведенияОбИмуществе.Порядок);
	ДобавитьПорядок(СведенияПоНалогуНаИмущество.Порядок);
	ДобавитьПорядок(СобытияОС.Порядок);
	ДобавитьПорядок(СоставОС.Порядок);
	ДобавитьПорядок(СостоянияОС.Порядок);

	
	// Установить видимость и доступность элементов формы
	УстановитьВидимостьДоступностьЭлементов();
КонецПроцедуры

// Процедура - обработчик события ПриОткрытии.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьПараметрыДинамическихСписков();
	ОбновитьПодвалыЗакладок();
	ПодключитьОбработчикОжидания("ОбновитьОтборДинамическихСписков", 0.2, Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиРеквизитовШапки

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Отказ = Ложь;
	
	ПроверитьПериод(Отказ);
	
	Если НЕ Отказ Тогда
		УстановитьПараметрыДинамическихСписков();
		ОбновитьПодвалыЗакладок();
		
		ФормированиеНалогаНаИмущество();
		ПолучитьТаблицуРасшифровкиПоСобытиямОСНаСервере();	
		УстановитьОтборНаРасшифровку();
		УстановитьВидимостьДоступностьЭлементов();
		
		ЗаполнитьНастройки(Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	Отказ = Ложь;
	
	ПроверитьПериод(Отказ);
	
	Если НЕ Отказ Тогда
		УстановитьПараметрыДинамическихСписков();
		ОбновитьПодвалыЗакладок();

		ПолучитьТаблицуРасшифровкиПоСобытиямОСНаСервере();
		УстановитьОтборНаРасшифровку();
		УстановитьВидимостьДоступностьЭлементов();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	
	Отказ = Ложь;
	
	ПроверитьПериод(Отказ);
	
	Если НЕ Отказ Тогда
		УстановитьПараметрыДинамическихСписков();
		ОбновитьПодвалыЗакладок();
		
		ПолучитьТаблицуРасшифровкиПоСобытиямОСНаСервере();
		УстановитьОтборНаРасшифровку();	
		УстановитьВидимостьДоступностьЭлементов();
		
		ЗаполнитьНастройки(Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВсеОсновныеСредстваПриИзменении(Элемент)
	
	ПодключитьОбработчикОжидания("ОбновитьОтборДинамическихСписков", 0.2, Истина);
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении флажка ВключатьЗакрытиеМесяца.
//
&НаКлиенте
Процедура ВключатьЗакрытиеМесяцаПриИзменении(Элемент)	
	РасшифровкаПоСобытиямОС.Очистить();
	ПолучитьТаблицуРасшифровкиПоСобытиямОСНаСервере();
	УстановитьОтборНаРасшифровку();
	
	УстановитьВидимостьДоступностьЭлементов();
КонецПроцедуры

// Процедура - обработчик события ПриИзменении флажка ТолькоЗакрытиеМесяца.
//
&НаКлиенте
Процедура ТолькоЗакрытиеМесяцаПриИзменении(Элемент)
	РасшифровкаПоСобытиямОС.Очистить();
	ПолучитьТаблицуРасшифровкиПоСобытиямОСНаСервере();
	УстановитьОтборНаРасшифровку();
	УстановитьВидимостьДоступностьЭлементов();
	
	РассчитатьИтогАмортизацииЗаМесяц(Новый Структура("ОсновноеСредство", ОсновноеСредство));
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВсеДокументыПриИзменении(Элемент)
	
	УстановитьОтборНаРасшифровку();	
	УстановитьВидимостьДоступностьЭлементов();	
КонецПроцедуры

&НаКлиенте
Процедура ОсновноеСредствоПриИзменении(Элемент)
	УстановитьОтбор();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОтборов

// Процедура - обработчик события ПриИзменении поля ввода ОтборГруппаНУ.
//
&НаКлиенте
Процедура ОтборГруппаНУПриИзменении(Элемент)
	ПодключитьОбработчикОжидания("ОбновитьОтборДинамическихСписков", 0.2, Истина);
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода ОтборСчетБУ.
//
&НаКлиенте
Процедура ОтборСчетБУПриИзменении(Элемент)
	ПодключитьОбработчикОжидания("ОбновитьОтборДинамическихСписков", 0.2, Истина);
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода ОтборПодразделение.
//
&НаКлиенте
Процедура ОтборПодразделениеПриИзменении(Элемент)
	ПодключитьОбработчикОжидания("ОбновитьОтборДинамическихСписков", 0.2, Истина);
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода ОтборМОЛ.
//
&НаКлиенте
Процедура ОтборМОЛПриИзменении(Элемент)
	ПодключитьОбработчикОжидания("ОбновитьОтборДинамическихСписков", 0.2, Истина);
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода ОтборСостояние.
//
&НаКлиенте
Процедура ОтборСостояниеПриИзменении(Элемент)
	ПодключитьОбработчикОжидания("ОбновитьОтборДинамическихСписков", 0.2, Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикСобытийЭлементаСтраницыОбработки

&НаКлиенте
Процедура СтраницыОбработкиПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	УстановитьВидимостьДоступностьЭлементов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокОС

&НаКлиенте
Процедура СписокОСВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОсновноеСредство = Элементы.СписокОС.ТекущиеДанные.ОсновноеСредство;
	ПараметрыФормы 	= Новый Структура("Ключ", ОсновноеСредство);
	ОткрытьФорму("Справочник.ОсновныеСредства.Форма.ФормаЭлемента", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОСПриАктивизацииСтроки(Элемент)
	ТекущиеДанныеСписокОС = Элементы.СписокОС.ТекущиеДанные;
	
	Если ТекущиеДанныеСписокОС = Неопределено Тогда
		ОсновноеСредство 				= Неопределено;
		НадписьСобытиеИДата				= "";
		НадписьМетодИзноса				= "";
		НадписьПервоначальнаяСтоимость	= "";
		НадписьНакопленныйИзнос 		= "";
		НадписьБазаАмортизации			= "";             
	Иначе 		
		ОсновноеСредство 				= ТекущиеДанныеСписокОС.ОсновноеСредство;
		НадписьСобытиеИДата				= СтрШаблон(НСтр("ru = 'Событие: %1;  ВЭ: %2'"), ТекущиеДанныеСписокОС.Событие,
															Формат(ТекущиеДанныеСписокОС.ПериодСобытия, "ДЛФ=D"));											
		НадписьМетодИзноса				= СтрШаблон(НСтр("ru = 'Метод износа: %1'"), ТекущиеДанныеСписокОС.МетодИзноса);
		НадписьПервоначальнаяСтоимость	= СтрШаблон(НСтр("ru = 'Первоначальная стоимость: %1'"), ТекущиеДанныеСписокОС.ПервоначальнаяСтоимость);
		НадписьНакопленныйИзнос 		= СтрШаблон(НСтр("ru = 'Накопленный износ: %1'"), ?(ТекущиеДанныеСписокОС.СуммаАмортизация < 0, 
													-ТекущиеДанныеСписокОС.СуммаАмортизация, ТекущиеДанныеСписокОС.СуммаАмортизация));
		НадписьБазаАмортизации			= СтрШаблон(НСтр("ru = 'База амортизации: %1'"), ТекущиеДанныеСписокОС.БазаАмортизации);
	КонецЕсли;	
	
	УстановитьОтборНаРасшифровку();
	УстановитьВидимостьДоступностьЭлементов();
	
	ПодключитьОбработчикОжидания("ОбновитьОтборДинамическихСписков", 0.2, Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРасшифровкаПоСобытиямОС

&НаКлиенте
Процедура РасшифровкаПоСобытиямОСПриАктивизацииСтроки(Элемент)
	
	СтрокаТаблицы = Элементы.РасшифровкаПоСобытиямОС.ТекущиеДанные;	
	
	Если СтрокаТаблицы <> Неопределено Тогда
		
		Если Тип("ДокументСсылка.МодернизацияОС") = ТипЗнч(СтрокаТаблицы.Документ) Тогда
			Элементы.СписокДокументовМодернизации.ОтборСтрок = Новый ФиксированнаяСтруктура("ДокументМодернизации", СтрокаТаблицы.Документ);			
		Иначе
			Элементы.СписокДокументовМодернизации.ОтборСтрок = Новый ФиксированнаяСтруктура("ДокументМодернизации", ПредопределенноеЗначение("Документ.МодернизацияОС.ПустаяСсылка"));			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПоСобытиямОСВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СсылкаДокумента = Элементы.РасшифровкаПоСобытиямОС.ТекущиеДанные.Документ;
	НазваниеДокумента = ПолучитьНазваниеДокумента(СсылкаДокумента);
	ПараметрыФормы 	= Новый Структура("Ключ", СсылкаДокумента);
	ОткрытьФорму("Документ." + НазваниеДокумента + ".ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокДокументовМодернизации

&НаКлиенте
Процедура СписокДокументовМодернизацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СсылкаДокумента = Элементы.СписокДокументовМодернизации.ТекущиеДанные.Документ;
	НазваниеДокумента = ПолучитьНазваниеДокумента(СсылкаДокумента);
	ПараметрыФормы 	= Новый Структура("Ключ", СсылкаДокумента);
	ОткрытьФорму("Документ." + НазваниеДокумента + ".ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокОСТранспорт

&НаКлиенте
Процедура СписокОСТранспортПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.СписокОСТранспорт.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		Отбор = Новый Структура();
		Отбор.Вставить("ОсновноеСредство", ТекущиеДанные.ОсновноеСредство);
		
		СписокПараметровТранспорт.Очистить();
		МассивСтрок = Объект.Транспорт.НайтиСтроки(Отбор);
		
		Если МассивСтрок.Количество() > 0 Тогда		
			СтрокаТабличнойЧасти = МассивСтрок[0];
			
			СтрокаТаблицы = СписокПараметровТранспорт.Добавить();
			СтрокаТаблицы.Параметр = "Дата ввода";
			СтрокаТаблицы.Значение = Формат(СтрокаТабличнойЧасти.ДатаВводаВЭксплуатацию, "ДЛФ=D");
			
			СтрокаТаблицы = СписокПараметровТранспорт.Добавить();
			СтрокаТаблицы.Параметр = "Начисление с даты";
			СтрокаТаблицы.Значение = Формат(СтрокаТабличнойЧасти.НачислениеНИСДаты, "ДЛФ=D");
			
			СтрокаТаблицы = СписокПараметровТранспорт.Добавить();
			СтрокаТаблицы.Параметр = "Выбытие";
			СтрокаТаблицы.Значение = Формат(СтрокаТабличнойЧасти.ДатаВыбытия, "ДЛФ=D");
			
			СтрокаТаблицы = СписокПараметровТранспорт.Добавить();
			СтрокаТаблицы.Параметр = "Лет эксплуатации";
			СтрокаТаблицы.Значение = Формат(СтрокаТабличнойЧасти.КоличествоЛетЭксплуатации, "ЧГ=0");
			
			СтрокаТаблицы = СписокПараметровТранспорт.Добавить();
			СтрокаТаблицы.Параметр = "Ставка за см3, сом";
			СтрокаТаблицы.Значение = СтрокаТабличнойЧасти.Ставка;
			
			СтрокаТаблицы = СписокПараметровТранспорт.Добавить();
			СтрокаТаблицы.Параметр = "Объем двигателя, см3";
			СтрокаТаблицы.Значение = СтрокаТабличнойЧасти.ОбъемДвигателя;
			
			СтрокаТаблицы = СписокПараметровТранспорт.Добавить();
			СтрокаТаблицы.Параметр = "Категория";
			СтрокаТаблицы.Значение = СтрокаТабличнойЧасти.ВидТранспортаКатегорияАБВ;
			
			СтрокаТаблицы = СписокПараметровТранспорт.Добавить();
			СтрокаТаблицы.Параметр = "Налог";
			СтрокаТаблицы.Значение = СтрокаТабличнойЧасти.СуммаНалога;
		КонецЕсли;	
		
		Элементы.СписокДокументовТранспорт.ОтборСтрок = Новый ФиксированнаяСтруктура("ОсновноеСредство", ТекущиеДанные.ОсновноеСредство);
		
	Иначе	
		Элементы.СписокДокументовТранспорт.ОтборСтрок = Новый ФиксированнаяСтруктура("ОсновноеСредство", ПредопределенноеЗначение("Справочник.ОсновныеСредства.ПустаяСсылка"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокОСТранспортВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОсновноеСредство = Элементы.СписокОСТранспорт.ТекущиеДанные.ОсновноеСредство;
	ПараметрыФормы 	= Новый Структура("Ключ", ОсновноеСредство);
	ОткрытьФорму("Справочник.ОсновныеСредства.Форма.ФормаЭлемента", ПараметрыФормы);	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокДокументовТранспорт

&НаКлиенте
Процедура СписокДокументовТранспортВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СсылкаДокумента = Элементы.СписокДокументовТранспорт.ТекущиеДанные.Документ;
	НазваниеДокумента = ПолучитьНазваниеДокумента(СсылкаДокумента);
	ПараметрыФормы 	= Новый Структура("Ключ", СсылкаДокумента);
	ОткрытьФорму("Документ." + НазваниеДокумента + ".ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокОСНедвижимость

&НаКлиенте
Процедура СписокОСНедвижимостьПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.СписокОСНедвижимость.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		Отбор = Новый Структура();
		Отбор.Вставить("ОсновноеСредство", ТекущиеДанные.ОсновноеСредство);
		
		СписокПараметровНедвижимость.Очистить();
		МассивСтрок = Объект.Недвижимость.НайтиСтроки(Отбор);
		
		Если МассивСтрок.Количество() > 0 Тогда		
			СтрокаТабличнойЧасти = МассивСтрок[0];
			
			СтрокаТаблицы = СписокПараметровНедвижимость.Добавить();
			СтрокаТаблицы.Параметр = "Дата ввода";
			СтрокаТаблицы.Значение = Формат(СтрокаТабличнойЧасти.ДатаВводаВЭксплуатацию, "ДЛФ=D");
			
			СтрокаТаблицы = СписокПараметровНедвижимость.Добавить();
			СтрокаТаблицы.Параметр = "Начисление с даты";
			СтрокаТаблицы.Значение = Формат(СтрокаТабличнойЧасти.ДатаНачисленияНалогаНаИмущество, "ДЛФ=D");
			
			СтрокаТаблицы = СписокПараметровНедвижимость.Добавить();
			СтрокаТаблицы.Параметр = "Выбытие";
			СтрокаТаблицы.Значение = Формат(СтрокаТабличнойЧасти.ДатаВыбытия, "ДЛФ=D");
			
			СтрокаТаблицы = СписокПараметровНедвижимость.Добавить();
			СтрокаТаблицы.Параметр = "Общая площадь";
			СтрокаТаблицы.Значение = СтрокаТабличнойЧасти.ОбщаяПлощадь;
			
			СтрокаТаблицы = СписокПараметровНедвижимость.Добавить();
			СтрокаТаблицы.Параметр = "Лет эксплуатации";
			СтрокаТаблицы.Значение = Формат(СтрокаТабличнойЧасти.КоличествоЛетЭксплуатации, "ЧГ=0");
			
			СтрокаТаблицы = СписокПараметровНедвижимость.Добавить();
			СтрокаТаблицы.Параметр = "Налогооблагаемая (оценочная) стоимость за 1 кв.м";
			СтрокаТаблицы.Значение = СтрокаТабличнойЧасти.ОценочнаяСтоимость;
			
			СтрокаТаблицы = СписокПараметровНедвижимость.Добавить();
			СтрокаТаблицы.Параметр = "Кр";
			СтрокаТаблицы.Значение = СтрокаТабличнойЧасти.Кр;
			
			СтрокаТаблицы = СписокПараметровНедвижимость.Добавить();
			СтрокаТаблицы.Параметр = "Кз";
			СтрокаТаблицы.Значение = СтрокаТабличнойЧасти.Кз;
			
			СтрокаТаблицы = СписокПараметровНедвижимость.Добавить();
			СтрокаТаблицы.Параметр = "Ко";
			СтрокаТаблицы.Значение = СтрокаТабличнойЧасти.Ко;
			
			СтрокаТаблицы = СписокПараметровНедвижимость.Добавить();
			СтрокаТаблицы.Параметр = "Количество месяцев эксплуатации";
			СтрокаТаблицы.Значение = СтрокаТабличнойЧасти.КоличествоМесяцевЭксплуатации;
			
			СтрокаТаблицы = СписокПараметровНедвижимость.Добавить();
			СтрокаТаблицы.Параметр = "Стоимость";
			СтрокаТаблицы.Значение = СтрокаТабличнойЧасти.СтоимостьНУ;
			
			СтрокаТаблицы = СписокПараметровНедвижимость.Добавить();
			СтрокаТаблицы.Параметр = "Ставка";
			СтрокаТаблицы.Значение = СтрокаТабличнойЧасти.Ставка;
			
			СтрокаТаблицы = СписокПараметровНедвижимость.Добавить();
			СтрокаТаблицы.Параметр = "Налог на имущество";
			СтрокаТаблицы.Значение = СтрокаТабличнойЧасти.СуммаНалога;
		КонецЕсли;	
		
		Элементы.СписокДокументовНедвижимость.ОтборСтрок = Новый ФиксированнаяСтруктура("ОсновноеСредство", ТекущиеДанные.ОсновноеСредство);
		
	Иначе	
		Элементы.СписокДокументовНедвижимость.ОтборСтрок = Новый ФиксированнаяСтруктура("ОсновноеСредство", ПредопределенноеЗначение("Справочник.ОсновныеСредства.ПустаяСсылка"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокОСНедвижимостьВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОсновноеСредство = Элементы.СписокОСНедвижимость.ТекущиеДанные.ОсновноеСредство;
	ПараметрыФормы 	= Новый Структура("Ключ", ОсновноеСредство);
	ОткрытьФорму("Справочник.ОсновныеСредства.Форма.ФормаЭлемента", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокДокументовНедвижимость

&НаКлиенте
Процедура СписокДокументовНедвижимостьВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СсылкаДокумента = Элементы.СписокДокументовНедвижимость.ТекущиеДанные.Документ;
	НазваниеДокумента = ПолучитьНазваниеДокумента(СсылкаДокумента);
	ПараметрыФормы 	= Новый Структура("Ключ", СсылкаДокумента);
	ОткрытьФорму("Документ." + НазваниеДокумента + ".ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПерепровестиДокументы(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтветНаВопросПерепровестиДокументы", ЭтотОбъект, Параметры);
	ТекстВопроса = НСтр("ru = 'Документы будут перепроведены. Продолжить?'");
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60);
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Отказ = Ложь;
	
	ПроверитьПериод(Отказ);
	
	Если НЕ Отказ Тогда
		УстановитьПараметрыДинамическихСписков();
		ОбновитьПодвалыЗакладок();
		ФормированиеНалогаНаИмущество();
		ПолучитьТаблицуРасшифровкиПоСобытиямОСНаСервере();
		УстановитьОтборНаРасшифровку();
		УстановитьВидимостьДоступностьЭлементов();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьРасшифровку(Команда)
	
	Если ПоказатьРезультатПерепроведения Тогда
		ПоказатьРезультатПерепроведения = Ложь;
		Элементы.ПоказатьРасшифровку.Заголовок = "Показать результат перепроведения";
	Иначе
		ПоказатьРезультатПерепроведения = Истина;
		Элементы.ПоказатьРасшифровку.Заголовок = "Показать расшифровку";
	КонецЕсли;	
	
	УстановитьВидимостьДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетВедомостьВыбытияОС(Команда)
	
	ОтборыОтчета = Новый Массив;

	ТекущиеДанные = Элементы.СписокОС.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		ОтборПоОС = Новый Структура;
		ОтборПоОС.Вставить("Поле",         "ОсновноеСредство");
		ОтборПоОС.Вставить("ВидСравнения", ВидСравненияКомпоновкиДанных.Равно);
		ОтборПоОС.Вставить("Значение",     ТекущиеДанные.ОсновноеСредство);
		
		ОтборыОтчета.Добавить(ОтборПоОС);	                                    
		
		Если ЗначениеЗаполнено(ТекущиеДанные.Подразделение) Тогда 
			ОтборПоПодразделению = Новый Структура;
			ОтборПоПодразделению.Вставить("Поле",         "Подразделение");
			ОтборПоПодразделению.Вставить("ВидСравнения", ВидСравненияКомпоновкиДанных.Равно);
			ОтборПоПодразделению.Вставить("Значение",     ТекущиеДанные.Подразделение);
			
			ОтборыОтчета.Добавить(ОтборПоПодразделению);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекущиеДанные.МОЛ) Тогда 
			ОтборПоМОЛ = Новый Структура;
			ОтборПоМОЛ.Вставить("Поле",         "МОЛ");
			ОтборПоМОЛ.Вставить("ВидСравнения", ВидСравненияКомпоновкиДанных.Равно);
			ОтборПоМОЛ.Вставить("Значение",     ТекущиеДанные.МОЛ);
			
			ОтборыОтчета.Добавить(ОтборПоМОЛ);
		КонецЕсли;
	КонецЕсли;
		
	ОткрытьОтчет("Отчет.ВедомостьВыбытияОС.Форма",,ОтборыОтчета,,,, ДатаНачала, КонецДня(ДатаОкончания));
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетВедомостьПередачиОС(Команда)
	
	стПериод = Новый СтандартныйПериод;
	стПериод.ДатаНачала = ДатаНачала;
	стПериод.ДатаОкончания = КонецДня(ДатаОкончания);
	
	ПользовательскиеНастройки = УстановитьПользовательскиеНастройкиОтчета("ВедомостьПередачиОС",Новый Структура("СтПериод", стПериод));
	
	УсловияОтбора = Новый Структура;
	
	Если ЗначениеЗаполнено(Организация) Тогда 
		УсловияОтбора.Вставить("Организация", Организация);
	КонецЕсли;
		
	ПараметрыФормы = Новый Структура("ПользовательскиеНастройки, Отбор, СформироватьПриОткрытии", ПользовательскиеНастройки, УсловияОтбора, Истина);
	ОткрытьФорму("Отчет.ВедомостьПередачиОС.Форма", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетВедомостьПеремещенияОС(Команда)
	
	стПериод = Новый СтандартныйПериод;
	стПериод.ДатаНачала = ДатаНачала;
	стПериод.ДатаОкончания = КонецДня(ДатаОкончания);
	
	ПользовательскиеНастройки = УстановитьПользовательскиеНастройкиОтчета("ВедомостьПеремещенияОС",Новый Структура("СтПериод", стПериод));
	
	УсловияОтбора = Новый Структура;
	
	Если ЗначениеЗаполнено(Организация) Тогда 
		УсловияОтбора.Вставить("Организация", Организация);
	КонецЕсли;
		
	ПараметрыФормы = Новый Структура("ПользовательскиеНастройки, Отбор, СформироватьПриОткрытии", ПользовательскиеНастройки, УсловияОтбора, Истина);
	ОткрытьФорму("Отчет.ВедомостьПеремещенияОС.Форма", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетВедомостьПоАмортизацииОС(Команда)
	
	ОткрытьОтчет("Отчет.ВедомостьПоАмортизацииОС.Форма",,,,,, ДатаНачала, КонецДня(ДатаОкончания));
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетВедомостьПоступленияОС(Команда)
	
	ОтборыОтчета = Новый Массив;

	ТекущиеДанные = Элементы.СписокОС.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		ОтборПоОС = Новый Структура;
		ОтборПоОС.Вставить("Поле",         "ОсновноеСредство");
		ОтборПоОС.Вставить("ВидСравнения", ВидСравненияКомпоновкиДанных.Равно);
		ОтборПоОС.Вставить("Значение",     ТекущиеДанные.ОсновноеСредство);
		
		ОтборыОтчета.Добавить(ОтборПоОС);	                                    
	КонецЕсли;
		
	ОткрытьОтчет("Отчет.ВедомостьПоступленияОС.Форма",,ОтборыОтчета,,,, ДатаНачала, КонецДня(ДатаОкончания));
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетВедомостьПринятияКУчетуОС(Команда)
	
	ОтборыОтчета = Новый Массив;

	ТекущиеДанные = Элементы.СписокОС.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		ОтборПоОС = Новый Структура;
		ОтборПоОС.Вставить("Поле",         "ОсновноеСредство");
		ОтборПоОС.Вставить("ВидСравнения", ВидСравненияКомпоновкиДанных.Равно);
		ОтборПоОС.Вставить("Значение",     ТекущиеДанные.ОсновноеСредство);
		
		ОтборыОтчета.Добавить(ОтборПоОС);	                                    
		
		Если ЗначениеЗаполнено(ТекущиеДанные.Подразделение) Тогда 
			ОтборПоПодразделению = Новый Структура;
			ОтборПоПодразделению.Вставить("Поле",         "ОсновноеСредство.Подразделение");
			ОтборПоПодразделению.Вставить("ВидСравнения", ВидСравненияКомпоновкиДанных.Равно);
			ОтборПоПодразделению.Вставить("Значение",     ТекущиеДанные.Подразделение);
			
			ОтборыОтчета.Добавить(ОтборПоПодразделению);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекущиеДанные.МОЛ) Тогда 
			ОтборПоМОЛ = Новый Структура;
			ОтборПоМОЛ.Вставить("Поле",         "ОсновноеСредство.МОЛ");
			ОтборПоМОЛ.Вставить("ВидСравнения", ВидСравненияКомпоновкиДанных.Равно);
			ОтборПоМОЛ.Вставить("Значение",     ТекущиеДанные.МОЛ);
			
			ОтборыОтчета.Добавить(ОтборПоМОЛ);
		КонецЕсли;
	КонецЕсли;
		
	ОткрытьОтчет("Отчет.ВедомостьПринятияКУчетуОС.Форма",,ОтборыОтчета,,,, ДатаНачала, КонецДня(ДатаОкончания));
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетВедомостьОС(Команда)
	
	ОтборыОтчета = Новый Массив;

	ТекущиеДанные = Элементы.СписокОС.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		ОтборПоОС = Новый Структура;
		ОтборПоОС.Вставить("Поле",         "ОсновноеСредство");
		ОтборПоОС.Вставить("ВидСравнения", ВидСравненияКомпоновкиДанных.Равно);
		ОтборПоОС.Вставить("Значение",     ТекущиеДанные.ОсновноеСредство);
		
		ОтборыОтчета.Добавить(ОтборПоОС);	                                    
	КонецЕсли;
		
	ОткрытьОтчет("Отчет.ВедомостьОС.Форма",,ОтборыОтчета,,,, ДатаНачала, КонецДня(ДатаОкончания));
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетЖурналОС(Команда)
	
	стПериод = Новый СтандартныйПериод;
	стПериод.ДатаНачала = ДатаНачала;
	стПериод.ДатаОкончания = КонецДня(ДатаОкончания);
	
	ПользовательскиеНастройки = УстановитьПользовательскиеНастройкиОтчета("ЖурналОС",Новый Структура("СтПериод", стПериод));
	
	УсловияОтбора = Новый Структура;
	
	Если ЗначениеЗаполнено(Организация) Тогда 
		УсловияОтбора.Вставить("Организация", Организация);
	КонецЕсли;
		
	ПараметрыФормы = Новый Структура("ПользовательскиеНастройки, Отбор, СформироватьПриОткрытии", ПользовательскиеНастройки, УсловияОтбора, Истина);
	ОткрытьФорму("Отчет.ЖурналОС.Форма", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетИтоговаяВедомостьПоГруппамОСЗаМесяц(Команда)
	
	стПериод = Новый СтандартныйПериод;
	стПериод.ДатаНачала = ДатаНачала;
	стПериод.ДатаОкончания = КонецДня(ДатаОкончания);
	
	ПользовательскиеНастройки = УстановитьПользовательскиеНастройкиОтчета("ИтоговаяВедомостьПоГруппамОСЗаМесяц",Новый Структура("СтПериод", стПериод));
	
	УсловияОтбора = Новый Структура;
	
	Если ЗначениеЗаполнено(Организация) Тогда 
		УсловияОтбора.Вставить("Организация", Организация);
	КонецЕсли;
		
	ПараметрыФормы = Новый Структура("ПользовательскиеНастройки, Отбор, СформироватьПриОткрытии", ПользовательскиеНастройки, УсловияОтбора, Истина);
	ОткрытьФорму("Отчет.ИтоговаяВедомостьПоГруппамОСЗаМесяц.Форма", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетОборотнаяВедомостьОС(Команда)
	
	ОтборыОтчета = Новый Массив;

	ТекущиеДанные = Элементы.СписокОС.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		ОтборПоОС = Новый Структура;
		ОтборПоОС.Вставить("Поле",         "ОсновноеСредство");
		ОтборПоОС.Вставить("ВидСравнения", ВидСравненияКомпоновкиДанных.Равно);
		ОтборПоОС.Вставить("Значение",     ТекущиеДанные.ОсновноеСредство);
		
		ОтборыОтчета.Добавить(ОтборПоОС);	                                    
	КонецЕсли;
		
	ОткрытьОтчет("Отчет.ОборотнаяВедомостьОС.Форма",,ОтборыОтчета,,,, ДатаНачала, КонецДня(ДатаОкончания));
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетОтчетОНаличииОС(Команда)
	
	УсловияОтбора = Новый Структура;
	
	УсловияОтбора.Вставить("ДатаК", ДатаОкончания);	
	
	Если ЗначениеЗаполнено(Организация) Тогда 
		УсловияОтбора.Вставить("Организация", Организация);
	КонецЕсли;
		
	ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", УсловияОтбора, Истина);
	ОткрытьФорму("Отчет.ОтчетОНаличииОС.Форма", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетСводПоОС(Команда)
	
	ОтборыОтчета = Новый Массив;

	ТекущиеДанные = Элементы.СписокОС.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		ОтборПоОС = Новый Структура;
		ОтборПоОС.Вставить("Поле",         "ОсновноеСредство");
		ОтборПоОС.Вставить("ВидСравнения", ВидСравненияКомпоновкиДанных.Равно);
		ОтборПоОС.Вставить("Значение",     ТекущиеДанные.ОсновноеСредство);
		
		ОтборыОтчета.Добавить(ОтборПоОС);	                                    
	КонецЕсли;
		
	ОткрытьОтчет("Отчет.СводПоОС.Форма",,ОтборыОтчета,,,, ДатаНачала, КонецДня(ДатаОкончания));
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРегистрСтавкиНалогаНаИмущество(Команда)
	
	ОткрытьФорму("РегистрСведений.СтавкиНалогаНаИмущество.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникВидыТранспорта(Команда)
	
	ОткрытьФорму("Справочник.ВидыТранспортаНалогНаИмущество.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникВидыМатериаловСтен(Команда)
	
	ОткрытьФорму("Справочник.ВидыМатериаловСтенНалогНаИмущество.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникРегиональныеКоэффициенты(Команда)
	
	ОткрытьФорму("Справочник.РегиональныеКоэффициентыНалогНаИмущество.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникЗональныеКоэффициенты(Команда)
	
	ОткрытьФорму("Справочник.ЗональныеКоэффициентыНалогНаИмущество.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникОтраслевыеКоэффициенты(Команда)
	
	ОткрытьФорму("Справочник.ОтраслевыеКоэффициентыНалогНаИмущество.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРегистрСведенияОбИмуществе(Команда)
	
	ОткрытьФорму("РегистрСведений.СведенияОбИмуществе.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРегистрСведенияОТранспорте(Команда)
	
	ОткрытьФорму("РегистрСведений.СведенияОТранспорте.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновноеСредство(Команда)
	
	ОткрытьФорму("Справочник.ОсновныеСредства.Форма.ФормаЭлемента", Новый Структура("Ключ", ОсновноеСредство));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиРезультатовИнтерактивныхДействий

&НаКлиенте
Процедура ОтветНаВопросПерепровестиДокументы(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ПоказатьРезультатПерепроведения = Истина;
		ПоказатьКомандуРасшифровки = Истина;
		ПараметрыКоманды = Новый Структура;
		ПараметрыКоманды.Вставить("МассивСсылок", ПолучитьМассивСсылокДляПерепроведения());
		РезультатВыполнения = ПерепровестиДокументыНаСервере(ПараметрыКоманды);
		ПараметрыОбработчикаОжидания = Новый Структура();
		
		Если Не РезультатВыполнения.ЗаданиеВыполнено Тогда		
			ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
			ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "ФормированиеОтчета");
		КонецЕсли;
		
		// Установить видимость и доступность элементов формы
		УстановитьВидимостьДоступностьЭлементов();
	КонецЕсли;                                    	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура устанавливает видимость и доступность элементов.
//
&НаСервере
Процедура УстановитьВидимостьДоступностьЭлементов()
	
	Элементы.ПерепровестиДокументы.Видимость = НЕ ПоказатьРезультатПерепроведения;
	Элементы.РасшифровкаПоСобытиямОС.Видимость = НЕ ПоказатьРезультатПерепроведения;
	Элементы.Результат.Видимость = ПоказатьРезультатПерепроведения;
	Элементы.СостояниеПрогресса.Видимость = ПоказатьРезультатПерепроведения;
	Элементы.ТолькоЗакрытиеМесяца.Видимость = ВключатьЗакрытиеМесяца;
	Элементы.ПоказатьРасшифровку.Видимость = ПоказатьКомандуРасшифровки;
	Элементы.РасшифровкаПоСобытиямОСМОЛ.Видимость = Константы.ФункциональнаяОпцияУчетДвиженияОСПоМОЛ.Получить();
	Элементы.РасшифровкаПоСобытиямОСПодразделение.Видимость = Константы.ФункциональнаяОпцияУчетДвиженияОСПоПодразделениям.Получить();
	
	Страница = Элементы.СтраницыОбработки.ТекущаяСтраница.Имя;
	Элементы.ПериодМонитора.Видимость = Ложь;
	
	Если Страница = "СтраницаСвод" Тогда
		
		Элементы.ДатаНачала.Видимость 	 = Истина;
		Элементы.ДатаОкончания.Видимость = Истина;
		
	ИначеЕсли Страница = "СтраницаДокументы" Тогда
		
		Элементы.ДатаНачала.Видимость 	 = Ложь;
		Элементы.ДатаОкончания.Видимость = Ложь;
		
	ИначеЕсли Страница = "СтраницаНалогНаИмущество" Тогда
		
		Элементы.ДатаНачала.Видимость 	  = Ложь;
		Элементы.ДатаОкончания.Видимость  = Ложь;
		Элементы.ПериодМонитора.Видимость = Истина;
		
	ИначеЕсли Страница = "СтраницаАмортизацияОСЗаПериод" Тогда
		
		Элементы.ДатаНачала.Видимость 	 = Истина;
		Элементы.ДатаОкончания.Видимость = Истина;
		
	ИначеЕсли Страница = "СтраницаРегистры" Тогда
		
		Элементы.ДатаНачала.Видимость 	 = Ложь;
		Элементы.ДатаОкончания.Видимость = Ложь;
		
	ИначеЕсли Страница = "СтраницаСводПоСчетам" Тогда
		
		Элементы.ДатаНачала.Видимость 	 = Истина;
		Элементы.ДатаОкончания.Видимость = Истина;		
	КонецЕсли;	
	
	Если ОсновноеСредство = ПредопределенноеЗначение("Справочник.ОсновныеСредства.ПустаяСсылка") Тогда	
		Элементы.ФормаОсновноеСредство.Видимость = Ложь;
		Элементы.ФормаОсновноеСредство.Заголовок = "";
	Иначе	
		Элементы.ФормаОсновноеСредство.Видимость = Истина;
		Элементы.ФормаОсновноеСредство.Заголовок = СтрШаблон(НСтр("ru = 'Текущее ОС: %1'"), ОсновноеСредство);
	КонецЕсли;	                                   
КонецПроцедуры 

// Процедура заполнения ТЧ "РасшифровкиПоСобытиямОС".
//
&НаСервере
Процедура ПолучитьТаблицуРасшифровкиПоСобытиямОСНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	УчетнаяПолитикаОрганизаций.НачислениеАмортизацииОСПоМесяцам КАК НачислениеАмортизацииОСПоМесяцам,
		|	УчетнаяПолитикаОрганизаций.Период КАК Период
		|ПОМЕСТИТЬ ВременнаяТаблицаУчетнаяПолитика
		|ИЗ
		|	РегистрСведений.УчетнаяПолитикаОрганизаций КАК УчетнаяПолитикаОрганизаций
		|ГДЕ
		|	УчетнаяПолитикаОрганизаций.Организация = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПараметрыУчетаОС.Период КАК Период,
		|	ПараметрыУчетаОС.Регистратор КАК Регистратор,
		|	ПараметрыУчетаОС.Организация КАК Организация,
		|	ПараметрыУчетаОС.СчетУчета КАК СчетУчета,
		|	ПараметрыУчетаОС.СчетУчета.ПарныйСчет КАК СчетУчетаПарныйСчет,
		|	ПараметрыУчетаОС.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимость,
		|	ПараметрыУчетаОС.СрокСлужбы КАК СрокСлужбы,
		|	ПараметрыУчетаОС.СпособНачисленияАмортизации КАК СпособНачисленияАмортизации,
		|	ПараметрыУчетаОС.СпособОтраженияРасходовПоАмортизации КАК СпособОтраженияРасходовПоАмортизации,
		|	ПараметрыУчетаОС.ОсновноеСредство КАК ОсновноеСредство,
		|	ПараметрыУчетаОС.СтоимостьДляРасчетаАмортизации КАК БазаАмортизации,
		|	ПараметрыУчетаОС.ЛиквидационнаяСтоимость КАК ЛиквидационнаяСтоимость,
		|	ПараметрыУчетаОС.ОбъемПродукции КАК ОбъемПродукции
		|ПОМЕСТИТЬ ВременнаяТаблицаПараметрыУчетаОСНаДатуОкончания
		|ИЗ
		|	РегистрСведений.ПараметрыУчетаОС КАК ПараметрыУчетаОС
		|ГДЕ
		|	ПараметрыУчетаОС.Организация = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ХозрасчетныйОстаткиИОбороты.Период КАК Период,
		|	ХозрасчетныйОстаткиИОбороты.Регистратор КАК Регистратор,
		|	ХозрасчетныйОстаткиИОбороты.Организация КАК Организация,
		|	ХозрасчетныйОстаткиИОбороты.КорСубконто1 КАК ОсновноеСредство,
		|	0 КАК Выработка
		|ПОМЕСТИТЬ ВременнаяТаблицаХозрасчетныйОсновнаяТаблица
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Обороты(
		|			,
		|			,
		|			Регистратор,
		|			,
		|			,
		|			Организация = &Организация
		|				И КорСубконто1 В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ПараметрыУчетаОС.ОсновноеСредство
		|					ИЗ
		|						ВременнаяТаблицаПараметрыУчетаОСНаДатуОкончания КАК ПараметрыУчетаОС),
		|			НЕ КорСчет.Временный
		|					И КорСчет.ПарныйСчет <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
		|				ИЛИ КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Земля),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства)) КАК ХозрасчетныйОстаткиИОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаПараметровУчетаОС.Период,
		|	ТаблицаПараметровУчетаОС.Регистратор,
		|	ТаблицаПараметровУчетаОС.Организация,
		|	ТаблицаПараметровУчетаОС.ОсновноеСредство,
		|	0
		|ИЗ
		|	ВременнаяТаблицаПараметрыУчетаОСНаДатуОкончания КАК ТаблицаПараметровУчетаОС
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СобытияОС.Период,
		|	СобытияОС.Регистратор,
		|	СобытияОС.Организация,
		|	СобытияОС.ОсновноеСредство,
		|	0
		|ИЗ
		|	РегистрСведений.СобытияОС КАК СобытияОС
		|ГДЕ
		|	СобытияОС.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Перемещение)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВыработкаОСОбороты.ПериодДень,
		|	ВыработкаОСОбороты.Регистратор,
		|	ВыработкаОСОбороты.Организация,
		|	ВыработкаОСОбороты.ОсновноеСредство,
		|	ВыработкаОСОбороты.КоличествоОборот
		|ИЗ
		|	РегистрНакопления.ВыработкаОС.Обороты(, , Авто, ) КАК ВыработкаОСОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИнвентаризацияОС.Ссылка.Дата,
		|	ИнвентаризацияОС.Ссылка,
		|	ИнвентаризацияОС.Ссылка.Организация,
		|	ИнвентаризацияОС.ОсновноеСредство,
		|	0
		|ИЗ
		|	Документ.ИнвентаризацияОС.ОС КАК ИнвентаризацияОС
		|ГДЕ
		|	НЕ ИнвентаризацияОС.Ссылка.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаХозрасчетныйОсновнаяТаблица.Регистратор КАК Регистратор,
		|	ВременнаяТаблицаХозрасчетныйОсновнаяТаблица.ОсновноеСредство КАК ОсновноеСредство,
		|	МАКСИМУМ(ВременнаяТаблицаХозрасчетныйОсновнаяТаблица.Период) КАК Период,
		|	МАКСИМУМ(ВременнаяТаблицаХозрасчетныйОсновнаяТаблица.Организация) КАК Организация,
		|	МАКСИМУМ(ВременнаяТаблицаХозрасчетныйОсновнаяТаблица.Выработка) КАК Выработка
		|ПОМЕСТИТЬ ВременнаяТаблицаХозрасчетныйГотоваяОсновнаяТаблица
		|ИЗ
		|	ВременнаяТаблицаХозрасчетныйОсновнаяТаблица КАК ВременнаяТаблицаХозрасчетныйОсновнаяТаблица
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаХозрасчетныйОсновнаяТаблица.Регистратор,
		|	ВременнаяТаблицаХозрасчетныйОсновнаяТаблица.ОсновноеСредство
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ХозрасчетныйОстаткиИОбороты.Период КАК Период,
		|	ХозрасчетныйОстаткиИОбороты.Субконто1 КАК ОсновноеСредство,
		|	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт КАК НакопленныйИзнос
		|ПОМЕСТИТЬ ВременнаяТаблицаХозрасчетныйНакопленныйИзнос
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Обороты(
		|			,
		|			,
		|			Регистратор,
		|			Счет В
		|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					ПараметрыУчетаОС.СчетУчетаПарныйСчет
		|				ИЗ
		|					ВременнаяТаблицаПараметрыУчетаОСНаДатуОкончания КАК ПараметрыУчетаОС),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства),
		|			Организация = &Организация
		|				И Субконто1 В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ПараметрыУчетаОС.ОсновноеСредство
		|					ИЗ
		|						ВременнаяТаблицаПараметрыУчетаОСНаДатуОкончания КАК ПараметрыУчетаОС),
		|			,
		|			) КАК ХозрасчетныйОстаткиИОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ХозрасчетныйОстаткиИОбороты.Период КАК Период,
		|	ХозрасчетныйОстаткиИОбороты.Регистратор КАК Регистратор,
		|	ХозрасчетныйОстаткиИОбороты.Субконто1 КАК ОсновноеСредство,
		|	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт КАК Амортизация
		|ПОМЕСТИТЬ ВременнаяТаблицаХозрасчетныйАмортизация
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Обороты(
		|			,
		|			,
		|			Регистратор,
		|			Счет В
		|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					ПараметрыУчетаОС.СчетУчетаПарныйСчет
		|				ИЗ
		|					ВременнаяТаблицаПараметрыУчетаОСНаДатуОкончания КАК ПараметрыУчетаОС),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства),
		|			Организация = &Организация
		|				И Субконто1 В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ПараметрыУчетаОС.ОсновноеСредство
		|					ИЗ
		|						ВременнаяТаблицаПараметрыУчетаОСНаДатуОкончания КАК ПараметрыУчетаОС),
		|			,
		|			) КАК ХозрасчетныйОстаткиИОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПараметрыУчетаОС.ОсновноеСредство КАК ОсновноеСредство,
		|	ПараметрыУчетаОС.Период КАК Период
		|ПОМЕСТИТЬ ВременнаяТаблицаДатаПринятияКУчетуОС
		|ИЗ
		|	ВременнаяТаблицаПараметрыУчетаОСНаДатуОкончания КАК ПараметрыУчетаОС
		|ГДЕ
		|	(ПараметрыУчетаОС.Регистратор ССЫЛКА Документ.ПринятиеКУчетуОС
		|			ИЛИ ПараметрыУчетаОС.Регистратор ССЫЛКА Документ.ВводНачальныхОстатков
		|			ИЛИ ПараметрыУчетаОС.Регистратор ССЫЛКА Документ.МодернизацияОС)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ХозрасчетныйОсновнаяТаблица.Период КАК Период,
		|	ХозрасчетныйОсновнаяТаблица.Регистратор КАК Регистратор,
		|	ХозрасчетныйОсновнаяТаблица.Организация КАК Организация,
		|	ХозрасчетныйОсновнаяТаблица.ОсновноеСредство КАК ОсновноеСредство,
		|	ХозрасчетныйОсновнаяТаблица.Выработка КАК Выработка,
		|	СУММА(ХозрасчетныйНакопленныйИзнос.НакопленныйИзнос) КАК НакопленныйИзнос,
		|	МАКСИМУМ(ЕСТЬNULL(ВременнаяТаблицаХозрасчетныйАмортизация.Амортизация, 0)) КАК Амортизация
		|ПОМЕСТИТЬ ВременнаяТаблицаДанныеНакопленнымИзносом
		|ИЗ
		|	ВременнаяТаблицаХозрасчетныйГотоваяОсновнаяТаблица КАК ХозрасчетныйОсновнаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаХозрасчетныйНакопленныйИзнос КАК ХозрасчетныйНакопленныйИзнос
		|		ПО ХозрасчетныйОсновнаяТаблица.ОсновноеСредство = ХозрасчетныйНакопленныйИзнос.ОсновноеСредство
		|			И ХозрасчетныйОсновнаяТаблица.Период >= ХозрасчетныйНакопленныйИзнос.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаХозрасчетныйАмортизация КАК ВременнаяТаблицаХозрасчетныйАмортизация
		|		ПО ХозрасчетныйОсновнаяТаблица.ОсновноеСредство = ВременнаяТаблицаХозрасчетныйАмортизация.ОсновноеСредство
		|			И ХозрасчетныйОсновнаяТаблица.Регистратор = ВременнаяТаблицаХозрасчетныйАмортизация.Регистратор
		|
		|СГРУППИРОВАТЬ ПО
		|	ХозрасчетныйОсновнаяТаблица.Период,
		|	ХозрасчетныйОсновнаяТаблица.Регистратор,
		|	ХозрасчетныйОсновнаяТаблица.Организация,
		|	ХозрасчетныйОсновнаяТаблица.ОсновноеСредство,
		|	ХозрасчетныйОсновнаяТаблица.Выработка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаДанныеНакопленнымИзносом.Период КАК Период,
		|	ВременнаяТаблицаДанныеНакопленнымИзносом.Регистратор КАК Регистратор,
		|	ВременнаяТаблицаДанныеНакопленнымИзносом.Организация КАК Организация,
		|	ВременнаяТаблицаДанныеНакопленнымИзносом.ОсновноеСредство КАК ОсновноеСредство,
		|	ВременнаяТаблицаДанныеНакопленнымИзносом.Выработка КАК Выработка,
		|	ВременнаяТаблицаДанныеНакопленнымИзносом.НакопленныйИзнос КАК НакопленныйИзнос,
		|	ВременнаяТаблицаДанныеНакопленнымИзносом.Амортизация КАК Амортизация,
		|	МАКСИМУМ(УчетнаяПолитика.Период) КАК ПериодУП,
		|	МАКСИМУМ(ДатаПринятияКУчетуОС.Период) КАК ДатаПринятияОС
		|ПОМЕСТИТЬ ВременнаяТаблицаДанныеСПериодами
		|ИЗ
		|	ВременнаяТаблицаДанныеНакопленнымИзносом КАК ВременнаяТаблицаДанныеНакопленнымИзносом
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаУчетнаяПолитика КАК УчетнаяПолитика
		|		ПО ВременнаяТаблицаДанныеНакопленнымИзносом.Период >= УчетнаяПолитика.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаДатаПринятияКУчетуОС КАК ДатаПринятияКУчетуОС
		|		ПО (ВЫБОР
		|				КОГДА ВременнаяТаблицаДанныеНакопленнымИзносом.Регистратор ССЫЛКА Документ.МодернизацияОС
		|					ТОГДА ВременнаяТаблицаДанныеНакопленнымИзносом.Период >= ДОБАВИТЬКДАТЕ(ДатаПринятияКУчетуОС.Период, ДЕНЬ, 1)
		|				ИНАЧЕ ВременнаяТаблицаДанныеНакопленнымИзносом.Период >= ДатаПринятияКУчетуОС.Период
		|			КОНЕЦ)
		|			И ВременнаяТаблицаДанныеНакопленнымИзносом.ОсновноеСредство = ДатаПринятияКУчетуОС.ОсновноеСредство
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаДанныеНакопленнымИзносом.Период,
		|	ВременнаяТаблицаДанныеНакопленнымИзносом.Регистратор,
		|	ВременнаяТаблицаДанныеНакопленнымИзносом.Организация,
		|	ВременнаяТаблицаДанныеНакопленнымИзносом.ОсновноеСредство,
		|	ВременнаяТаблицаДанныеНакопленнымИзносом.Выработка,
		|	ВременнаяТаблицаДанныеНакопленнымИзносом.НакопленныйИзнос,
		|	ВременнаяТаблицаДанныеНакопленнымИзносом.Амортизация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МестонахождениеОС.Период КАК Период,
		|	МестонахождениеОС.Организация КАК Организация,
		|	МестонахождениеОС.ОсновноеСредство КАК ОсновноеСредство,
		|	МестонахождениеОС.МОЛ КАК МОЛ,
		|	МестонахождениеОС.Подразделение КАК Подразделение
		|ПОМЕСТИТЬ ВременнаяТаблицаМестонахождениеОС
		|ИЗ
		|	РегистрСведений.МестонахождениеОС КАК МестонахождениеОС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДанных.Период КАК Период,
		|	ТаблицаДанных.Организация КАК Организация,
		|	ТаблицаДанных.Регистратор КАК Документ,
		|	ТаблицаДанных.ОсновноеСредство КАК ОсновноеСредство,
		|	ТаблицаДанных.Выработка КАК Выработка,
		|	СобытияОС.Событие КАК Событие,
		|	ТаблицаДанных.НакопленныйИзнос КАК НакопленныйИзнос,
		|	ТаблицаДанных.Амортизация КАК Амортизация,
		|	ЕСТЬNULL(ТаблицаДанных.ДатаПринятияОС, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаПринятияОС,
		|	УчетнаяПолитика.НачислениеАмортизацииОСПоМесяцам КАК НачислениеАмортизацииОСПоМесяцам,
		|	МАКСИМУМ(ПараметрыУчетаОС.Период) КАК ПериодПараметровУчета,
		|	МАКСИМУМ(МестонахождениеОС.Период) КАК ПериодМестонахождениеОС
		|ПОМЕСТИТЬ ВременнаяТаблицаДанныеОС
		|ИЗ
		|	ВременнаяТаблицаДанныеСПериодами КАК ТаблицаДанных
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаУчетнаяПолитика КАК УчетнаяПолитика
		|		ПО ТаблицаДанных.ПериодУП = УчетнаяПолитика.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаПараметрыУчетаОСНаДатуОкончания КАК ПараметрыУчетаОС
		|		ПО ТаблицаДанных.ОсновноеСредство = ПараметрыУчетаОС.ОсновноеСредство
		|			И ТаблицаДанных.Период >= ПараметрыУчетаОС.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СобытияОС КАК СобытияОС
		|		ПО ТаблицаДанных.Регистратор = СобытияОС.Регистратор
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаМестонахождениеОС КАК МестонахождениеОС
		|		ПО ТаблицаДанных.Организация = МестонахождениеОС.Организация
		|			И ТаблицаДанных.ОсновноеСредство = МестонахождениеОС.ОсновноеСредство
		|			И ТаблицаДанных.Период >= МестонахождениеОС.Период
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ВключатьЗМ
		|					И &ТолькоЗМ
		|				ТОГДА ТаблицаДанных.Регистратор ССЫЛКА Документ.ЗакрытиеМесяца
		|			КОГДА &ВключатьЗМ
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ НЕ ТаблицаДанных.Регистратор ССЫЛКА Документ.ЗакрытиеМесяца
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаДанных.Регистратор,
		|	ТаблицаДанных.Организация,
		|	ТаблицаДанных.ОсновноеСредство,
		|	ТаблицаДанных.Выработка,
		|	ТаблицаДанных.НакопленныйИзнос,
		|	ТаблицаДанных.Амортизация,
		|	УчетнаяПолитика.НачислениеАмортизацииОСПоМесяцам,
		|	ТаблицаДанных.ДатаПринятияОС,
		|	ТаблицаДанных.Период,
		|	СобытияОС.Событие
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДанных.Период КАК Дата,
		|	ТаблицаДанных.Документ КАК Документ,
		|	ТаблицаДанных.ОсновноеСредство КАК ОсновноеСредство,
		|	ТаблицаДанных.Событие КАК Событие,
		|	ТаблицаДанных.Выработка КАК Выработка,
		|	ЕСТЬNULL(ПараметрыУчетаОС.ПервоначальнаяСтоимость, 0) КАК ПервоначальнаяСтоимость,
		|	ЕСТЬNULL(ТаблицаДанных.НакопленныйИзнос, 0) КАК НакопленныйИзнос,
		|	ЕСТЬNULL(ТаблицаДанных.Амортизация, 0) КАК Амортизация,
		|	МестонахождениеОС.МОЛ КАК МОЛ,
		|	МестонахождениеОС.Подразделение КАК Подразделение,
		|	ПараметрыУчетаОС.СчетУчета КАК Счет,
		|	ПараметрыУчетаОС.СчетУчетаПарныйСчет КАК СчетНачисленияАмортизации,
		|	ПараметрыУчетаОС.СрокСлужбы КАК СрокСлужбы,
		|	ПараметрыУчетаОС.СпособНачисленияАмортизации КАК СпособНачисленияАмортизации,
		|	ПараметрыУчетаОС.СпособОтраженияРасходовПоАмортизации КАК СпособОтраженияРасходовПоАмортизации,
		|	ПараметрыУчетаОС.БазаАмортизации КАК БазаАмортизации,
		|	ПараметрыУчетаОС.ЛиквидационнаяСтоимость КАК ЛиквидационнаяСтоимость,
		|	ПараметрыУчетаОС.ОбъемПродукции КАК Объем,
		|	ТаблицаДанных.ДатаПринятияОС КАК ДатаПринятияОС,
		|	ТаблицаДанных.НачислениеАмортизацииОСПоМесяцам КАК НачислениеАмортизацииОСПоМесяцам
		|ИЗ
		|	ВременнаяТаблицаДанныеОС КАК ТаблицаДанных
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаПараметрыУчетаОСНаДатуОкончания КАК ПараметрыУчетаОС
		|		ПО ТаблицаДанных.ОсновноеСредство = ПараметрыУчетаОС.ОсновноеСредство
		|			И ТаблицаДанных.ПериодПараметровУчета = ПараметрыУчетаОС.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаМестонахождениеОС КАК МестонахождениеОС
		|		ПО ТаблицаДанных.Организация = МестонахождениеОС.Организация
		|			И ТаблицаДанных.ОсновноеСредство = МестонахождениеОС.ОсновноеСредство
		|			И ТаблицаДанных.ПериодМестонахождениеОС = МестонахождениеОС.Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
	Запрос.УстановитьПараметр("ДатаОкончания", 	КонецДня(ДатаОкончания));
	Запрос.УстановитьПараметр("ДатаНачала", 	НачалоДня(ДатаНачала));
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.УстановитьПараметр("ВключатьЗМ", 	ВключатьЗакрытиеМесяца);
	Запрос.УстановитьПараметр("ТолькоЗМ", 		ТолькоЗакрытиеМесяца);
	
	РасшифровкаПоСобытиямОС.Очистить();
	СписокДокументовМодернизации.Очистить();
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаТаблицы = РасшифровкаПоСобытиямОС.Добавить();
		
		Если Тип("ДокументСсылка.МодернизацияОС") = ТипЗнч(Выборка.Документ) Тогда	
			ЗаполнитьДанныеПоСуммеМодернизации(Выборка.Документ);		
		КонецЕсли;	
			
		Отбор = Новый Структура();
		Отбор.Вставить("Документ", Выборка.Документ);
		
		Если РасшифровкаПоСобытиямОС.НайтиСтроки(Отбор).Количество() <> 0 Тогда
			СтрокаТаблицы.ДокументПовторяется = Истина;	
		КонецЕсли;	
			
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Выборка);		
	КонецЦикла;	
КонецПроцедуры // ПолучитьТаблицуРасшифровкиПоСобытиямОСНаСервере()

Процедура ЗаполнитьДанныеПоСуммеМодернизации(ДокументМодернизации)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХозрасчетныйОстаткиИОбороты.Регистратор КАК Документ,
		|	ХозрасчетныйОстаткиИОбороты.ПериодДень КАК Дата,
		|	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток КАК Сумма,
		|	ВЫБОР
		|		КОГДА ХозрасчетныйОстаткиИОбороты.Регистратор ССЫЛКА Документ.МодернизацияОС
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Модернизация
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
		|			,
		|			&Период,
		|			Авто,
		|			,
		|			Счет = &Счет,
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства),
		|			Организация = &Организация
		|				И Субконто1 = &ОсновноеСредство) КАК ХозрасчетныйОстаткиИОбороты
		|ГДЕ
		|	ХозрасчетныйОстаткиИОбороты.Регистратор <> &Документ";
	Запрос.УстановитьПараметр("Организация", 		ДокументМодернизации.Организация);
	Запрос.УстановитьПараметр("ОсновноеСредство", 	ДокументМодернизации.ОсновноеСредство);
	Запрос.УстановитьПараметр("Период", 			ДокументМодернизации.Дата);
	Запрос.УстановитьПараметр("Документ", 			ДокументМодернизации);
	Запрос.УстановитьПараметр("Счет", 				ДокументМодернизации.СчетУчетаМодернизации);
	
	ТаблицаДокументов = Запрос.Выполнить().Выгрузить();
	
	Отбор = Новый Структура();
	Отбор.Вставить("Модернизация", Истина);
	
	МассивСтрок = ТаблицаДокументов.НайтиСтроки(Отбор);
	ДатаПоследнейМодернизации = Дата(1, 1, 1);
	
	Для Каждого СтрокаМассива Из МассивСтрок Цикл
		Если ДатаПоследнейМодернизации < СтрокаМассива.Дата Тогда
			ДатаПоследнейМодернизации = СтрокаМассива.Дата;	
		КонецЕсли;	
	КонецЦикла;	
	
	Для Каждого СтрокаТаблицы Из ТаблицаДокументов Цикл	
		
		Если ДатаПоследнейМодернизации <= СтрокаТаблицы.Дата Тогда
			
			Если Тип("ДокументСсылка.МодернизацияОС") <> ТипЗнч(СтрокаТаблицы.Документ) Тогда
			
				СтрокаТаблицыМод = СписокДокументовМодернизации.Добавить();
				
				СтрокаТаблицыМод.Документ 				= СтрокаТаблицы.Документ;
				СтрокаТаблицыМод.Дата 					= СтрокаТаблицы.Дата;
				СтрокаТаблицыМод.Сумма 					= СтрокаТаблицы.Сумма;
				СтрокаТаблицыМод.ДокументМодернизации 	= ДокументМодернизации;
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Процедура установки значений параметров динамических списков.
//
// Параметры:
//	ИзменилосьОС - Булево - проверка изменения значения реквизита "ОсновноеСредство".
//
&НаКлиенте
Процедура УстановитьПараметрыДинамическихСписков()
	
	// СписокОС
	СписокОС.Параметры.УстановитьЗначениеПараметра("НачалоПериода", НачалоГода(ДатаНачала));
	СписокОС.Параметры.УстановитьЗначениеПараметра("КонецПериода", ДатаОкончания);
	СписокОС.Параметры.УстановитьЗначениеПараметра("Организация", Организация);
	СписокОС.Параметры.УстановитьЗначениеПараметра("СписокСчетовУчетаАмортизации", БухгалтерскийУчетВызовСервераПовтИсп.СчетаУчетаНакопленнойАмортизацииОсновныхСредствИНематериальныхАктивов());
	
	// СводПоСчетам
	СводПоСчетам.Параметры.УстановитьЗначениеПараметра("ДатаНачала", ДатаНачала);
	СводПоСчетам.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", КонецДня(ДатаОкончания));
	СводПоСчетам.Параметры.УстановитьЗначениеПараметра("Организация", Организация);
	
	// АмортизацияПоОС
	АмортизацияПоОС.Параметры.УстановитьЗначениеПараметра("ДатаНачала", ДатаНачала);
	АмортизацияПоОС.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", КонецДня(ДатаОкончания));
	АмортизацияПоОС.Параметры.УстановитьЗначениеПараметра("Организация", Организация);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументыНалогаНаИмущество()
	
	МассивОСТранспорт = Новый Массив();	
	Для Каждого СтрокаТабличнойЧасти Из Объект.Транспорт Цикл
		МассивОСТранспорт.Добавить(СтрокаТабличнойЧасти.ОсновноеСредство);
	КонецЦикла;
	
	МассивОСНедвижимость = Новый Массив();
	Для Каждого СтрокаТабличнойЧасти Из Объект.Недвижимость Цикл
		МассивОСНедвижимость.Добавить(СтрокаТабличнойЧасти.ОсновноеСредство);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗакрытиеМесяца.Ссылка
		|ПОМЕСТИТЬ ВременнаяТаблицаЗакрытияМесяца
		|ИЗ
		|	Документ.ЗакрытиеМесяца КАК ЗакрытиеМесяца
		|ГДЕ
		|	ЗакрытиеМесяца.Организация = &Организация
		|	И ЗакрытиеМесяца.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И (ЗакрытиеМесяца.Транспорт.ОсновноеСредство В (&МассивОСТранспорт)
		|			ИЛИ ЗакрытиеМесяца.Недвижимость.ОсновноеСредство В (&МассивОСНедвижимость))
		|	И (МЕСЯЦ(ЗакрытиеМесяца.Дата) = 3
		|			ИЛИ МЕСЯЦ(ЗакрытиеМесяца.Дата) = 6
		|			ИЛИ МЕСЯЦ(ЗакрытиеМесяца.Дата) = 9
		|			ИЛИ МЕСЯЦ(ЗакрытиеМесяца.Дата) = 12)
	    |;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыработкаОСОбороты.Регистратор КАК Регистратор,
		|	ВыработкаОСОбороты.ПериодСекунда КАК Дата,
		|	ВыработкаОСОбороты.ОсновноеСредство КАК ОсновноеСредство
		|ПОМЕСТИТЬ ВременнаяТаблицаДокументы
		|ИЗ
		|	РегистрНакопления.ВыработкаОС.Обороты(
		|			,
		|			,
		|			Авто,
		|			Организация = &Организация
		|				И (ОсновноеСредство В (&МассивОСТранспорт)
		|					ИЛИ ОсновноеСредство В (&МассивОСНедвижимость))) КАК ВыработкаОСОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗемельныйНалогОбороты.Регистратор,
		|	ЗемельныйНалогОбороты.ПериодСекунда,
		|	ЗемельныйНалогОбороты.ОсновноеСредство
		|ИЗ
		|	РегистрНакопления.ЗемельныйНалог.Обороты(
		|			,
		|			,
		|			Авто,
		|			Организация = &Организация
		|				И (ОсновноеСредство В (&МассивОСТранспорт)
		|					ИЛИ ОсновноеСредство В (&МассивОСНедвижимость))) КАК ЗемельныйНалогОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СобытияОС.Регистратор,
		|	СобытияОС.Период,
		|	СобытияОС.ОсновноеСредство
		|ИЗ
		|	РегистрСведений.СобытияОС КАК СобытияОС
		|ГДЕ
		|	СобытияОС.Организация = &Организация
		|	И (СобытияОС.ОсновноеСредство В (&МассивОСТранспорт)
		|		ИЛИ СобытияОС.ОсновноеСредство В (&МассивОСНедвижимость))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СоставОС.Регистратор,
		|	СоставОС.Период,
		|	СоставОС.ОсновноеСредство
		|ИЗ
		|	РегистрСведений.СоставОС КАК СоставОС
		|ГДЕ
		|	СоставОС.ОсновноеСредство В (&МассивОСТранспорт)
		|	ИЛИ СоставОС.ОсновноеСредство В (&МассивОСНедвижимость)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИнвентаризацияОСОС.Ссылка,
		|	ИнвентаризацияОСОС.Ссылка.Дата,
		|	ИнвентаризацияОСОС.ОсновноеСредство
		|ИЗ
		|	Документ.ИнвентаризацияОС.ОС КАК ИнвентаризацияОСОС
		|ГДЕ
		|	ИнвентаризацияОСОС.Ссылка.Организация = &Организация
		|	И (ИнвентаризацияОСОС.ОсновноеСредство В (&МассивОСТранспорт)
		|		ИЛИ ИнвентаризацияОСОС.ОсновноеСредство В (&МассивОСНедвижимость))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗакрытиеМесяцаТранспорт.Ссылка,
		|	ЗакрытиеМесяцаТранспорт.Ссылка.Дата,
		|	ЗакрытиеМесяцаТранспорт.ОсновноеСредство
		|ИЗ
		|	Документ.ЗакрытиеМесяца.Транспорт КАК ЗакрытиеМесяцаТранспорт
		|ГДЕ
		|	ЗакрытиеМесяцаТранспорт.Ссылка В (ВЫБРАТЬ Ссылка ИЗ ВременнаяТаблицаЗакрытияМесяца)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗакрытиеМесяцаНедвижимость.Ссылка,
		|	ЗакрытиеМесяцаНедвижимость.Ссылка.Дата,
		|	ЗакрытиеМесяцаНедвижимость.ОсновноеСредство
		|ИЗ
		|	Документ.ЗакрытиеМесяца.Недвижимость КАК ЗакрытиеМесяцаНедвижимость
		|ГДЕ
		|	ЗакрытиеМесяцаНедвижимость.Ссылка В (ВЫБРАТЬ Ссылка ИЗ ВременнаяТаблицаЗакрытияМесяца)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВременнаяТаблицаДокументы.Регистратор КАК Документ,
		|	ВременнаяТаблицаДокументы.Дата КАК Дата,
		|	ВременнаяТаблицаДокументы.ОсновноеСредство КАК ОсновноеСредство
		|ИЗ
		|	ВременнаяТаблицаДокументы КАК ВременнаяТаблицаДокументы";
	Запрос.УстановитьПараметр("НачалоПериода", 			НачалоГода(Дата));	
	Запрос.УстановитьПараметр("КонецПериода", 			КонецГода(Дата));
	Запрос.УстановитьПараметр("Организация", 			Организация);
	Запрос.УстановитьПараметр("МассивОСТранспорт", 		МассивОСТранспорт);
	Запрос.УстановитьПараметр("МассивОСНедвижимость", 	МассивОСНедвижимость);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если МассивОСТранспорт.Найти(Выборка.ОсновноеСредство) <> Неопределено Тогда	
			СтрокаТаблицы = СписокДокументовТранспорт.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Выборка);
		КонецЕсли;
		
		Если МассивОСНедвижимость.Найти(Выборка.ОсновноеСредство) <> Неопределено Тогда	
			СтрокаТаблицы = СписокДокументовНедвижимость.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Выборка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПодвалыЗакладок()

	// Свод
	Схема = Элементы.СписокОС.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки = Элементы.СписокОС.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТаблицаСпискаОС = ПроцессорВывода.Вывести(ПроцессорКомпоновки);	

	СводОсПервоначальнаяСтоимостьИтог = ТаблицаСпискаОС.Итог("ПервоначальнаяСтоимость");
	
	// Ведомость ОС
	Схема = Элементы.АмортизацияПоОС.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки = Элементы.АмортизацияПоОС.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТаблицаАмортизацияПоОС = ПроцессорВывода.Вывести(ПроцессорКомпоновки);	

	АмортизацияПоОССтоимостьБУНаНачалоИтог 	= ТаблицаАмортизацияПоОС.Итог("СтоимостьБУНаНачало");
	АмортизацияПоОСИзносНаНачалоИтог 		= ТаблицаАмортизацияПоОС.Итог("ИзносНаНачало");
	АмортизацияПоОССтоимостьБУПриходИтог 	= ТаблицаАмортизацияПоОС.Итог("СтоимостьБУПриход");
	АмортизацияПоОСИзносРасходИтог 			= ТаблицаАмортизацияПоОС.Итог("ИзносРасход");
	АмортизацияПоОССтоимостьБУРасходИтог 	= ТаблицаАмортизацияПоОС.Итог("СтоимостьБУРасход");
	АмортизацияПоОСИзносПриходИтог 			= ТаблицаАмортизацияПоОС.Итог("ИзносПриход");
	АмортизацияПоОССтоимостьБУНаКонецИтог 	= ТаблицаАмортизацияПоОС.Итог("СтоимостьБУНаКонец");
	АмортизацияПоОСИзносНаКонецИтог 		= ТаблицаАмортизацияПоОС.Итог("ИзносНаКонец");
	
	// Свод по счетам
	Схема = Элементы.СводПоСчетам.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки = Элементы.СводПоСчетам.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТаблицаСводПоСчетам = ПроцессорВывода.Вывести(ПроцессорКомпоновки);	

	СводПоСчетамПервоначальнаяСтоимостьИтог 		= ТаблицаСводПоСчетам.Итог("ПервоначальнаяСтоимость");
	СводПоСчетамИзносНаНачалоИтог 					= ТаблицаСводПоСчетам.Итог("ИзносНаНачало");
	СводПоСчетамПервоначальнаяСтоимостьПриходИтог 	= ТаблицаСводПоСчетам.Итог("ПервоначальнаяСтоимостьПриход");
	СводПоСчетамИзносРасходИтог 					= ТаблицаСводПоСчетам.Итог("ИзносРасход");
	СводПоСчетамПервоначальнаяСтоимостьРасходИтог 	= ТаблицаСводПоСчетам.Итог("ПервоначальнаяСтоимостьРасход");
	СводПоСчетамИзносПриходИтог 					= ТаблицаСводПоСчетам.Итог("ИзносПриход");
	СводПоСчетамПервоначальнаяСтоимостьНаКонецИтог 	= ТаблицаСводПоСчетам.Итог("ПервоначальнаяСтоимостьНаКонец");
	СводПоСчетамИзносНаКонецИтог 					= ТаблицаСводПоСчетам.Итог("ИзносНаКонец");
	СводПоСчетамИзносЗаПериодИтог 					= ТаблицаСводПоСчетам.Итог("ИзносЗаПериод");
КонецПроцедуры

// Процедура заполнения ТЧ "Расшифровка".
//
&НаСервере
Процедура ФормированиеНалогаНаИмущество()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗакрытиеМесяца.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВременнаяТаблицаДокумент
		|ИЗ
		|	Документ.ЗакрытиеМесяца КАК ЗакрытиеМесяца
		|ГДЕ
		|	ЗакрытиеМесяца.Проведен
		|	И ЗакрытиеМесяца.Организация = &Организация
		|	И ЗакрытиеМесяца.Дата = &Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СобытияОССрезПоследних.Период КАК Период,
		|	СобытияОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство
		|ПОМЕСТИТЬ ВременнаяТаблицаСобытияОС
		|ИЗ
		|	РегистрСведений.СобытияОС.СрезПоследних(
		|			&Дата,
		|			Организация = &Организация
		|				И (Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Реализация)
		|					ИЛИ Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Списание))) КАК СобытияОССрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗакрытиеМесяцаТранспорт.ВидТранспортаКатегорияАБВ КАК ВидТранспортаКатегорияАБВ,
		|	ЗакрытиеМесяцаТранспорт.ОсновноеСредство КАК ОсновноеСредство,
		//|	ЗакрытиеМесяцаТранспорт.ВидТранспорта КАК ВидТранспорта,
		|	ЗакрытиеМесяцаТранспорт.ОбъемДвигателя КАК ОбъемДвигателя,
		|	ЗакрытиеМесяцаТранспорт.Ставка КАК Ставка,
		|	ЗакрытиеМесяцаТранспорт.СуммаНалога КАК СуммаНалога,
		//|	ЗакрытиеМесяцаТранспорт.КоличествоМесяцевЭксплуатации КАК КоличествоМесяцевЭксплуатации,
		//|	ЗакрытиеМесяцаТранспорт.ГруппаИмущества КАК ГруппаИмущества,
		|	ПараметрыУчетаОССрезПоследних.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
		|	ПараметрыУчетаОССрезПоследних.ДатаНачисленияНалогаНаИмущество КАК НачислениеНИСДаты,
		|	ГОД(&Дата) - ГОД(ЗакрытиеМесяцаТранспорт.ОсновноеСредство.ДатаВыпускаТранспортногоСредства) + 1 КАК КоличествоЛетЭксплуатации, 
		|	ЕСТЬNULL(ВременнаяТаблицаСобытияОС.Период, НЕОПРЕДЕЛЕНО) КАК ДатаВыбытия
		|ИЗ
		|	Документ.ЗакрытиеМесяца.Транспорт КАК ЗакрытиеМесяцаТранспорт
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыУчетаОС.СрезПоследних(&Дата, Организация = &Организация) КАК ПараметрыУчетаОССрезПоследних
		|		ПО ЗакрытиеМесяцаТранспорт.ОсновноеСредство = ПараметрыУчетаОССрезПоследних.ОсновноеСредство
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСобытияОС КАК ВременнаяТаблицаСобытияОС
		|		ПО ЗакрытиеМесяцаТранспорт.ОсновноеСредство = ВременнаяТаблицаСобытияОС.ОсновноеСредство
		|ГДЕ
		|	ЗакрытиеМесяцаТранспорт.Ссылка В
		|			(ВЫБРАТЬ
		|				ВременнаяТаблицаДокумент.Ссылка
		|			ИЗ
		|				ВременнаяТаблицаДокумент)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗакрытиеМесяцаНедвижимость.ГруппаИмущества КАК ГруппаИмущества,
		|	ЗакрытиеМесяцаНедвижимость.ОсновноеСредство КАК ОсновноеСредство,
		|	ЗакрытиеМесяцаНедвижимость.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
		|	ЗакрытиеМесяцаНедвижимость.ДатаНачисленияНалогаНаИмущество КАК ДатаНачисленияНалогаНаИмущество,
		//|	ЗакрытиеМесяцаНедвижимость.МатериалСтен КАК МатериалСтен,
		|	ЗакрытиеМесяцаНедвижимость.ОценочнаяСтоимость КАК ОценочнаяСтоимость,
		|	ЗакрытиеМесяцаНедвижимость.ОбщаяПлощадь КАК ОбщаяПлощадь,
		|	ЗакрытиеМесяцаНедвижимость.Кр КАК Кр,
		|	ЗакрытиеМесяцаНедвижимость.Кз КАК Кз,
		|	ЗакрытиеМесяцаНедвижимость.Ко КАК Ко,
		|	ЗакрытиеМесяцаНедвижимость.СтоимостьНУ КАК СтоимостьНУ,
		//|	ЗакрытиеМесяцаНедвижимость.ЗемНалог КАК ЗемНалог,
		|	ЗакрытиеМесяцаНедвижимость.КоличествоМесяцевЭксплуатации КАК КоличествоМесяцевЭксплуатации,
		|	ЗакрытиеМесяцаНедвижимость.Ставка КАК Ставка,
		|	ЗакрытиеМесяцаНедвижимость.СуммаНалога КАК СуммаНалога,
		|	ГОД(&Дата) - ГОД(ЗакрытиеМесяцаНедвижимость.ОсновноеСредство.ДатаВыпускаНедвижимости) + 1 КАК КоличествоЛетЭксплуатации,
		|	ЕСТЬNULL(ВременнаяТаблицаСобытияОС.Период, НЕОПРЕДЕЛЕНО) КАК ДатаВыбытия
		|ИЗ
		|	Документ.ЗакрытиеМесяца.Недвижимость КАК ЗакрытиеМесяцаНедвижимость
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСобытияОС КАК ВременнаяТаблицаСобытияОС
		|		ПО ЗакрытиеМесяцаНедвижимость.ОсновноеСредство = ВременнаяТаблицаСобытияОС.ОсновноеСредство
		|ГДЕ
		|	ЗакрытиеМесяцаНедвижимость.Ссылка В
		|			(ВЫБРАТЬ
		|				ВременнаяТаблицаДокумент.Ссылка
		|			ИЗ
		|				ВременнаяТаблицаДокумент)";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Дата", КонецМесяца(Дата));
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ТЗТранспорт 	= МассивРезультатов[2].Выгрузить();
	ТЗНедвижимость 	= МассивРезультатов[3].Выгрузить();
	
	Объект.Транспорт.Загрузить(ТЗТранспорт);
	Объект.Недвижимость.Загрузить(ТЗНедвижимость);
	
	СписокОСТранспорт.Загрузить(ТЗТранспорт);
	СписокОСНедвижимость.Загрузить(ТЗНедвижимость);
	
	ЗаполнитьДокументыНалогаНаИмущество();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборНаРасшифровку()

	РасшифровкаПоСобытиямОСНакопленныйИзносИтог 		= 0;
	РасшифровкаПоСобытиямОСПервоначальнаяСтоимостьИтог 	= 0;
	
	Если ОсновноеСредство = Неопределено ИЛИ ПоказатьВсеДокументы Тогда
		СтруктураОтбора = Новый ФиксированнаяСтруктура("ДокументПовторяется", Ложь);
		РассчитатьИтогАмортизацииЗаМесяц(Новый Структура("ДокументПовторяется", Ложь));
		
	ИначеЕсли ОсновноеСредство = Неопределено Тогда
		СтруктураОтбора = Неопределено;
		РасшифровкаПоСобытиямОСНакопленныйИзносИтог 		= РасшифровкаПоСобытиямОС.Итог("НакопленныйИзнос");
		РасшифровкаПоСобытиямОСПервоначальнаяСтоимостьИтог 	= РасшифровкаПоСобытиямОС.Итог("ПервоначальнаяСтоимость");
		
	Иначе
		СтруктураОтбора = Новый ФиксированнаяСтруктура("ОсновноеСредство", ОсновноеСредство);
		РассчитатьИтогАмортизацииЗаМесяц(Новый Структура("ОсновноеСредство", ОсновноеСредство));
		
		Для Каждого СтрокаТаблицы Из РасшифровкаПоСобытиямОС Цикл
			Если СтрокаТаблицы.ОсновноеСредство = ОсновноеСредство Тогда
				РасшифровкаПоСобытиямОСНакопленныйИзносИтог 		= РасшифровкаПоСобытиямОСНакопленныйИзносИтог + СтрокаТаблицы.НакопленныйИзнос;
				РасшифровкаПоСобытиямОСПервоначальнаяСтоимостьИтог 	= РасшифровкаПоСобытиямОСПервоначальнаяСтоимостьИтог + СтрокаТаблицы.ПервоначальнаяСтоимость;	
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;	

	Элементы.РасшифровкаПоСобытиямОС.ОтборСтрок = СтруктураОтбора;
КонецПроцедуры

// Процедура обновляет динамические списки
//
&НаКлиенте
Процедура ОбновитьОтборДинамическихСписков()

	// СписокОС
	ИмяПоля = "СчетУчета";
	Если ЗначениеЗаполнено(ОтборСчетУчета) Тогда 
		МассивЭлементов = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(СписокОС.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, ИмяПоля);
		Если МассивЭлементов.Количество() = 0 Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(СписокОС.КомпоновщикНастроек.ФиксированныеНастройки.Отбор,
				ИмяПоля, ВидСравненияКомпоновкиДанных.Равно, ОтборСчетУчета);
		Иначе
			ОбщегоНазначенияКлиентСервер.ИзменитьЭлементыОтбора(СписокОС.КомпоновщикНастроек.ФиксированныеНастройки.Отбор,
				ИмяПоля,, ОтборСчетУчета, ВидСравненияКомпоновкиДанных.Равно);
		КонецЕсли;
	Иначе 
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(СписокОС, ИмяПоля);
	КонецЕсли;	
	
	ИмяПоля = "Подразделение";
	Если ЗначениеЗаполнено(ОтборПодразделение) Тогда 
		МассивЭлементов = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(СписокОС.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, ИмяПоля);
		Если МассивЭлементов.Количество() = 0 Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(СписокОС.КомпоновщикНастроек.ФиксированныеНастройки.Отбор,
				ИмяПоля, ВидСравненияКомпоновкиДанных.Равно, ОтборПодразделение);
		Иначе
			ОбщегоНазначенияКлиентСервер.ИзменитьЭлементыОтбора(СписокОС.КомпоновщикНастроек.ФиксированныеНастройки.Отбор,
				ИмяПоля,, ОтборПодразделение, ВидСравненияКомпоновкиДанных.Равно);
		КонецЕсли;
	Иначе 
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(СписокОС, ИмяПоля);
	КонецЕсли;	
	
	ИмяПоля = "МОЛ";
	Если ЗначениеЗаполнено(ОтборМОЛ) Тогда 
		МассивЭлементов = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(СписокОС.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, ИмяПоля);
		Если МассивЭлементов.Количество() = 0 Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(СписокОС.КомпоновщикНастроек.ФиксированныеНастройки.Отбор,
				ИмяПоля, ВидСравненияКомпоновкиДанных.Равно, ОтборМОЛ);
		Иначе
			ОбщегоНазначенияКлиентСервер.ИзменитьЭлементыОтбора(СписокОС.КомпоновщикНастроек.ФиксированныеНастройки.Отбор,
				ИмяПоля,, ОтборМОЛ, ВидСравненияКомпоновкиДанных.Равно);
		КонецЕсли;
	Иначе 
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(СписокОС, ИмяПоля);
	КонецЕсли;	

	ИмяПоля = "Состояние";
	Если ЗначениеЗаполнено(ОтборСостояние) Тогда 
		МассивЭлементов = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(СписокОС.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, ИмяПоля);
		Если МассивЭлементов.Количество() = 0 Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(СписокОС.КомпоновщикНастроек.ФиксированныеНастройки.Отбор,
				ИмяПоля, ВидСравненияКомпоновкиДанных.Равно, ОтборСостояние);
		Иначе
			ОбщегоНазначенияКлиентСервер.ИзменитьЭлементыОтбора(СписокОС.КомпоновщикНастроек.ФиксированныеНастройки.Отбор,
				ИмяПоля,, ОтборСостояние, ВидСравненияКомпоновкиДанных.Равно);
		КонецЕсли;
	Иначе 
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(СписокОС, ИмяПоля);
	КонецЕсли;	
	
	ИмяПоля = "ГруппаНУ";
	Если ЗначениеЗаполнено(ОтборГруппаНУ) Тогда 
		МассивЭлементов = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(СписокОС.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, ИмяПоля);
		Если МассивЭлементов.Количество() = 0 Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(СписокОС.КомпоновщикНастроек.ФиксированныеНастройки.Отбор,
				ИмяПоля, ВидСравненияКомпоновкиДанных.Равно, ОтборГруппаНУ);
		Иначе
			ОбщегоНазначенияКлиентСервер.ИзменитьЭлементыОтбора(СписокОС.КомпоновщикНастроек.ФиксированныеНастройки.Отбор,
				ИмяПоля,, ОтборГруппаНУ, ВидСравненияКомпоновкиДанных.Равно);
		КонецЕсли;
	Иначе 
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(СписокОС, ИмяПоля);
	КонецЕсли;	
	
	// Регистры
	ИмяПоля = "ОсновноеСредство";
	
	//// МестонахождениеОС
	//Если ВсеОсновныеСредства Тогда 
	//	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(МестонахождениеОС, ИмяПоля);
	//Иначе 
	//	МассивЭлементов = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(МестонахождениеОС.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, ИмяПоля);
	//	Если МассивЭлементов.Количество() = 0 Тогда
	//		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(МестонахождениеОС.КомпоновщикНастроек.ФиксированныеНастройки.Отбор,
	//			ИмяПоля, ВидСравненияКомпоновкиДанных.Равно, ОсновноеСредство);
	//	Иначе
	//		ОбщегоНазначенияКлиентСервер.ИзменитьЭлементыОтбора(МестонахождениеОС.КомпоновщикНастроек.ФиксированныеНастройки.Отбор,
	//			ИмяПоля,, ОсновноеСредство, ВидСравненияКомпоновкиДанных.Равно);
	//	КонецЕсли;
	//КонецЕсли;	
	//
	//// СобытияОС
	//Если ВсеОсновныеСредства Тогда 
	//	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(СобытияОС, ИмяПоля);
	//Иначе 
	//	МассивЭлементов = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(СобытияОС.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, ИмяПоля);
	//	Если МассивЭлементов.Количество() = 0 Тогда
	//		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(СобытияОС.КомпоновщикНастроек.ФиксированныеНастройки.Отбор,
	//			ИмяПоля, ВидСравненияКомпоновкиДанных.Равно, ОсновноеСредство);
	//	Иначе
	//		ОбщегоНазначенияКлиентСервер.ИзменитьЭлементыОтбора(СобытияОС.КомпоновщикНастроек.ФиксированныеНастройки.Отбор,
	//			ИмяПоля,, ОсновноеСредство, ВидСравненияКомпоновкиДанных.Равно);
	//	КонецЕсли;
	//КонецЕсли;	
	//
	//// СостояниеОС
	//Если ВсеОсновныеСредства Тогда 
	//	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(СостояниеОС, ИмяПоля);
	//Иначе 
	//	МассивЭлементов = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(СостояниеОС.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, ИмяПоля);
	//	Если МассивЭлементов.Количество() = 0 Тогда
	//		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(СостояниеОС.КомпоновщикНастроек.ФиксированныеНастройки.Отбор,
	//			ИмяПоля, ВидСравненияКомпоновкиДанных.Равно, ОсновноеСредство);
	//	Иначе
	//		ОбщегоНазначенияКлиентСервер.ИзменитьЭлементыОтбора(СостояниеОС.КомпоновщикНастроек.ФиксированныеНастройки.Отбор,
	//			ИмяПоля,, ОсновноеСредство, ВидСравненияКомпоновкиДанных.Равно);
	//	КонецЕсли;
	//КонецЕсли;	
	//
	//// ПараметрыУчетаОС
	//Если ВсеОсновныеСредства Тогда 
	//	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(ПараметрыУчетаОС, ИмяПоля);
	//Иначе 
	//	МассивЭлементов = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(ПараметрыУчетаОС.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, ИмяПоля);
	//	Если МассивЭлементов.Количество() = 0 Тогда
	//		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ПараметрыУчетаОС.КомпоновщикНастроек.ФиксированныеНастройки.Отбор,
	//			ИмяПоля, ВидСравненияКомпоновкиДанных.Равно, ОсновноеСредство);
	//	Иначе
	//		ОбщегоНазначенияКлиентСервер.ИзменитьЭлементыОтбора(ПараметрыУчетаОС.КомпоновщикНастроек.ФиксированныеНастройки.Отбор,
	//			ИмяПоля,, ОсновноеСредство, ВидСравненияКомпоновкиДанных.Равно);
	//	КонецЕсли;
	//КонецЕсли;	
	
	ОбновитьПодвалыЗакладок();
КонецПроцедуры

// Функция получения ссылок документов.
//
// Параметры:
//	Ссылка - ДокументСсылка - ссылка на выбранный документ.
//
// Возвращаемое значение:
//	Имя - Строка - название документа.
//
&НаСервере
Функция ПолучитьНазваниеДокумента(Ссылка)
	
	Возврат Ссылка.Метаданные().Имя

КонецФункции

&НаКлиенте
Процедура РассчитатьИтогАмортизацииЗаМесяц(СтруктураПоиска)

	МассивСтрок = РасшифровкаПоСобытиямОС.НайтиСтроки(СтруктураПоиска);
	
	ИтогАмортизацияЗаМесяц = 0;
	
	Для Каждого СтрокаМассива Из МассивСтрок Цикл			
		ИтогАмортизацияЗаМесяц = ИтогАмортизацияЗаМесяц + СтрокаМассива.Амортизация;			
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция УстановитьПользовательскиеНастройкиОтчета(ТипОтчета, СтруктураПараметров)
    СтруктураНастроек = Новый Структура;
    ОтчетОбъект = Отчеты[ТипОтчета].Создать();
    
    ПользовательскиеНастройки = ОтчетОбъект.КомпоновщикНастроек.ПользовательскиеНастройки;
    Для Каждого ЭлПараметр  Из СтруктураПараметров Цикл
        Для Каждого ПараметрСКД Из ПользовательскиеНастройки.Элементы Цикл
            Если ТипЗнч(ПараметрСКД) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда  
                Если строка(ПараметрСКД.Параметр) = ЭлПараметр.Ключ Тогда 
                    ПараметрСКД.Значение = ЭлПараметр.Значение;
                    ПараметрСКД.Использование = Истина;
                КонецЕсли;
            КонецЕсли;
        КонецЦикла;    
    КонецЦикла;
        
    Возврат ПользовательскиеНастройки;
КонецФункции

&НаКлиенте
Процедура ОткрытьОтчет(Отчет, ГруппировкаОтчета = Неопределено, 
	Отборы = Неопределено, РеквизитыОтчета = Неопределено, Показатели = Неопределено, КлючВарианта = Неопределено, 
	НачалоПериода = Неопределено, КонецПериода = Неопределено)
	
	ПользовательскиеНастройки = ПользовательскиеНастройкиДляРасшифровки(НачалоПериода, КонецПериода);
	ДополнительныеСвойства = ПользовательскиеНастройки.ДополнительныеСвойства;
	
	Если ГруппировкаОтчета <> Неопределено И ТипЗнч(ГруппировкаОтчета) = Тип("Массив") Тогда
		ДополнительныеСвойства.Вставить("Группировка", ГруппировкаОтчета);
	КонецЕсли;
	
	Если ТипЗнч(Отборы) = Тип("Массив") Тогда
		
		НастройкаОтбора = ПользовательскиеНастройки.Элементы.Добавить(Тип("ОтборКомпоновкиДанных"));
		НастройкаОтбора.ИдентификаторПользовательскойНастройки = "Отбор";
		Для Каждого Отбор Из Отборы Цикл
			БухгалтерскиеОтчетыКлиентСервер.ДобавитьОтбор(НастройкаОтбора, Отбор.Поле, Отбор.Значение, Отбор.ВидСравнения);
		КонецЦикла;
		
	КонецЕсли;
	
	Если ТипЗнч(РеквизитыОтчета) = Тип("Структура") Тогда
		Для Каждого РеквизитОтчета Из РеквизитыОтчета Цикл
			ДополнительныеСвойства.Вставить(РеквизитОтчета.Ключ, РеквизитОтчета.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Если ТипЗнч(Показатели) = Тип("Массив") Тогда
		Для Каждого Показатель Из Показатели Цикл
			ДополнительныеСвойства.Вставить(Показатель, Истина);
		КонецЦикла;
	КонецЕсли;
	
	Если КлючВарианта <> Неопределено Тогда
		ДополнительныеСвойства.Вставить("КлючВарианта", КлючВарианта);
	КонецЕсли;
	
	ЗаполняемыеНастройки = Новый Структура("Показатели, Группировка, Отбор, ВыводимыеДанные", Истина, Истина, Ложь, Ложь);

	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("РежимРасшифровки"         , Истина);
	ПараметрыОтчета.Вставить("ВидРасшифровки"           , 2);
	ПараметрыОтчета.Вставить("ПользовательскиеНастройки", ПользовательскиеНастройки);
	ПараметрыОтчета.Вставить("ЗаполняемыеНастройки", ЗаполняемыеНастройки);

	ОткрытьФорму(Отчет, ПараметрыОтчета, ЭтотОбъект, Истина);
	
КонецПроцедуры

&НаКлиенте
Функция ПользовательскиеНастройкиДляРасшифровки(НачалоПериода = Неопределено, КонецПериода = Неопределено)
	
	// Инициализация пользовательских настроек
	ПользовательскиеНастройки = Новый ПользовательскиеНастройкиКомпоновкиДанных;
	
	ДополнительныеСвойства = ПользовательскиеНастройки.ДополнительныеСвойства;
	ДополнительныеСвойства.Вставить("РежимРасшифровки", Истина);
	ДополнительныеСвойства.Вставить("Период", НачалоПериода);
	
	Если ЗначениеЗаполнено(Организация) Тогда
		ДополнительныеСвойства.Вставить("Организация", Организация);
	КонецЕсли;
	
	Если НачалоПериода <> Неопределено Тогда
		ДополнительныеСвойства.Вставить("НачалоПериода", НачалоПериода);
	КонецЕсли;
	Если КонецПериода <> Неопределено Тогда
		ДополнительныеСвойства.Вставить("КонецПериода", КонецПериода);
	КонецЕсли;
	
	Возврат ПользовательскиеНастройки;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьПериод(Отказ)

	Страница = Элементы.СтраницыОбработки.ТекущаяСтраница.Имя;
	
	Если ДатаНачала > ДатаОкончания
		И (Страница = "СтраницаСвод" 
		ИЛИ Страница = "СтраницаАмортизацияОСЗаПериод" 
		ИЛИ Страница = "СтраницаСводПоСчетам") Тогда
		
		ТекстСообщения = НСтр("ru = 'Дата начала периода не может быть больше даты конца периода.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "ДатаНачала",,Отказ);	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройки(ТолькоДанныеУП = Ложь)

	ДанныеУчетнойПолитики = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьДанныеУчетнойПолитикиОрганизаций(ДатаОкончания, Организация);	

	НачислениеАмортизацииОСПоМесяцам = ДанныеУчетнойПолитики.НачислениеАмортизацииОСПоМесяцам;
	МинимумСтоимостиОСДляНУ 		 = ДанныеУчетнойПолитики.МинимумСтоимостиОСДляНУ;
	
	Если НЕ ТолькоДанныеУП Тогда
		УчетДвиженияОСПоПодразделениям	= Константы.ФункциональнаяОпцияУчетДвиженияОСПоПодразделениям.Получить();
		УчетДвиженияОСПоМОЛ				= Константы.ФункциональнаяОпцияУчетДвиженияОСПоМОЛ.Получить();
		ВестиУчетОСПоКомплектам			= Константы.ФункциональнаяОпцияВестиУчетОСПоКомплектам.Получить();
		ВычетНАПриМодернизации			= Константы.ВычетНАПриМодернизации.Получить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДобавитьПорядок(Порядок)

	// ОС
	ЭлементПорядка = Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	ЭлементПорядка.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
	ЭлементПорядка.Использование = Истина;
	ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных("ОсновноеСредство");
	ЭлементПорядка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;

	// Период
	ЭлементПорядка = Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	ЭлементПорядка.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
	ЭлементПорядка.Использование = Истина;
	ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных("Период");
	ЭлементПорядка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;

КонецПроцедуры 

&НаКлиенте
Процедура УстановитьОтбор()

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ВыработкаОС, "ОсновноеСредство", ОсновноеСредство,,,ЗначениеЗаполнено(ОсновноеСредство)); 
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДвижениеОСНУ, "ОсновноеСредство", ОсновноеСредство,,,ЗначениеЗаполнено(ОсновноеСредство)); 
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗемельныйНалог, "ОсновноеСредство", ОсновноеСредство,,,ЗначениеЗаполнено(ОсновноеСредство)); 
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(МестонахождениеОС, "ОсновноеСредство", ОсновноеСредство,,,ЗначениеЗаполнено(ОсновноеСредство)); 
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(НалоговаяАмортизация, "ОсновноеСредство", ОсновноеСредство,,,ЗначениеЗаполнено(ОсновноеСредство)); 
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПараметрыРасчетаЗемельногоНалога, "ОсновноеСредство", ОсновноеСредство,,,ЗначениеЗаполнено(ОсновноеСредство)); 
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПараметрыУчетаОС, "ОсновноеСредство", ОсновноеСредство,,,ЗначениеЗаполнено(ОсновноеСредство)); 
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПродажиОсновныхСредств, "ОсновноеСредство", ОсновноеСредство,,,ЗначениеЗаполнено(ОсновноеСредство)); 
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СведенияОбИмуществе, "ОсновноеСредство", ОсновноеСредство,,,ЗначениеЗаполнено(ОсновноеСредство)); 
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СведенияПоНалогуНаИмущество, "ОсновноеСредство", ОсновноеСредство,,,ЗначениеЗаполнено(ОсновноеСредство)); 
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СобытияОС, "ОсновноеСредство", ОсновноеСредство,,,ЗначениеЗаполнено(ОсновноеСредство)); 
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СоставОС, "ОсновноеСредство", ОсновноеСредство,,,ЗначениеЗаполнено(ОсновноеСредство)); 
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СостоянияОС, "ОсновноеСредство", ОсновноеСредство,,,ЗначениеЗаполнено(ОсновноеСредство)); 
	
КонецПроцедуры 

#КонецОбласти

#Область РедактированиеМесяцаСтрокой

&НаКлиенте
Процедура ПериодМонитораПриИзменении(Элемент)
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(ЭтаФорма, "Дата", "МесяцСтрокой", Модифицированность);
	ФормированиеНалогаНаИмущество();
КонецПроцедуры

&НаКлиенте
Процедура ПериодМонитораНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ПериодМонитораНачалоВыбораЗавершение", ЭтотОбъект);
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(ЭтаФорма, ЭтаФорма, "Дата", "МесяцСтрокой",, Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ПериодМонитораРегулирование(Элемент, Направление, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(ЭтаФорма, "Дата", "МесяцСтрокой", Направление, Модифицированность);
КонецПроцедуры

&НаКлиенте
Процедура ПериодМонитораАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ПериодМонитораОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ПериодМонитораНачалоВыбораЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт

	ФормированиеНалогаНаИмущество();	

КонецПроцедуры

#КонецОбласти

#Область ФоновоеЗаданиеПерепровестиДокументы

// Функция получения ссылок документов.
//
// Возвращаемое значение:
//	МассивСсылок - Массив - Массив ссылок документов.
//
&НаСервере
Функция ПолучитьМассивСсылокДляПерепроведения()

	РасшифровкаПоСобытиямОС.Сортировать("Дата Возр");
	МассивСсылок = Новый Массив;
	Для каждого СтрокаТаблицы Из РасшифровкаПоСобытиямОС Цикл
		Если ТипЗнч(СтрокаТаблицы.Документ) <> Тип("ДокументСсылка.ИнвентаризацияОС") Тогда 
			МассивСсылок.Добавить(СтрокаТаблицы.Документ);
		КонецЕсли;
	КонецЦикла;

	Возврат МассивСсылок;	

КонецФункции

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	Попытка
		Если ЗаданиеВыполнено(ИдентификаторЗадания) Тогда 
			ЭтаФорма.СостояниеПрогресса = 100;
			ЗагрузитьПодготовленныеДанные();
			ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеИспользовать");
		Иначе
			ДанныеПрогресса = ПолучитьИзВременногоХранилища(АдресХранилищаПрогресса);
			ЭтаФорма.СостояниеПрогресса = ДанныеПрогресса;
			ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
			ПодключитьОбработчикОжидания(
				"Подключаемый_ПроверитьВыполнениеЗадания", 
				ПараметрыОбработчикаОжидания.ТекущийИнтервал, 
				Истина);
		КонецЕсли;
	Исключение
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеИспользовать");
		ВызватьИсключение;
	КонецПопытки;	
КонецПроцедуры

// Функция перепроведения документов.
//
// Параметры:
//	ПараметрыКоманды - Структура - параметры.
//
// Возвращаемое значение:
//	РезультатВыполнения - Структура - результат выполнения перепроведения.
//
&НаСервере
Функция ПерепровестиДокументыНаСервере(ПараметрыКоманды)
	Если Не ПроверитьЗаполнение() Тогда 
		Возврат Новый Структура("ЗаданиеВыполнено", Истина);
	КонецЕсли;
	
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
	
	ИдентификаторЗадания = Неопределено;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеИспользовать");
	
	АдресРасшифровки = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	АдресХранилищаПрогресса = ПоместитьВоВременноеХранилище(, УникальныйИдентификатор);
	ПараметрыКоманды.Вставить("АдресРасшифровки", АдресРасшифровки);
	ПараметрыКоманды.Вставить("АдресХранилищаПрогресса", АдресХранилищаПрогресса);
	
	РезультатВыполнения = ДлительныеОперации.ЗапуститьВыполнениеВФоне(
		УникальныйИдентификатор,
		"Обработки.МониторОС.ПерепровестиДокументы",
		ПараметрыКоманды,
		СтрШаблон(НСтр("ru = 'Перепроведение документов: %1'"), ЭтаФорма.Заголовок));
	
	АдресХранилища       = РезультатВыполнения.АдресХранилища;
	ИдентификаторЗадания = РезультатВыполнения.ИдентификаторЗадания;
	
	Если РезультатВыполнения.ЗаданиеВыполнено Тогда
		ЗагрузитьПодготовленныеДанные();
	КонецЕсли;
	
	Возврат РезультатВыполнения;
КонецФункции

// Процедура вывода информации о перепроведении в табличный документ.
//
&НаСервере
Процедура ЗагрузитьПодготовленныеДанные()
	РезультатВыполнения = ПолучитьИзВременногоХранилища(АдресХранилища);
	Результат         = РезультатВыполнения.Результат;
	
	ИдентификаторЗадания = Неопределено;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(ИдентификаторЗадания)
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
КонецФункции

&НаКлиенте
Процедура АмортизацияПоОСПриАктивизацииСтроки(Элемент)
	УстановитьВидимостьДоступностьЭлементов();
КонецПроцедуры

#КонецОбласти
