
&НаКлиенте
Процедура СчетУчетаПриИзменении(Элемент)
	ВидОперации = ПолучитьВидОперации(Объект.Ссылка);	
	Если ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийППИ.ПрочийРасход") Тогда
		Принадлежит1100 = ПроверкаСчета11хх(Объект.СчетУчета);
		Если Принадлежит1100 Тогда
			Объект.СчетУчета = ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ПустаяСсылка");		
			Сообщение = Новый СообщениеПользователю();
		    Сообщение.Текст = "В этой операции ППИ нельзя устанавливать счет учета по кассе! ";
		    Сообщение.Поле = "Объект.СчетУчета";
		    Сообщение.УстановитьДанные(Объект);
		    Сообщение.Сообщить();				
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверкаСчета11хх(СчетУчета)

	Возврат СчетУчета.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ДенежныеСредстваВКассе);
	
КонецФункции  

&НаСервереБезКонтекста
Функция ПолучитьВидОперации(Операция)

	Возврат Операция.ВидОперации;	

КонецФункции  

