#Область ПроцедурыИФункцииОбщегоНазначения

&НаСервере
Процедура ИнформационнаяПанельЗаполнить(ФизЛицо,ПатаметрыДопИнформации)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СотрудникиСрезПоследних.Период
		|ПОМЕСТИТЬ ВременнаяТаблицаУволен
		|ИЗ
		|	РегистрСведений.Сотрудники.СрезПоследних(
		|			,
		|			ФизЛицо = &ФизЛицо
		|				И ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)) КАК СотрудникиСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СотрудникиСрезПоследних.Период
		|ПОМЕСТИТЬ ВременнаяТаблицаПринят
		|ИЗ
		|	РегистрСведений.Сотрудники.СрезПоследних(
		|			,
		|			ФизЛицо = &ФизЛицо
		|				И ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Прием)) КАК СотрудникиСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СотрудникиСрезПоследних.Должность КАК ИнформацияФизлицоДолжность,
		|	СотрудникиСрезПоследних.Должность.Категория КАК ИнформацияФизлицоКатегория,
		|	СотрудникиСрезПоследних.Подразделение КАК ИнформацияФизлицоПодразделение,
		|	ВременнаяТаблицаУволен.Период КАК ИнформацияФизлицоДатаУвольнения,
		|	ВременнаяТаблицаПринят.Период КАК ИнформацияФизлицоДатаПриема
		|ИЗ
		|	РегистрСведений.Сотрудники.СрезПоследних(, ФизЛицо = &ФизЛицо) КАК СотрудникиСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаУволен КАК ВременнаяТаблицаУволен
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаПринят КАК ВременнаяТаблицаПринят
		|		ПО (ИСТИНА)";
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда 
		ЗаполнитьЗначенияСвойств(ПатаметрыДопИнформации,Выборка);
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма,ПатаметрыДопИнформации);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ДанныеТекущейСтроки = Элементы.Список.ТекущиеДанные;
	
	// Телефон
	ТелефонРабочийФизическиеЛица = ОбщегоНазначенияБПВызовСервера.КонтактнаяИнформацияОбъекта(ДанныеТекущейСтроки.Ссылка, 
		ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонРабочийФизическиеЛица"));
	
	ПатаметрыДопИнформации = Новый Структура;
	ПатаметрыДопИнформации.Вставить("ИнформацияФизлицоДатаПриема","");
	ПатаметрыДопИнформации.Вставить("ИнформацияФизлицоДатаУвольнения","");
	ПатаметрыДопИнформации.Вставить("ИнформацияФизлицоДолжность","");
	ПатаметрыДопИнформации.Вставить("ИнформацияФизлицоКатегория","");
	ПатаметрыДопИнформации.Вставить("ИнформацияФизлицоПодразделение","");
	ПатаметрыДопИнформации.Вставить("ИнформацияФизлицоТелефон", ТелефонРабочийФизическиеЛица);
	
	Если ДанныеТекущейСтроки <> Неопределено Тогда
		ИнформационнаяПанельЗаполнить(ДанныеТекущейСтроки.Ссылка,ПатаметрыДопИнформации);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область МеткиОтборов

&НаКлиенте
Процедура СвернутьРазвернутьПанельОтборов(Элемент)
	
	НовоеЗначениеВидимость = НЕ Элементы.ФильтрыНастройкиИДопИнфо.Видимость;
	РаботаСОтборамиКлиент.СвернутьРазвернутьПанельОтборов(ЭтотОбъект, НовоеЗначениеВидимость);
		
КонецПроцедуры

#КонецОбласти 
