#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура УстановкаПараметровСеанса(ИменаПараметровСеанса)
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыСервер.УстановкаПараметровСеанса(ИменаПараметровСеанса);
	// Конец СтандартныеПодсистемы
	
	// БиблиотекаЭлектронныхДокументов
	
	//ЭлектронноеВзаимодействие.УстановкаПараметровСеанса(ИменаПараметровСеанса);
	
	// Конец БиблиотекаЭлектронныхДокументов	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли