#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Настройки размещения в панели отчетов.
//
// Параметры:
//   Настройки - Коллекция - Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации()
//   НастройкиОтчета - СтрокаДереваЗначений - Настройки размещения всех вариантов отчета.
//       см. "Реквизиты для изменения" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
// Описание:
//   См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Вспомогательные методы:
//   НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//   ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина/Ложь); // Отчет поддерживает только этот режим.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	МодульВариантыОтчетов = ОбщегоНазначения.ОбщийМодуль("ВариантыОтчетов");
	МодульВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина);
	
	НастройкиВарианта = МодульВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "");
	НастройкиВарианта.Описание = НСтр("ru = 'Справка об оплате труда по категориям сотрудников.'");

	НастройкиВарианта.НастройкиДляПоиска.НаименованияПолей =
		НСтр("ru = 'Категория работающих
		|Заработная плата
		|в т.ч. премия из ФОТ
		|Итого по предприятию 
		|Командировочные (470 вид)'");
	НастройкиВарианта.НастройкиДляПоиска.НаименованияПараметровИОтборов =
		НСтр("ru = 'НачалоПериода
		|КонецПериода
		|Организация'");
	НастройкиВарианта.НастройкиДляПоиска.КлючевыеСлова = НСтр("ru = 'Справка об оплате труда по категориям сотрудников'");
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Процедура формирования отчета.
//
// Параметры:
// ПараметрыОтчета - структура - набор параметров, необходимых для построения отчета.
// 	АдресХранилища - адрес временного хранилища.
Процедура Сформировать(СтруктураПараметров, АдресХранилища) Экспорт
	
	РезультатФормирования = Новый Структура("Результат, ОписаниеОшибки", Неопределено, "");
	СформироватьТабличныйДокумент(СтруктураПараметров, РезультатФормирования);
	ПоместитьВоВременноеХранилище(РезультатФормирования, АдресХранилища);
	
КонецПроцедуры

// Процедура - Сформировать табличный документ
//
// Параметры:
//  СтруктураПараметров	 - Структура - Параметры формирования отчета.
//  РезультатФормирования	 	- Структура - 
//
Процедура СформироватьТабличныйДокумент(СтруктураПараметров, РезультатФормирования)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "СправкаОбОплатеТрудаПоКатегориямСотрудников_ОплатаТрудаПоКатегориям";
	
	Организация = СтруктураПараметров.Организация;
	НачалоПериода = НачалоДня(СтруктураПараметров.НачалоПериода);
	КонецПериода = КонецДня(СтруктураПараметров.КонецПериода);
	
	Макет = ПолучитьМакет("ПФ_MXL_ОплатаТрудаПоКатегориям");

	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.ПериодПредставление = ПредставлениеПериода(НачалоПериода, КонецПериода);
	ОбластьШапка.Параметры.Дата = ТекущаяДата();
	ОбластьШапка.Параметры.Организация = Организация.НаименованиеПолное;
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	ОбластьВидНалога	= Макет.ПолучитьОбласть("ШапкаТаблицы");
    ТабличныйДокумент.Вывести(ОбластьВидНалога);	
	
	Запрос = Новый Запрос;
	ТекстЗапроса =		
	"ВЫБРАТЬ
	|	НачисленияЗаМесяц.Результат КАК СуммаЗП,
	|	НачисленияЗаМесяц.Должность.Категория,
	|	НачисленияЗаМесяц.ФизЛицо,
	|	НачисленияЗаМесяц.ВидРасчета
	|ПОМЕСТИТЬ ВременнаяТаблицаПоВсемКатегория
	|ИЗ
	|	РегистрРасчета.Начисления КАК НачисленияЗаМесяц
	|ГДЕ
	|	НачисленияЗаМесяц.ПериодРегистрации МЕЖДУ &НачалоПериода И &КонецПериода
	//|	И (НачисленияЗаМесяц.ВидРасчета.ГруппаНачисления = ЗНАЧЕНИЕ(Справочник.ГруппыНачислений.ПерваяГруппаУТО)
	//|			ИЛИ НачисленияЗаМесяц.ВидРасчета.ГруппаНачисления = ЗНАЧЕНИЕ(Справочник.ГруппыНачислений.ВтораяГруппаУТО)
	//|			ИЛИ НачисленияЗаМесяц.ВидРасчета.ГруппаНачисления = ЗНАЧЕНИЕ(Справочник.ГруппыНачислений.ТретьяГруппа)
	//|			ИЛИ НачисленияЗаМесяц.ВидРасчета.ГруппаНачисления = ЗНАЧЕНИЕ(Справочник.ГруппыНачислений.ЧетвертаяГруппа))
	|
	|СГРУППИРОВАТЬ ПО
	|	НачисленияЗаМесяц.Результат,
	|	НачисленияЗаМесяц.Должность.Категория,
	|	НачисленияЗаМесяц.ФизЛицо,
	|	НачисленияЗаМесяц.ВидРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК Порядок,
	|	""Руководители"" КАК КатегорияОписание
	|ПОМЕСТИТЬ ВременнаяТаблицаНаименованияКатегорий
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	""Специалисты""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	""Инженеры""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	4,
	|	""Служащие""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	5,
	|	""Рабочие повременщики""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	6,
	|	""Рабочие сдельщики""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	7,
	|	""Прочие служащие""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	8,
	|	""Без категории""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаПоВсемКатегория.ФизЛицо,
	|	ВременнаяТаблицаПоВсемКатегория.СуммаЗП КАК Размер
	|ПОМЕСТИТЬ ВременнаяТаблицаПремии
	|ИЗ
	|	ВременнаяТаблицаПоВсемКатегория КАК ВременнаяТаблицаПоВсемКатегория
	|ГДЕ
	|	ПОДСТРОКА(ВременнаяТаблицаПоВсемКатегория.ВидРасчета.Код, 1, 3) = ""008""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВременнаяТаблицаПоВсемКатегория.ФизЛицо,
	|	ВременнаяТаблицаПоВсемКатегория.СуммаЗП
	|ИЗ
	|	ВременнаяТаблицаПоВсемКатегория КАК ВременнаяТаблицаПоВсемКатегория
	|ГДЕ
	|	ПОДСТРОКА(ВременнаяТаблицаПоВсемКатегория.ВидРасчета.Код, 1, 3) = ""011""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВременнаяТаблицаПоВсемКатегория.ФизЛицо,
	|	ВременнаяТаблицаПоВсемКатегория.СуммаЗП
	|ИЗ
	|	ВременнаяТаблицаПоВсемКатегория КАК ВременнаяТаблицаПоВсемКатегория
	|ГДЕ
	|	ПОДСТРОКА(ВременнаяТаблицаПоВсемКатегория.ВидРасчета.Код, 1, 3) = ""012""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаПремии.ФизЛицо,
	|	СУММА(ВременнаяТаблицаПремии.Размер) КАК Размер
	|ПОМЕСТИТЬ ВременнаяТаблицаПремииГруппировка
	|ИЗ
	|	ВременнаяТаблицаПремии КАК ВременнаяТаблицаПремии
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаПремии.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК Порядок,
	|	""Руководители"" КАК КатегорияОписание,
	|	СУММА(ВременнаяТаблицаПремииГруппировка.Размер) КАК СуммаПремии,
	|	СУММА(ВременнаяТаблицаПоВсемКатегория.СуммаЗП) КАК СуммаЗП
	|ПОМЕСТИТЬ ВременнаяТаблицаПоКатегориям
	|ИЗ
	|	ВременнаяТаблицаПоВсемКатегория КАК ВременнаяТаблицаПоВсемКатегория
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаПремииГруппировка КАК ВременнаяТаблицаПремииГруппировка
	|		ПО ВременнаяТаблицаПоВсемКатегория.ФизЛицо = ВременнаяТаблицаПремииГруппировка.ФизЛицо
	|ГДЕ
	|	ВременнаяТаблицаПоВсемКатегория.ДолжностьКатегория = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностей.Руководители)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	""Специалисты"",
	|	ВременнаяТаблицаПремииГруппировка.Размер,
	|	ВременнаяТаблицаПоВсемКатегория.СуммаЗП
	|ИЗ
	|	ВременнаяТаблицаПоВсемКатегория КАК ВременнаяТаблицаПоВсемКатегория
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаПремииГруппировка КАК ВременнаяТаблицаПремииГруппировка
	|		ПО ВременнаяТаблицаПоВсемКатегория.ФизЛицо = ВременнаяТаблицаПремииГруппировка.ФизЛицо
	|ГДЕ
	|	ВременнаяТаблицаПоВсемКатегория.ДолжностьКатегория = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностей.Специалисты)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаПремииГруппировка.Размер,
	|	ВременнаяТаблицаПоВсемКатегория.СуммаЗП
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	""Инженеры"",
	|	ВременнаяТаблицаПремииГруппировка.Размер,
	|	ВременнаяТаблицаПоВсемКатегория.СуммаЗП
	|ИЗ
	|	ВременнаяТаблицаПоВсемКатегория КАК ВременнаяТаблицаПоВсемКатегория
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаПремииГруппировка КАК ВременнаяТаблицаПремииГруппировка
	|		ПО ВременнаяТаблицаПоВсемКатегория.ФизЛицо = ВременнаяТаблицаПремииГруппировка.ФизЛицо
	|ГДЕ
	|	ВременнаяТаблицаПоВсемКатегория.ДолжностьКатегория = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностей.Инженеры)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаПремииГруппировка.Размер,
	|	ВременнаяТаблицаПоВсемКатегория.СуммаЗП
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	4,
	|	""Инженеры"",
	|	ВременнаяТаблицаПремииГруппировка.Размер,
	|	ВременнаяТаблицаПоВсемКатегория.СуммаЗП
	|ИЗ
	|	ВременнаяТаблицаПоВсемКатегория КАК ВременнаяТаблицаПоВсемКатегория
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаПремииГруппировка КАК ВременнаяТаблицаПремииГруппировка
	|		ПО ВременнаяТаблицаПоВсемКатегория.ФизЛицо = ВременнаяТаблицаПремииГруппировка.ФизЛицо
	|ГДЕ
	|	ВременнаяТаблицаПоВсемКатегория.ДолжностьКатегория = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностей.Служащие)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаПремииГруппировка.Размер,
	|	ВременнаяТаблицаПоВсемКатегория.СуммаЗП
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	5,
	|	""Рабочие повременщики"",
	|	ВременнаяТаблицаПремииГруппировка.Размер,
	|	ВременнаяТаблицаПоВсемКатегория.СуммаЗП
	|ИЗ
	|	ВременнаяТаблицаПоВсемКатегория КАК ВременнаяТаблицаПоВсемКатегория
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаПремииГруппировка КАК ВременнаяТаблицаПремииГруппировка
	|		ПО ВременнаяТаблицаПоВсемКатегория.ФизЛицо = ВременнаяТаблицаПремииГруппировка.ФизЛицо
	|ГДЕ
	|	ВременнаяТаблицаПоВсемКатегория.ДолжностьКатегория = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностей.Повременщики)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаПремииГруппировка.Размер,
	|	ВременнаяТаблицаПоВсемКатегория.СуммаЗП
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	6,
	|	""Рабочие сдельщики"",
	|	ВременнаяТаблицаПремииГруппировка.Размер,
	|	ВременнаяТаблицаПоВсемКатегория.СуммаЗП
	|ИЗ
	|	ВременнаяТаблицаПоВсемКатегория КАК ВременнаяТаблицаПоВсемКатегория
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаПремииГруппировка КАК ВременнаяТаблицаПремииГруппировка
	|		ПО ВременнаяТаблицаПоВсемКатегория.ФизЛицо = ВременнаяТаблицаПремииГруппировка.ФизЛицо
	|ГДЕ
	|	ВременнаяТаблицаПоВсемКатегория.ДолжностьКатегория = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностей.Сдельщики)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаПремииГруппировка.Размер,
	|	ВременнаяТаблицаПоВсемКатегория.СуммаЗП
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	7,
	|	""Прочие служащие"",
	|	ВременнаяТаблицаПремииГруппировка.Размер,
	|	ВременнаяТаблицаПоВсемКатегория.СуммаЗП
	|ИЗ
	|	ВременнаяТаблицаПоВсемКатегория КАК ВременнаяТаблицаПоВсемКатегория
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаПремииГруппировка КАК ВременнаяТаблицаПремииГруппировка
	|		ПО ВременнаяТаблицаПоВсемКатегория.ФизЛицо = ВременнаяТаблицаПремииГруппировка.ФизЛицо
	|ГДЕ
	|	ВременнаяТаблицаПоВсемКатегория.ДолжностьКатегория = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностей.ПрочиеСлужащие)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаПремииГруппировка.Размер,
	|	ВременнаяТаблицаПоВсемКатегория.СуммаЗП
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	8,
	|	""Без категории"",
	|	ВременнаяТаблицаПремииГруппировка.Размер,
	|	ВременнаяТаблицаПоВсемКатегория.СуммаЗП
	|ИЗ
	|	ВременнаяТаблицаПоВсемКатегория КАК ВременнаяТаблицаПоВсемКатегория
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаПремииГруппировка КАК ВременнаяТаблицаПремииГруппировка
	|		ПО ВременнаяТаблицаПоВсемКатегория.ФизЛицо = ВременнаяТаблицаПремииГруппировка.ФизЛицо
	|ГДЕ
	|	ВременнаяТаблицаПоВсемКатегория.ДолжностьКатегория = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностей.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаНаименованияКатегорий.Порядок,
	|	ВременнаяТаблицаНаименованияКатегорий.КатегорияОписание КАК КатегорияОписание,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблицаПоКатегориям.СуммаПремии, 0)) КАК СуммаПремии,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблицаПоКатегориям.СуммаЗП, 0)) КАК СуммаЗП
	|ИЗ
	|	ВременнаяТаблицаНаименованияКатегорий КАК ВременнаяТаблицаНаименованияКатегорий
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаПоКатегориям КАК ВременнаяТаблицаПоКатегориям
	|		ПО ВременнаяТаблицаНаименованияКатегорий.КатегорияОписание = ВременнаяТаблицаПоКатегориям.КатегорияОписание
	|			И ВременнаяТаблицаНаименованияКатегорий.Порядок = ВременнаяТаблицаПоКатегориям.Порядок
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаНаименованияКатегорий.КатегорияОписание,
	|	ВременнаяТаблицаНаименованияКатегорий.Порядок
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВременнаяТаблицаНаименованияКатегорий.Порядок
	|ИТОГИ
	|	СУММА(СуммаПремии),
	|	СУММА(СуммаЗП)
	|ПО
	|	ОБЩИЕ";
	
	Запрос.УстановитьПараметр("НачалоПериода",	НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",	КонецПериода);
	Если ЗначениеЗаполнено(Организация) Тогда
		Запрос.УстановитьПараметр("Организация", Организация);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Организация = &Организация", "Истина");
	КонецЕсли;		
	
	Запрос.Текст = ТекстЗапроса;
	ВыборкаОбщая = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	Пока ВыборкаОбщая.Следующий() Цикл									
		ВыборкаСтрока = ВыборкаОбщая.Выбрать();
		Пока ВыборкаСтрока.Следующий() Цикл
			ОбластьСтрока	= Макет.ПолучитьОбласть("Строка");
			ОбластьСтрока.Параметры.Заполнить(ВыборкаСтрока);
		    ТабличныйДокумент.Вывести(ОбластьСтрока);
		КонецЦикла;												
		ИтогОбщий	= Макет.ПолучитьОбласть("ИтогоПоПредприятию");
		ИтогОбщий.Параметры.Заполнить(ВыборкаОбщая);
		ТабличныйДокумент.Вывести(ИтогОбщий);
		
	КонецЦикла;
	
	// Выбираем командировочные
	//
	ТекстЗапроса =		
	"ВЫБРАТЬ
	|	СУММА(КомандировкаСотрудники.СуммаВсего) КАК Сумма
	|ИЗ
	|	Документ.Командировка.Сотрудники КАК КомандировкаСотрудники
	|ГДЕ
	|	КомандировкаСотрудники.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
	
	Запрос.Текст 	= ТекстЗапроса;
	Выборка 		= Запрос.Выполнить().Выбрать();	

	Если Выборка.Следующий() Тогда 
		ОбластьКомандировочные	= Макет.ПолучитьОбласть("СтрокаКомандировочные");
		ОбластьКомандировочные.Параметры.Заполнить(Выборка);
	    ТабличныйДокумент.Вывести(ОбластьКомандировочные);
	КонецЕсли;			
		
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
	РезультатФормирования.Результат = ТабличныйДокумент;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
