#Область СписокЗадач

Функция ИмяБлокаЗадачи() Экспорт
	
	Возврат "Задачи";
	
КонецФункции

Функция СвойствоНаименованияЗадачи(Индекс) Экспорт
	
	Возврат СтрШаблон("Задачи_НаименованиеЗадачи%1", Индекс);
	
КонецФункции

Функция ТекстЗаголовкаЗадачи() Экспорт
	
	Возврат НСтр("ru = 'Задачи (календарь бухгалтера)'");
	
КонецФункции

Функция КоличествоЗадач() Экспорт
	
	Возврат 4;
	
КонецФункции

#КонецОбласти

#Область ОстаткиДенежныхСредств

Функция ИмяБлокаОстаткиДенежныхСредств() Экспорт
	
	Возврат "ОстаткиДенежныхСредств";
	
КонецФункции

Функция ТекстЗаголовкаОстаткиДенежныхСредств() Экспорт
	
	Возврат НСтр("ru = 'Остатки денежных средств'");
	
КонецФункции

Функция КоличествоВалютныхОстатков() Экспорт
	
	Возврат 2;
	
КонецФункции

Функция СвойствоОстатокДенежныхСредств(Индекс) Экспорт
	
	Возврат СтрШаблон("ОстаткиДенежныхСредств_Остаток%1", Индекс);
	
КонецФункции

#КонецОбласти

#Область Покупатели

Функция ИмяБлокаПокупатели() Экспорт
	
	Возврат "Покупатели";
	
КонецФункции

Функция ТекстЗаголовкаПокупатели() Экспорт
	
	Возврат НСтр("ru = 'Покупатели'");
	
КонецФункции

#КонецОбласти

#Область Поставщики

Функция ИмяБлокаПоставщики() Экспорт
	
	Возврат "Поставщики";
	
КонецФункции

Функция ТекстЗаголовкаПоставщики() Экспорт
	
	Возврат НСтр("ru = 'Поставщики'");
	
КонецФункции

#КонецОбласти

#Область Продажи

Функция ИмяБлокаПродажи() Экспорт
	
	Возврат "Продажи";
	
КонецФункции

Функция ТекстЗаголовкаПродажи() Экспорт
	
	Возврат НСтр("ru = 'Продажи'");
	
КонецФункции

Функция КоличествоПериодовПродаж() Экспорт
	
	Возврат 4;
	
КонецФункции

Функция СвойствоПериодПродаж(Индекс) Экспорт
	
	Возврат СтрШаблон("Продажи_Период%1", Индекс);
	
КонецФункции

Функция СвойствоСуммаПродаж(Индекс) Экспорт
	
	Возврат СтрШаблон("Продажи_Сумма%1", Индекс);
	
КонецФункции

Функция СвойствоОтклонениеПродаж(Индекс) Экспорт
	
	Возврат СтрШаблон("Продажи_Отклонение%1", Индекс);
	
КонецФункции

Функция ИдентификаторПродажиТекущегоМесяца() Экспорт
	
	Возврат "ТекущийМесяц";
	
КонецФункции

Функция ИдентификаторПродажиТекущегоМесяцаСНачалаГода() Экспорт
	
	Возврат "ТекущийМесяцСНачалаГода";
	
КонецФункции

Функция ИдентификаторПродажиПрошлогоМесяца() Экспорт
	
	Возврат "ПрошлыйМесяц";
	
КонецФункции

Функция ИдентификаторПродажиПрошлогоМесяцаСНачалаГода() Экспорт
	
	Возврат "ПрошлыйМесяцСНачалаГода";
	
КонецФункции

#КонецОбласти

#Область Новости

Функция ИмяБлокаНовости() Экспорт
	
	Возврат "Новости";
	
КонецФункции

Функция ТекстЗаголовкаНовости() Экспорт
	
	Возврат НСтр("ru = 'Новости'");
	
КонецФункции

Функция ИнтервалПереключенияНовостей() Экспорт
	
	Возврат 30;
	
КонецФункции

Функция КоличествоНовостей() Экспорт
	
	Возврат 5;
	
КонецФункции

Функция ИндексКартинкиПереключателя(Активный = Ложь) Экспорт
	
	Возврат ?(Активный, 2, 1);
	
КонецФункции

Функция СвойствоПереключатель(Индекс) Экспорт
	
	Возврат СтрШаблон("Новости_Переключатель%1", Индекс);
	
КонецФункции

Функция ТекстОтсутствияНовостей() Экспорт
	
	Возврат НСтр("ru = 'Сегодня новостей нет'");
	
КонецФункции

#КонецОбласти

#Область ТекущиеДела

Функция ИмяБлокаТекущиеДела() Экспорт
	
	Возврат "ТекущиеДела";
	
КонецФункции

Функция ТекстЗаголовкаТекущиеДела() Экспорт
	
	Возврат НСтр("ru = 'Текущие дела'");
	
КонецФункции

Функция ИнтервалПереключенияТекущиеДела() Экспорт
	
	Возврат 30;
	
КонецФункции

Функция КоличествоТекущиеДела() Экспорт
	
	Возврат 5;
	
КонецФункции

Функция СвойствоПереключательТекущиеДела(Индекс) Экспорт
	
	Возврат СтрШаблон("ТекущиеДела_Переключатель%1", Индекс);
	
КонецФункции

Функция ТекстОтсутствияТекущиеДела() Экспорт
	
	Возврат НСтр("ru = 'Сегодня текущих дел нет'");
	
КонецФункции

#КонецОбласти

#Область Заметки

Функция ИмяБлокаЗаметки() Экспорт
	
	Возврат "Заметки";
	
КонецФункции

Функция ТекстЗаголовкаЗаметки() Экспорт
	
	Возврат НСтр("ru = 'Заметки'");
	
КонецФункции

Функция ИнтервалПереключенияЗаметки() Экспорт
	
	Возврат 30;
	
КонецФункции

Функция КоличествоЗаметки() Экспорт
	
	Возврат 5;
	
КонецФункции

Функция СвойствоПереключательЗаметки(Индекс) Экспорт
	
	Возврат СтрШаблон("Заметки_Переключатель%1", Индекс);
	
КонецФункции

Функция ТекстОтсутствияЗаметки() Экспорт
	
	Возврат НСтр("ru = 'Нет заметок'");
	
КонецФункции

#КонецОбласти

#Область МетодическаяПоддержка

Функция ИмяБлокаМетодическаяПоддержка() Экспорт
	
	Возврат "МетодическаяПоддержка";
	
КонецФункции

Функция ТекстЗаголовкаМетодическаяПоддержка() Экспорт
	
	Возврат НСтр("ru = 'Методическая поддержка'");
	
КонецФункции

Функция КоличествоСсылокМетодическойПоддержки() Экспорт
	
	Возврат 4;
	
КонецФункции

Функция СвойствоСсылкаМетодическойПоддержки(Индекс) Экспорт
	
	Возврат СтрШаблон("МетодическаяПоддержка_Ссылка%1", Индекс);
	
КонецФункции

#КонецОбласти
