#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Функция -ПолучитьКонтактнуюИнформацию
//
// Параметры:
//  Организация  - Спр.Ссылка - Спр.Органинизации 
// Возвращаемое значение:
//  Структура   - структура данных контактной информации
//
Функция ПолучитьКонтактнуюИнформацию(Организация)
	
	СведенияОбОрганизации = БухгалтерскийУчетСервер.ПолучитьСведенияОбОрганизации(Организация);

	Индекс = СведенияОбОрганизации.Индекс; 
	
	ГородНасПункт   = ?(СведенияОбОрганизации.Город  = "",СведенияОбОрганизации.НаселенныйПункт,СведенияОбОрганизации.Город);
	АдрОбластьГород = ?(СведенияОбОрганизации.Регион = "","",СведенияОбОрганизации.Регион + ",")
		+ ?(СведенияОбОрганизации.Район  = "","", " " + СведенияОбОрганизации.Район + ",") 
		+ ?(ГородНасПункт = "",""," " + ГородНасПункт); 
	АдресОрганизации = ?(СведенияОбОрганизации.Улица    = "","",СведенияОбОрганизации.Улица + ",")
		+ ?(СведенияОбОрганизации.Дом      = "",""," " + СведенияОбОрганизации.Дом + ",")
		+ ?(СведенияОбОрганизации.Корпус   = "",""," " + СведенияОбОрганизации.Корпус + ",")
		+ ?(СведенияОбОрганизации.Квартира = "",""," " + СведенияОбОрганизации.Квартира);
		
	Телефон = СведенияОбОрганизации.Тел;
	
	Структура = Новый Структура("Индекс,АдрОбластьГород,АдресОрганизации,Телефон", Индекс,АдрОбластьГород,АдресОрганизации,Телефон);
	
	Возврат Структура;
	
КонецФункции // ПолучитьАдресОрганизации()

Процедура ЗаполнитьШапкуОтчета(СтруктураПараметров, ОбластьМакета)

	Организация = СтруктураПараметров.Организация;
	Год 		= Формат(Год(СтруктураПараметров.Дата), "ЧГ=0");	

	ОКПО              		= Организация.КодПоОКПО;
	ИНН 					= Организация.ИНН;
	КодГНС 					= Организация.ГНС.Код;
	НаменованиеНалоговой 	= Организация.ГНС.Наименование;
	НаименованиеОрганизации = Организация.НаименованиеПолное;	
	
	КонтактныеДанные = ПолучитьКонтактнуюИнформацию(Организация);
	
	Индекс           = КонтактныеДанные.Индекс;
	АдрОбластьГород  = КонтактныеДанные.АдрОбластьГород;
	ЮрАдрес	         = КонтактныеДанные.АдресОрганизации; 
	Телефон		     = КонтактныеДанные.Телефон;	
			
	ОбластьМакета.Параметры.НаименованиеОрганизации = НаименованиеОрганизации;
	ОбластьМакета.Параметры.НаименованиеНалоговой = НаменованиеНалоговой;
	
	Если ЗначениеЗаполнено(АдрОбластьГород) Тогда 
		ОбластьМакета.Параметры.Область = АдрОбластьГород;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЮрАдрес) Тогда 
		ОбластьМакета.Параметры.Адрес = ЮрАдрес;
	КонецЕсли;
	
	ОбластьМакета.Параметры.Телефон = Телефон;
	
	Если ЗначениеЗаполнено(Индекс) ТОгда		
		ОбластьМакета.Параметры.ИНД1 = Сред(Индекс,1,1);
		ОбластьМакета.Параметры.ИНД2 = Сред(Индекс,2,1);
		ОбластьМакета.Параметры.ИНД3 = Сред(Индекс,3,1);
		ОбластьМакета.Параметры.ИНД4 = Сред(Индекс,4,1);
		ОбластьМакета.Параметры.ИНД5 = Сред(Индекс,5,1);
		ОбластьМакета.Параметры.ИНД6 = Сред(Индекс,6,1);		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОКПО) Тогда 
		ОбластьМакета.Параметры.ОКПО1 = Сред(ОКПО,1,1);
		ОбластьМакета.Параметры.ОКПО2 = Сред(ОКПО,2,1);
		ОбластьМакета.Параметры.ОКПО3 = Сред(ОКПО,3,1);
		ОбластьМакета.Параметры.ОКПО4 = Сред(ОКПО,4,1);
		ОбластьМакета.Параметры.ОКПО5 = Сред(ОКПО,5,1);
		ОбластьМакета.Параметры.ОКПО6 = Сред(ОКПО,6,1);
		ОбластьМакета.Параметры.ОКПО7 = Сред(ОКПО,7,1);
		ОбластьМакета.Параметры.ОКПО8 = Сред(ОКПО,8,1);
	КонецЕсли;
	
	ОбластьМакета.Параметры.ИНН1 = Сред(ИНН, 1, 1);
	ОбластьМакета.Параметры.ИНН2 = Сред(ИНН, 2, 1);
	ОбластьМакета.Параметры.ИНН3 = Сред(ИНН, 3, 1);                           
	ОбластьМакета.Параметры.ИНН4 = Сред(ИНН, 4, 1);
	ОбластьМакета.Параметры.ИНН5 = Сред(ИНН, 5, 1);
	ОбластьМакета.Параметры.ИНН6 = Сред(ИНН, 6, 1);
	ОбластьМакета.Параметры.ИНН7 = Сред(ИНН, 7, 1);
	ОбластьМакета.Параметры.ИНН8 = Сред(ИНН, 8, 1);
	ОбластьМакета.Параметры.ИНН9 = Сред(ИНН, 9, 1);
	ОбластьМакета.Параметры.ИНН10 = Сред(ИНН, 10, 1);
	ОбластьМакета.Параметры.ИНН11 = Сред(ИНН, 11, 1);
	ОбластьМакета.Параметры.ИНН12 = Сред(ИНН, 12, 1);
	ОбластьМакета.Параметры.ИНН13 = Сред(ИНН, 13, 1);
	ОбластьМакета.Параметры.ИНН14 = Сред(ИНН, 14, 1);
	
	ОбластьМакета.Параметры.ГНС1 = Сред(КодГНС, 1, 1);
	ОбластьМакета.Параметры.ГНС2 = Сред(КодГНС, 2, 1);
	ОбластьМакета.Параметры.ГНС3 = Сред(КодГНС, 3, 1);
	
	ОбластьМакета.Параметры.ГОД1 = Сред(Год, 1, 1);	
	ОбластьМакета.Параметры.ГОД2 = Сред(Год, 2, 1);
	ОбластьМакета.Параметры.ГОД3 = Сред(Год, 3, 1);
	ОбластьМакета.Параметры.ГОД4 = Сред(Год, 4, 1);		
КонецПроцедуры

Процедура ЗаполнитьНомераЯчеекСтрокиОтчета(ОбластьМакета, ПервыйНомер, ГруппаИмущества, КодПризнакаТС = Неопределено)

	Если ГруппаИмущества = 4 Тогда
		ОбластьМакета.Параметры.номер1 = ПервыйНомер;
		ОбластьМакета.Параметры.номер2 = ПервыйНомер + 1;
		ОбластьМакета.Параметры.номер3 = ПервыйНомер + 2;
		ОбластьМакета.Параметры.номер4 = ПервыйНомер + 3;
		ОбластьМакета.Параметры.номер5 = ПервыйНомер + 4;
		ОбластьМакета.Параметры.номер6 = ПервыйНомер + 5;
		ОбластьМакета.Параметры.номер7 = ПервыйНомер + 6;
		
		Если КодПризнакаТС = "А" Тогда
			ОбластьМакета.Параметры.номер8 = ПервыйНомер + 7;
			ПервыйНомер = ПервыйНомер + 8;			
		Иначе
			ПервыйНомер = ПервыйНомер + 7;
		КонецЕсли;	
		
	Иначе
		ОбластьМакета.Параметры.ЕАЭС0  = ПервыйНомер;
		ОбластьМакета.Параметры.ЕАЭС1  = ПервыйНомер + 1;
		ОбластьМакета.Параметры.ЕАЭС2  = ПервыйНомер + 2;
		ОбластьМакета.Параметры.ЕАЭС3  = ПервыйНомер + 3;
		ОбластьМакета.Параметры.ЕАЭС4  = ПервыйНомер + 4;
		ОбластьМакета.Параметры.ЕАЭС5  = ПервыйНомер + 5;
		ОбластьМакета.Параметры.ЕАЭС6  = ПервыйНомер + 6;
		ОбластьМакета.Параметры.ЕАЭС7  = ПервыйНомер + 7;
		ОбластьМакета.Параметры.ЕАЭС8  = ПервыйНомер + 8;
		ОбластьМакета.Параметры.ЕАЭС9  = ПервыйНомер + 9;
		ОбластьМакета.Параметры.ЕАЭС10 = ПервыйНомер + 10;
		ОбластьМакета.Параметры.ЕАЭС11 = ПервыйНомер + 11;
		ОбластьМакета.Параметры.ЕАЭС12 = ПервыйНомер + 12;
		ОбластьМакета.Параметры.ЕАЭС13 = ПервыйНомер + 13;
		ОбластьМакета.Параметры.ЕАЭС14 = ПервыйНомер + 14;
		
		Если ГруппаИмущества = 2 Тогда
			ОбластьМакета.Параметры.ЕАЭС15 = ПервыйНомер + 15;	
			ПервыйНомер = ПервыйНомер + 16;
			
		ИначеЕсли ГруппаИмущества = 3 Тогда
			ПервыйНомер = ПервыйНомер + 15;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
	
#Область ВерсионированиеОбъектов

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область ИнтерфейсПечати

// Функция формирует табличный документ с печатной формой НалогаНаИмущество2Группы
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ОтчетПоНалогуНаИмущество2Группы(МассивОбъектов, ОбъектыПечати)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ПолеСлева = 0;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.КлючПараметровПечати = "ОтчетПоНалогуНаИмущество_Группа2";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетНалогНаИмущество.Ссылка КАК Ссылка,
		|	ОтчетНалогНаИмущество.Дата КАК Дата,
		|	ОтчетНалогНаИмущество.Организация КАК Организация,
		|	ОтчетНалогНаИмущество.Недвижимость.(
		|		ОсновноеСредство.ИдентификационныйНомерИмущества КАК ИдентификационныйКодИмущества,
		|		ОсновноеСредство.МестонахождениеИмущества КАК МестонахождениеИмущества,
		|		КоличествоМесяцев КАК КоличествоМесяцевВладения,
		|		Ставка КАК СтавкаНалога,
		|		СуммаНалога КАК СуммаНалога,
		|		ОценочнаяСтоимость КАК ОценочнаяСтоимостьМетр,
		|		ЖилаяПлощадь КАК ЖилаяПлощадь,
		|		МатериалСтен.Код КАК КодМатериала,
		|		Кр КАК Кр,
		|		Кз КАК Кз,
		|		Ко КАК Ко,
		|		ЗемНалог КАК СуммаЗемельногоНалога,
		|		КодИмущества КАК КодВидаИмущества,
		|		КодНазначенияИмущества.Код КАК КодНазначенияИмущества,
		|		КодПользователяИмущества КАК КодПользователяИмущества,
		|		ГОД(ОтчетНалогНаИмущество.Недвижимость.ДатаВводаВЭксплуатацию) КАК ГодВводаВЭксплуатацию
		|	) КАК Недвижимость,
		|	ОтчетНалогНаИмущество.Приложение.(
		|		Январь КАК СуммаЗаЯнварь,
		|		Февраль КАК СуммаЗаФевраль,
		|		Март КАК СуммаЗаМарт,
		|		Апрель КАК СуммаЗаАпрель,
		|		Май КАК СуммаЗаМай,
		|		Июнь КАК СуммаЗаИюнь,
		|		Июль КАК СуммаЗаИюль,
		|		Август КАК СуммаЗаАвгуст,
		|		Сентябрь КАК СуммаЗаСентябрь,
		|		Октябрь КАК СуммаЗаОктябрь,
		|		Ноябрь КАК СуммаЗаНоябрь,
		|		Декабрь КАК СуммаЗаДекабрь
		|	) КАК Приложение
		|ИЗ
		|	Документ.ОтчетПоНалогуНаИмущество КАК ОтчетНалогНаИмущество
		|ГДЕ
		|	ОтчетНалогНаИмущество.Ссылка В(&МассивОбъектов)
		|	И ОтчетНалогНаИмущество.Недвижимость.ГруппаИмущества = ЗНАЧЕНИЕ(Справочник.ГруппыИмущества.ГИ2)
		|
		|УПОРЯДОЧИТЬ ПО
		|	КодВидаИмущества";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Шапка = Запрос.Выполнить().Выбрать();
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетПоНалогуНаИмущество.ПФ_MXL_Группа2");	
	
	ПервыйНомер = 300;
	КоличествоСтрокНаЛисте = 1;
	
	СтруктураИтоги = Новый Структура();
	СтруктураИтоги.Вставить("ИтогоСуммаНалога", 			0);
	СтруктураИтоги.Вставить("ИтогоСуммаЗемельногоНалога", 	0);
	СтруктураИтоги.Вставить("СуммаНалогаКУплате", 			0);
	
	Пока Шапка.Следующий() Цикл		
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ПервыйНомер = 300;
			КоличествоСтрокНаЛисте = 1;
		КонецЕсли;		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", Шапка.Организация);
		СтруктураПараметров.Вставить("Дата", 		Шапка.Дата);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		
		ЗаполнитьШапкуОтчета(СтруктураПараметров, ОбластьМакета);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ВыборкаНедвижимость = Шапка.Недвижимость.Выбрать();
		КоличествоЗаписей = ВыборкаНедвижимость.Количество();
		ТекущаяЗапись = 1;
		
		Пока ВыборкаНедвижимость.Следующий() Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("ОбластьДанных");
			ОбластьМакета.Параметры.Заполнить(ВыборкаНедвижимость);
			
			ЗаполнитьНомераЯчеекСтрокиОтчета(ОбластьМакета, ПервыйНомер, 2);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			СтруктураИтоги.ИтогоСуммаНалога 			= СтруктураИтоги.ИтогоСуммаНалога 			+ ВыборкаНедвижимость.СуммаНалога;
			СтруктураИтоги.ИтогоСуммаЗемельногоНалога 	= СтруктураИтоги.ИтогоСуммаЗемельногоНалога + ВыборкаНедвижимость.СуммаЗемельногоНалога;
			
			Если ПервыйНомер = 444 ИЛИ КоличествоЗаписей = ТекущаяЗапись Тогда
				
				Для Строка = КоличествоСтрокНаЛисте По 8 Цикл
					ОбластьМакета = Макет.ПолучитьОбласть("ОбластьДанных");
					ЗаполнитьНомераЯчеекСтрокиОтчета(ОбластьМакета, ПервыйНомер, 2);
					ТабличныйДокумент.Вывести(ОбластьМакета);
				КонецЦикла;	
				
				СтруктураИтоги.СуммаНалогаКУплате = СтруктураИтоги.ИтогоСуммаНалога - СтруктураИтоги.ИтогоСуммаЗемельногоНалога;	
				
				ОбластьМакета = Макет.ПолучитьОбласть("ОбластьИтоги");
				ОбластьМакета.Параметры.Заполнить(СтруктураИтоги);
				
				ВыборкаПриложение = Шапка.Приложение.Выбрать();
				
				Пока ВыборкаПриложение.Следующий() Цикл
					ОбластьМакета.Параметры.Заполнить(ВыборкаПриложение);	
				КонецЦикла;	
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				СтруктураИтоги.ИтогоСуммаНалога 			= 0;
				СтруктураИтоги.ИтогоСуммаЗемельногоНалога 	= 0;
				СтруктураИтоги.СуммаНалогаКУплате 			= 0;
				ПервыйНомер = 300;
			КонецЕсли;
			
			Если ПервыйНомер = 444 Тогда
				КоличествоСтрокНаЛисте = 1;
			Иначе	
				КоличествоСтрокНаЛисте = КоличествоСтрокНаЛисте + 1;
			КонецЕсли;
			
			ТекущаяЗапись = ТекущаяЗапись + 1;
		КонецЦикла;	
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
			
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Функция формирует табличный документ с печатной формой НалогаНаИмущество3Группы
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ОтчетПоНалогуНаИмущество3Группы(МассивОбъектов, ОбъектыПечати)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ПолеСлева = 0;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.КлючПараметровПечати = "ОтчетПоНалогуНаИмущество_Группа3";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетНалогНаИмущество.Ссылка КАК Ссылка,
		|	ОтчетНалогНаИмущество.Дата КАК Дата,
		|	ОтчетНалогНаИмущество.Организация КАК Организация,
		|	ОтчетНалогНаИмущество.Недвижимость.(
		|		ОсновноеСредство.МестонахождениеИмущества КАК МестонахождениеИмущества,
		|		КоличествоМесяцев КАК КоличествоМесяцевВладения,
		|		Ставка КАК СтавкаНалога,
		|		СуммаНалога КАК СуммаНалога,
		|		ОценочнаяСтоимость КАК ОценочнаяСтоимостьМетр,
		|		ЖилаяПлощадь КАК ЖилаяПлощадь,
		|		МатериалСтен.Код КАК КодМатериала,
		|		Кр КАК Кр,
		|		Кз КАК Кз,
		|		Ко КАК Ко,
		|		ЗемНалог КАК СуммаЗемельногоНалога,
		|		КодИмущества КАК КодВидаИмущества,
		|		КодНазначенияИмущества.Код КАК КодНазначенияИмущества,
		|		КодПользователяИмущества КАК КодПользователяИмущества,
		|		ГОД(ОтчетНалогНаИмущество.Недвижимость.ДатаВводаВЭксплуатацию) КАК ГодВводаВЭксплуатацию
		|	) КАК Недвижимость,
		|	ОтчетНалогНаИмущество.Приложение.(
		|		Январь КАК СуммаЗаЯнварь,
		|		Февраль КАК СуммаЗаФевраль,
		|		Март КАК СуммаЗаМарт,
		|		Апрель КАК СуммаЗаАпрель,
		|		Май КАК СуммаЗаМай,
		|		Июнь КАК СуммаЗаИюнь,
		|		Июль КАК СуммаЗаИюль,
		|		Август КАК СуммаЗаАвгуст,
		|		Сентябрь КАК СуммаЗаСентябрь,
		|		Октябрь КАК СуммаЗаОктябрь,
		|		Ноябрь КАК СуммаЗаНоябрь,
		|		Декабрь КАК СуммаЗаДекабрь
		|	) КАК Приложение
		|ИЗ
		|	Документ.ОтчетПоНалогуНаИмущество КАК ОтчетНалогНаИмущество
		|ГДЕ
		|	ОтчетНалогНаИмущество.Ссылка В(&МассивОбъектов)
		|	И ОтчетНалогНаИмущество.Недвижимость.ГруппаИмущества = ЗНАЧЕНИЕ(Справочник.ГруппыИмущества.ГИ3)
		|
		|УПОРЯДОЧИТЬ ПО
		|	КодВидаИмущества";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Шапка = Запрос.Выполнить().Выбрать();
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетПоНалогуНаИмущество.ПФ_MXL_Группа3");	
	
	ПервыйНомер = 300;
	КоличествоСтрокНаЛисте = 1;
	
	СтруктураИтоги = Новый Структура();
	СтруктураИтоги.Вставить("ИтогоСуммаНалога", 			0);
	СтруктураИтоги.Вставить("ИтогоСуммаЗемельногоНалога", 	0);
	СтруктураИтоги.Вставить("СуммаНалогаКУплате", 			0);
	
	Пока Шапка.Следующий() Цикл		
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ПервыйНомер = 300;
			КоличествоСтрокНаЛисте = 1;
		КонецЕсли;		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", Шапка.Организация);
		СтруктураПараметров.Вставить("Дата", 		Шапка.Дата);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		
		ЗаполнитьШапкуОтчета(СтруктураПараметров, ОбластьМакета);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ВыборкаНедвижимость = Шапка.Недвижимость.Выбрать();
		КоличествоЗаписей = ВыборкаНедвижимость.Количество();
		ТекущаяЗапись = 1;
		
		Пока ВыборкаНедвижимость.Следующий() Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("ОбластьДанных");
			ОбластьМакета.Параметры.Заполнить(ВыборкаНедвижимость);
			
			ЗаполнитьНомераЯчеекСтрокиОтчета(ОбластьМакета, ПервыйНомер, 3);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			СтруктураИтоги.ИтогоСуммаНалога 			= СтруктураИтоги.ИтогоСуммаНалога 			+ ВыборкаНедвижимость.СуммаНалога;
			СтруктураИтоги.ИтогоСуммаЗемельногоНалога 	= СтруктураИтоги.ИтогоСуммаЗемельногоНалога + ВыборкаНедвижимость.СуммаЗемельногоНалога;
			
			Если ПервыйНомер = 435 ИЛИ КоличествоЗаписей = ТекущаяЗапись Тогда
				
				Для Строка = КоличествоСтрокНаЛисте По 8 Цикл
					ОбластьМакета = Макет.ПолучитьОбласть("ОбластьДанных");
					ЗаполнитьНомераЯчеекСтрокиОтчета(ОбластьМакета, ПервыйНомер, 3);
					ТабличныйДокумент.Вывести(ОбластьМакета);
				КонецЦикла;	
				
				СтруктураИтоги.СуммаНалогаКУплате = СтруктураИтоги.ИтогоСуммаНалога - СтруктураИтоги.ИтогоСуммаЗемельногоНалога;	
				
				ОбластьМакета = Макет.ПолучитьОбласть("ОбластьИтоги");
				ОбластьМакета.Параметры.Заполнить(СтруктураИтоги);
				
				ВыборкаПриложение = Шапка.Приложение.Выбрать();
				
				Пока ВыборкаПриложение.Следующий() Цикл
					ОбластьМакета.Параметры.Заполнить(ВыборкаПриложение);	
				КонецЦикла;	
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				СтруктураИтоги.ИтогоСуммаНалога 			= 0;
				СтруктураИтоги.ИтогоСуммаЗемельногоНалога 	= 0;
				СтруктураИтоги.СуммаНалогаКУплате 			= 0;
				ПервыйНомер = 300;
			КонецЕсли;
			
			Если ПервыйНомер = 435 Тогда
				КоличествоСтрокНаЛисте = 1;
			Иначе	
				КоличествоСтрокНаЛисте = КоличествоСтрокНаЛисте + 1;
			КонецЕсли;
			
			ТекущаяЗапись = ТекущаяЗапись + 1;
		КонецЦикла;	
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
			
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Функция формирует табличный документ с печатной формой НалогаНаИмущество4Группы
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ОтчетПоНалогуНаИмущество4Группы(МассивОбъектов, ОбъектыПечати)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ПолеСлева = 0;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.КлючПараметровПечати = "ОтчетПоНалогуНаИмущество_Группа4";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетНалогНаИмущество.Ссылка КАК Ссылка,
		|	ОтчетНалогНаИмущество.Дата КАК Дата,
		|	ОтчетНалогНаИмущество.Организация КАК Организация,
		|	ОтчетНалогНаИмущество.Транспорт.(
		|		ВЫБОР
		|			КОГДА ГОД(ОсновноеСредство.ДатаВыпуска) <> 1
		|				ТОГДА ГОД(ОсновноеСредство.ДатаВыпуска)
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК ГодВыпуска,
		|		АБВ КАК АБВ,
		|		ВидТранспорта.Код КАК КодВидаТранспорта,
		|		МаркаТранспортногоСредства КАК МаркаТранспортногоСредства,
		|		ОбъемДвигателя КАК ОбъемДвигателя,
		|		Ставка КАК СтавкаНалога,
		|		СуммаНалога КАК СуммаНалога
		|	) КАК Транспорт
		|ИЗ
		|	Документ.ОтчетПоНалогуНаИмущество КАК ОтчетНалогНаИмущество
		|ГДЕ
		|	ОтчетНалогНаИмущество.Ссылка В(&МассивОбъектов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	АБВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОтчетНалогНаИмуществоТранспорт.Ссылка КАК Ссылка,
		|	ОтчетНалогНаИмуществоТранспорт.АБВ КАК АБВ,
		|	ОтчетНалогНаИмуществоТранспорт.ОсновноеСредство КАК ОсновноеСредство,
		|	ОтчетНалогНаИмуществоТранспорт.ОбъемДвигателя КАК ОбъемДвигателя,
		|	ОтчетНалогНаИмуществоТранспорт.СуммаНалога КАК СуммаНалога
		|ПОМЕСТИТЬ ВременнаяТаблицаТранспорт
		|ИЗ
		|	Документ.ОтчетПоНалогуНаИмущество.Транспорт КАК ОтчетНалогНаИмуществоТранспорт
		|ГДЕ
		|	ОтчетНалогНаИмуществоТранспорт.Ссылка В(&МассивОбъектов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаТранспорт.Ссылка КАК Ссылка,
		|	ВременнаяТаблицаТранспорт.АБВ КАК АБВ,
		|	КОЛИЧЕСТВО(ВременнаяТаблицаТранспорт.ОсновноеСредство) КАК КоличествоЗаписей,
		|	СУММА(ВременнаяТаблицаТранспорт.ОбъемДвигателя) КАК ОбъемДвигателя,
		|	СУММА(ВременнаяТаблицаТранспорт.СуммаНалога) КАК СуммаНалога
		|ИЗ
		|	ВременнаяТаблицаТранспорт КАК ВременнаяТаблицаТранспорт
		|ГДЕ
		|	ВременнаяТаблицаТранспорт.АБВ = ""А""
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаТранспорт.Ссылка,
		|	ВременнаяТаблицаТранспорт.АБВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаТранспорт.Ссылка КАК Ссылка,
		|	ВременнаяТаблицаТранспорт.АБВ КАК АБВ,
		|	КОЛИЧЕСТВО(ВременнаяТаблицаТранспорт.ОсновноеСредство) КАК КоличествоЗаписей,
		|	СУММА(ВременнаяТаблицаТранспорт.ОбъемДвигателя) КАК ОбъемДвигателя,
		|	СУММА(ВременнаяТаблицаТранспорт.СуммаНалога) КАК СуммаНалога
		|ИЗ
		|	ВременнаяТаблицаТранспорт КАК ВременнаяТаблицаТранспорт
		|ГДЕ
		|	ВременнаяТаблицаТранспорт.АБВ = ""Б""
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаТранспорт.Ссылка,
		|	ВременнаяТаблицаТранспорт.АБВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаТранспорт.Ссылка КАК Ссылка,
		|	ВременнаяТаблицаТранспорт.АБВ КАК АБВ,
		|	КОЛИЧЕСТВО(ВременнаяТаблицаТранспорт.ОсновноеСредство) КАК КоличествоЗаписей,
		|	СУММА(ВременнаяТаблицаТранспорт.ОбъемДвигателя) КАК ОбъемДвигателя,
		|	СУММА(ВременнаяТаблицаТранспорт.СуммаНалога) КАК СуммаНалога
		|ИЗ
		|	ВременнаяТаблицаТранспорт КАК ВременнаяТаблицаТранспорт
		|ГДЕ
		|	ВременнаяТаблицаТранспорт.АБВ = ""В""
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаТранспорт.Ссылка,
		|	ВременнаяТаблицаТранспорт.АБВ";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Шапка = МассивРезультатов[0].Выбрать();
	ТаблицаИтоговГруппы_А = МассивРезультатов[2].Выгрузить();
	ТаблицаИтоговГруппы_Б = МассивРезультатов[3].Выгрузить();
	ТаблицаИтоговГруппы_В = МассивРезультатов[4].Выгрузить();
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетПоНалогуНаИмущество.ПФ_MXL_Группа4");	
	
	ПервыйНомер = 202;
	
	Пока Шапка.Следующий() Цикл		
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ПервыйНомер = 202;
		КонецЕсли;		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", Шапка.Организация);
		СтруктураПараметров.Вставить("Дата", 		Шапка.Дата);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		
		ЗаполнитьШапкуОтчета(СтруктураПараметров, ОбластьМакета);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ВыборкаТранспорт = Шапка.Транспорт.Выбрать();
		КоличествоЗаписей = ВыборкаТранспорт.Количество();
		ТекущаяСтрока = 1;
		
		СтрокаТаблицы_А = ТаблицаИтоговГруппы_А.Найти(Шапка.Ссылка, "Ссылка");
		СтрокаТаблицы_Б = ТаблицаИтоговГруппы_Б.Найти(Шапка.Ссылка, "Ссылка");
		СтрокаТаблицы_В = ТаблицаИтоговГруппы_В.Найти(Шапка.Ссылка, "Ссылка");
		
		Группа_А_Заполнена = Ложь;
		Группа_Б_Заполнена = Ложь;
		Группа_В_Заполнена = Ложь;
		
		Пока ВыборкаТранспорт.Следующий() Цикл
			
			// Заполнение группы А
			Если ВыборкаТранспорт.АБВ = "А" Тогда
				
				Если НЕ Группа_А_Заполнена Тогда
					Если СтрокаТаблицы_А.КоличествоЗаписей > 25 Тогда					
						ОбластьМакета = Макет.ПолучитьОбласть("ГруппаА");
						ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы_А);
						ОбластьМакета.Параметры.СуммаНалогаКУплате = СтрокаТаблицы_А.СуммаНалога;
						ЗаполнитьНомераЯчеекСтрокиОтчета(ОбластьМакета, ПервыйНомер, 4, "А");
						ТабличныйДокумент.Вывести(ОбластьМакета);
						
						Пока ПервыйНомер <> 402 Цикл
							ОбластьМакета = Макет.ПолучитьОбласть("ГруппаА");
							
							Если ПервыйНомер = 314 Тогда
								ОбластьМакета.Параметры.А = "А";	
							КонецЕсли;								
							ЗаполнитьНомераЯчеекСтрокиОтчета(ОбластьМакета, ПервыйНомер, 4, "А");
							ТабличныйДокумент.Вывести(ОбластьМакета);
						КонецЦикла;
						
						Группа_А_Заполнена = Истина;
						
					Иначе
						ОбластьМакета = Макет.ПолучитьОбласть("ГруппаА");
						ОбластьМакета.Параметры.Заполнить(ВыборкаТранспорт);
						ОбластьМакета.Параметры.СуммаНалогаКУплате = ВыборкаТранспорт.СуммаНалога;
						
						Если ПервыйНомер = 314 Тогда
							ОбластьМакета.Параметры.А = "А";	
						КонецЕсли;
						ЗаполнитьНомераЯчеекСтрокиОтчета(ОбластьМакета, ПервыйНомер, 4, "А");
						ТабличныйДокумент.Вывести(ОбластьМакета);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;	
			
			// Заполнение группы Б
			Если ВыборкаТранспорт.АБВ = "Б" Тогда
				
				Если НЕ Группа_А_Заполнена Тогда
					Пока ПервыйНомер <> 402 Цикл
						ОбластьМакета = Макет.ПолучитьОбласть("ГруппаА");
						
						Если ПервыйНомер = 314 Тогда
							ОбластьМакета.Параметры.А = "А";	
						КонецЕсли;
						ЗаполнитьНомераЯчеекСтрокиОтчета(ОбластьМакета, ПервыйНомер, 4, "А");
						ТабличныйДокумент.Вывести(ОбластьМакета);
					КонецЦикла;
					
					Группа_А_Заполнена = Истина;
				КонецЕсли;	
				
				Если НЕ Группа_Б_Заполнена Тогда
					Если СтрокаТаблицы_Б.КоличествоЗаписей > 2 Тогда					
						ОбластьМакета = Макет.ПолучитьОбласть("ГруппаБ");
						ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы_Б);
						ОбластьМакета.Параметры.СуммаНалогаКУплате = СтрокаТаблицы_Б.СуммаНалога;
						ЗаполнитьНомераЯчеекСтрокиОтчета(ОбластьМакета, ПервыйНомер, 4, "Б");
						ОбластьМакета.Параметры.Б = "Б";
						ТабличныйДокумент.Вывести(ОбластьМакета);
						
						Пока ПервыйНомер <> 416 Цикл
							ОбластьМакета = Макет.ПолучитьОбласть("ГруппаБ");
							ЗаполнитьНомераЯчеекСтрокиОтчета(ОбластьМакета, ПервыйНомер, 4, "Б");
							ТабличныйДокумент.Вывести(ОбластьМакета);
						КонецЦикла;
						
						Группа_Б_Заполнена = Истина;
						
					Иначе
						ОбластьМакета = Макет.ПолучитьОбласть("ГруппаБ");
						ОбластьМакета.Параметры.Заполнить(ВыборкаТранспорт);
						ОбластьМакета.Параметры.СуммаНалогаКУплате = ВыборкаТранспорт.СуммаНалога;
						
						Если ПервыйНомер = 402 Тогда
							ОбластьМакета.Параметры.Б = "Б";	
						КонецЕсли;
						ЗаполнитьНомераЯчеекСтрокиОтчета(ОбластьМакета, ПервыйНомер, 4, "Б");
						ТабличныйДокумент.Вывести(ОбластьМакета);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			// Заполнение группы В
			Если ВыборкаТранспорт.АБВ = "В" Тогда
				
				Если НЕ Группа_А_Заполнена Тогда
					Пока ПервыйНомер <> 402 Цикл
						ОбластьМакета = Макет.ПолучитьОбласть("ГруппаА");
						
						Если ПервыйНомер = 314 Тогда
							ОбластьМакета.Параметры.А = "А";	
						КонецЕсли;
						ЗаполнитьНомераЯчеекСтрокиОтчета(ОбластьМакета, ПервыйНомер, 4, "А");
						ТабличныйДокумент.Вывести(ОбластьМакета);
					КонецЦикла;
					
					Группа_А_Заполнена = Истина;
				КонецЕсли;
				
				Если НЕ Группа_Б_Заполнена Тогда
					Пока ПервыйНомер <> 416 Цикл
						ОбластьМакета = Макет.ПолучитьОбласть("ГруппаБ");
						
						Если ПервыйНомер = 402 Тогда
							ОбластьМакета.Параметры.Б = "Б";	
						КонецЕсли;
						ЗаполнитьНомераЯчеекСтрокиОтчета(ОбластьМакета, ПервыйНомер, 4, "Б");
						ТабличныйДокумент.Вывести(ОбластьМакета);
					КонецЦикла;
					
					Группа_Б_Заполнена = Истина;
				КонецЕсли;
				
				Если НЕ Группа_В_Заполнена Тогда
					Если СтрокаТаблицы_В.КоличествоЗаписей > 2 Тогда					
						ОбластьМакета = Макет.ПолучитьОбласть("ГруппаВ");
						ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы_В);
						ОбластьМакета.Параметры.СуммаНалогаКУплате = СтрокаТаблицы_В.СуммаНалога;
						ЗаполнитьНомераЯчеекСтрокиОтчета(ОбластьМакета, ПервыйНомер, 4, "В");
						ОбластьМакета.Параметры.В = "В";
						ТабличныйДокумент.Вывести(ОбластьМакета);
						
						Пока ПервыйНомер <> 430 Цикл
							ОбластьМакета = Макет.ПолучитьОбласть("ГруппаВ");
							ЗаполнитьНомераЯчеекСтрокиОтчета(ОбластьМакета, ПервыйНомер, 4, "В");
							ТабличныйДокумент.Вывести(ОбластьМакета);
						КонецЦикла;
						
						Группа_В_Заполнена = Истина;
						
					Иначе
						ОбластьМакета = Макет.ПолучитьОбласть("ГруппаВ");
						ОбластьМакета.Параметры.Заполнить(ВыборкаТранспорт);
						ОбластьМакета.Параметры.СуммаНалогаКУплате = ВыборкаТранспорт.СуммаНалога;
						
						Если ПервыйНомер = 416 Тогда
							ОбластьМакета.Параметры.В = "В";	
						КонецЕсли;
						ЗаполнитьНомераЯчеекСтрокиОтчета(ОбластьМакета, ПервыйНомер, 4, "В");
						ТабличныйДокумент.Вывести(ОбластьМакета);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если КоличествоЗаписей = ТекущаяСтрока Тогда
				
				Если НЕ Группа_А_Заполнена Тогда
					Пока ПервыйНомер <> 402 Цикл
						ОбластьМакета = Макет.ПолучитьОбласть("ГруппаА");
						
						Если ПервыйНомер = 314 Тогда
							ОбластьМакета.Параметры.А = "А";	
						КонецЕсли;
						ЗаполнитьНомераЯчеекСтрокиОтчета(ОбластьМакета, ПервыйНомер, 4, "А");
						ТабличныйДокумент.Вывести(ОбластьМакета);
					КонецЦикла;
					
					Группа_А_Заполнена = Истина;
				КонецЕсли;
				
				Если НЕ Группа_Б_Заполнена Тогда
					Пока ПервыйНомер <> 416 Цикл
						ОбластьМакета = Макет.ПолучитьОбласть("ГруппаБ");
						
						Если ПервыйНомер = 402 Тогда
								ОбластьМакета.Параметры.Б = "Б";	
							КонецЕсли;
						ЗаполнитьНомераЯчеекСтрокиОтчета(ОбластьМакета, ПервыйНомер, 4, "Б");
						ТабличныйДокумент.Вывести(ОбластьМакета);
					КонецЦикла;
				КонецЕсли;
				
				Если НЕ Группа_В_Заполнена Тогда
					Пока ПервыйНомер <> 430 Цикл
						ОбластьМакета = Макет.ПолучитьОбласть("ГруппаВ");
						
						Если ПервыйНомер = 416 Тогда
								ОбластьМакета.Параметры.В = "В";	
							КонецЕсли;
						ЗаполнитьНомераЯчеекСтрокиОтчета(ОбластьМакета, ПервыйНомер, 4, "В");
						ТабличныйДокумент.Вывести(ОбластьМакета);
					КонецЦикла;
				КонецЕсли;
				
				ОбластьМакета = Макет.ПолучитьОбласть("Итог");
				ОбластьМакета.Параметры.СуммаНалогаКУплате = ?(СтрокаТаблицы_А = Неопределено, 0 ,СтрокаТаблицы_А.СуммаНалога) 
																+ ?(СтрокаТаблицы_Б = Неопределено, 0 ,СтрокаТаблицы_Б.СуммаНалога) 
																+ ?(СтрокаТаблицы_В = Неопределено, 0 ,СтрокаТаблицы_В.СуммаНалога);
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
				ТабличныйДокумент.Вывести(ОбластьМакета);
			КонецЕсли;	
				
			ТекущаяСтрока = ТекущаяСтрока + 1;
		КонецЦикла;	
		
		Если ?(СтрокаТаблицы_А = Неопределено, Ложь , СтрокаТаблицы_А.КоличествоЗаписей > 25) 
			ИЛИ ?(СтрокаТаблицы_Б = Неопределено, Ложь , СтрокаТаблицы_Б.КоличествоЗаписей > 2) 
			ИЛИ ?(СтрокаТаблицы_В = Неопределено, Ложь , СтрокаТаблицы_В.КоличествоЗаписей > 2) Тогда
			
			ОбластьМакета = Макет.ПолучитьОбласть("ПустаяОбласть");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ВыборкаТранспорт.Сбросить();
			
			Пока ВыборкаТранспорт.Следующий() Цикл
				
				Если ВыборкаТранспорт.АБВ = "А" Тогда				
					Если СтрокаТаблицы_А.КоличествоЗаписей > 25 Тогда
						ОбластьМакета = Макет.ПолучитьОбласть("ГруппаАРасшифровка");
						ОбластьМакета.Параметры.Заполнить(ВыборкаТранспорт);
						ОбластьМакета.Параметры.А = "А";
						ОбластьМакета.Параметры.СуммаНалогаКУплате = ВыборкаТранспорт.СуммаНалога;
						ТабличныйДокумент.Вывести(ОбластьМакета);
					Иначе
						 Продолжить;
					КонецЕсли;
					 
				ИначеЕсли ВыборкаТранспорт.АБВ = "Б" Тогда
					Если СтрокаТаблицы_Б.КоличествоЗаписей > 2 Тогда
						ОбластьМакета = Макет.ПолучитьОбласть("ГруппаБРасшифровка");
						ОбластьМакета.Параметры.Заполнить(ВыборкаТранспорт);
						ОбластьМакета.Параметры.Б = "Б";
						ОбластьМакета.Параметры.СуммаНалогаКУплате = ВыборкаТранспорт.СуммаНалога;
						ТабличныйДокумент.Вывести(ОбластьМакета);
					Иначе
						 Продолжить;
					КонецЕсли;
					 
				ИначеЕсли ВыборкаТранспорт.АБВ = "В" Тогда
					Если СтрокаТаблицы_В.КоличествоЗаписей > 2 Тогда
						ОбластьМакета = Макет.ПолучитьОбласть("ГруппаВРасшифровка");
						ОбластьМакета.Параметры.Заполнить(ВыборкаТранспорт);
						ОбластьМакета.Параметры.В = "В";
						ОбластьМакета.Параметры.СуммаНалогаКУплате = ВыборкаТранспорт.СуммаНалога;
						ТабличныйДокумент.Вывести(ОбластьМакета);
					Иначе
						 Продолжить;
					КонецЕсли;	 
				КонецЕсли;								
			КонецЦикла;
			
			ОбластьМакета = Макет.ПолучитьОбласть("ИтогРасшифровка");
			ОбластьМакета.Параметры.СуммаНалогаКУплате = ?(СтрокаТаблицы_А = Неопределено, 0 ,СтрокаТаблицы_А.СуммаНалога) 
															+ ?(СтрокаТаблицы_Б = Неопределено, 0 ,СтрокаТаблицы_Б.СуммаНалога) 
															+ ?(СтрокаТаблицы_В = Неопределено, 0 ,СтрокаТаблицы_В.СуммаНалога);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		КонецЕсли;	
			
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
			
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Группа2") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"Группа2",
		НСтр("ru = 'Налог на имущество. 2 группа'"), 
		ОтчетПоНалогуНаИмущество2Группы(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.СписаниеСпецодеждыДосрочное.ПФ_MXL_Группа2");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Группа3") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"Группа3", 
		НСтр("ru = 'Налог на имущество. 3 группа'"), 
		ОтчетПоНалогуНаИмущество3Группы(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.СписаниеСпецодеждыДосрочное.ПФ_MXL_Группа3");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Группа4") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"Группа4", 
		НСтр("ru = 'Налог на имущество. 4 группа'"), 
		ОтчетПоНалогуНаИмущество4Группы(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.СписаниеСпецодеждыДосрочное.ПФ_MXL_Группа4");
	КонецЕсли;
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Группа2";
	КомандаПечати.Представление = НСтр("ru = 'Налог на имущество. 2 группа'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 2;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Группа3";
	КомандаПечати.Представление = НСтр("ru = 'Налог на имущество. 3 группа'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 3;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Группа4";
	КомандаПечати.Представление = НСтр("ru = 'Налог на имущество. 4 группа'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 4;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли