#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыПроведенияДокумента

// Формирует таблицу значений, содержащую данные для проведения по регистру бухгалтерии Хозрасчетный.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаХозрасчетный(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	ВалютаРегламентированногоУчета = СтруктураДополнительныеСвойства.ДляПроведения.ВалютаРегламентированногоУчета;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.Касса.СчетУчета КАК СчетДт,
		|	ВременнаяТаблицаРасшифровкаПлатежа.СчетУчета КАК СчетКт,
		|	ВременнаяТаблицаШапка.Касса КАК СубконтоДт1,
		|	ВременнаяТаблицаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств КАК СубконтоДт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
		|	ВременнаяТаблицаШапка.Контрагент КАК СубконтоКт1,
		|	ВременнаяТаблицаРасшифровкаПлатежа.ДоговорКонтрагента КАК СубконтоКт2,
		|	ВременнаяТаблицаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств КАК СубконтоКт3,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.Касса.СчетУчета.Валютный
		|			ТОГДА ВременнаяТаблицаШапка.Касса.ВалютаДенежныхСредств
		|		ИНАЧЕ &ВалютаРегламентированногоУчета
		|	КОНЕЦ КАК ВалютаДт,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.СчетУчета.Валютный
		|			ТОГДА ВременнаяТаблицаШапка.ВалютаДоговора
		|		ИНАЧЕ &ВалютаРегламентированногоУчета
		|	КОНЕЦ КАК ВалютаКт,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.Касса.СчетУчета.Валютный
		|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ВалютнаяСуммаДт,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.СчетУчета.Валютный
		|			ТОГДА ВЫБОР
		|					КОГДА ВременнаяТаблицаШапка.Курс >= ВременнаяТаблицаШапка.КурсДоговора
		|						ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов
		|					ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа / ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов
		|				КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ВалютнаяСуммаКт,
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаШапка.Операция.Наименование + ВЫБОР
		|		КОГДА (ВЫРАЗИТЬ(ВременнаяТаблицаШапка.Комментарий КАК СТРОКА(1024))) = """"
		|			ТОГДА """"
		|		ИНАЧЕ "" - ""
		|	КОНЕЦ + (ВЫРАЗИТЬ(ВременнаяТаблицаШапка.Комментарий КАК СТРОКА(1024))) КАК Содержание,
		|	ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаШапка.Курс КАК Сумма
		|ИЗ
		|	ВременнаяТаблицаРасшифровкаПлатежа КАК ВременнаяТаблицаРасшифровкаПлатежа
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО ВременнаяТаблицаРасшифровкаПлатежа.Ссылка = ВременнаяТаблицаШапка.Ссылка
		|ГДЕ
		|	(ВременнаяТаблицаШапка.Операция.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПКО.ОплатаОтПокупателя)
		|			ИЛИ ВременнаяТаблицаШапка.Операция.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПКО.ВозвратОтПоставщика)
		|			ИЛИ ВременнаяТаблицаШапка.Операция.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПКО.РасчетыПоЗаймам))
		|	И ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.Касса.СчетУчета,
		|	ВременнаяТаблицаРасшифровкаПлатежа.СчетУчета,
		|	ВременнаяТаблицаШапка.Касса,
		|	ВременнаяТаблицаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств,
		|	НЕОПРЕДЕЛЕНО,
		|	ВременнаяТаблицаРасшифровкаПлатежа.Контрагент,
		|	ВременнаяТаблицаРасшифровкаПлатежа.ДоговорКонтрагента,
		|	НЕОПРЕДЕЛЕНО,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.Касса.СчетУчета.Валютный
		|			ТОГДА ВременнаяТаблицаШапка.Касса.ВалютаДенежныхСредств
		|		ИНАЧЕ &ВалютаРегламентированногоУчета
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.СчетУчета.Валютный
		|			ТОГДА ВременнаяТаблицаШапка.ВалютаДоговора
		|		ИНАЧЕ &ВалютаРегламентированногоУчета
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.Касса.СчетУчета.Валютный
		|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.СчетУчета.Валютный
		|			ТОГДА ВЫБОР
		|					КОГДА ВременнаяТаблицаШапка.Курс >= ВременнаяТаблицаШапка.КурсДоговора
		|						ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов
		|					ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа / ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов
		|				КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаШапка.Операция.Наименование + ВЫБОР
		|		КОГДА (ВЫРАЗИТЬ(ВременнаяТаблицаШапка.Комментарий КАК СТРОКА(1024))) = """"
		|			ТОГДА """"
		|		ИНАЧЕ "" - ""
		|	КОНЕЦ + (ВЫРАЗИТЬ(ВременнаяТаблицаШапка.Комментарий КАК СТРОКА(1024))),
		|	ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаШапка.Курс
		|ИЗ
		|	ВременнаяТаблицаРасшифровкаПлатежа КАК ВременнаяТаблицаРасшифровкаПлатежа
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО ВременнаяТаблицаРасшифровкаПлатежа.Ссылка = ВременнаяТаблицаШапка.Ссылка
		|ГДЕ
		|	ВременнаяТаблицаШапка.Операция.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПКО.ОплатаОтНесколькихКонтрагентов)
		|	И ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.Касса.СчетУчета,
		|	ВременнаяТаблицаШапка.БанковскийСчет.СчетУчета,
		|	ВременнаяТаблицаШапка.Касса,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	ВременнаяТаблицаШапка.БанковскийСчет,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.Касса.СчетУчета.Валютный
		|			ТОГДА ВременнаяТаблицаШапка.Касса.ВалютаДенежныхСредств
		|		ИНАЧЕ &ВалютаРегламентированногоУчета
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.БанковскийСчет.СчетУчета.Валютный
		|			ТОГДА ВременнаяТаблицаШапка.БанковскийСчет.ВалютаДенежныхСредств
		|		ИНАЧЕ &ВалютаРегламентированногоУчета
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.Касса.СчетУчета.Валютный
		|			ТОГДА ВременнаяТаблицаШапка.СуммаДокумента
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.БанковскийСчет.СчетУчета.Валютный
		|			ТОГДА ВременнаяТаблицаШапка.СуммаДокумента
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаШапка.Операция.Наименование + ВЫБОР
		|		КОГДА (ВЫРАЗИТЬ(ВременнаяТаблицаШапка.Комментарий КАК СТРОКА(1024))) = """"
		|			ТОГДА """"
		|		ИНАЧЕ "" - ""
		|	КОНЕЦ + (ВЫРАЗИТЬ(ВременнаяТаблицаШапка.Комментарий КАК СТРОКА(1024))),
		|	ВременнаяТаблицаШапка.СуммаДокумента * ВременнаяТаблицаШапка.Курс
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|ГДЕ
		|	ВременнаяТаблицаШапка.Операция.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПКО.ПолучениеНаличныхВБанке)
		|	И ВременнаяТаблицаШапка.СуммаДокумента <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.Касса.СчетУчета,
		|	ВременнаяТаблицаПрочийПриход.СчетУчета,
		|	ВременнаяТаблицаШапка.Касса,
		|	ВременнаяТаблицаПрочийПриход.СтатьяДвиженияДенежныхСредств,
		|	НЕОПРЕДЕЛЕНО,
		|	ВременнаяТаблицаПрочийПриход.Субконто1,
		|	ВременнаяТаблицаПрочийПриход.Субконто2,
		|	ВременнаяТаблицаПрочийПриход.Субконто3,
		|	ВременнаяТаблицаШапка.Касса.ВалютаДенежныхСредств,
		|	ВременнаяТаблицаШапка.Касса.ВалютаДенежныхСредств,
		|	ВременнаяТаблицаПрочийПриход.СуммаПлатежа,
		|	ВременнаяТаблицаПрочийПриход.СуммаПлатежа,
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаШапка.Операция.Наименование + ВЫБОР
		|		КОГДА (ВЫРАЗИТЬ(ВременнаяТаблицаШапка.Комментарий КАК СТРОКА(1024))) = """"
		|			ТОГДА """"
		|		ИНАЧЕ "" - ""
		|	КОНЕЦ + (ВЫРАЗИТЬ(ВременнаяТаблицаШапка.Комментарий КАК СТРОКА(1024))),
		|	ВременнаяТаблицаПрочийПриход.СуммаПлатежа * ВременнаяТаблицаШапка.Курс
		|ИЗ
		|	ВременнаяТаблицаПрочийПриход КАК ВременнаяТаблицаПрочийПриход
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО ВременнаяТаблицаПрочийПриход.Ссылка = ВременнаяТаблицаШапка.Ссылка
		|ГДЕ
		|	ВременнаяТаблицаШапка.Операция.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПКО.ПрочийПриход)
		|	И ВременнаяТаблицаПрочийПриход.СуммаПлатежа <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.Касса.СчетУчета,
		|	ВременнаяТаблицаШапка.Операция.СчетУчета,
		|	ВременнаяТаблицаШапка.Касса,
		|	ВременнаяТаблицаВозвратЗаработнойПлаты.СтатьяДвиженияДенежныхСредств,
		|	НЕОПРЕДЕЛЕНО,
		|	ВременнаяТаблицаВозвратЗаработнойПлаты.ФизЛицо,
		|	ВременнаяТаблицаВозвратЗаработнойПлаты.Ведомость,
		|	НЕОПРЕДЕЛЕНО,
		|	ВременнаяТаблицаШапка.Касса.ВалютаДенежныхСредств,
		|	ВременнаяТаблицаШапка.Касса.ВалютаДенежныхСредств,
		|	ВременнаяТаблицаВозвратЗаработнойПлаты.СуммаПлатежа,
		|	ВременнаяТаблицаВозвратЗаработнойПлаты.СуммаПлатежа,
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаШапка.Операция.Наименование + ВЫБОР
		|		КОГДА (ВЫРАЗИТЬ(ВременнаяТаблицаШапка.Комментарий КАК СТРОКА(1024))) = """"
		|			ТОГДА """"
		|		ИНАЧЕ "" - ""
		|	КОНЕЦ + (ВЫРАЗИТЬ(ВременнаяТаблицаШапка.Комментарий КАК СТРОКА(1024))),
		|	ВременнаяТаблицаВозвратЗаработнойПлаты.СуммаПлатежа * ВременнаяТаблицаШапка.Курс
		|ИЗ
		|	ВременнаяТаблицаВозвратЗаработнойПлаты КАК ВременнаяТаблицаВозвратЗаработнойПлаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО ВременнаяТаблицаВозвратЗаработнойПлаты.Ссылка = ВременнаяТаблицаШапка.Ссылка
		|ГДЕ
		|	ВременнаяТаблицаШапка.Операция.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПКО.ВозвратОтСотрудника)
		|	И ВременнаяТаблицаВозвратЗаработнойПлаты.СуммаПлатежа <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.Касса.СчетУчета,
		|	ВременнаяТаблицаШапка.СчетУчета,
		|	ВременнаяТаблицаШапка.Касса,
		|	ВременнаяТаблицаПодотчет.СтатьяДвиженияДенежныхСредств,
		|	НЕОПРЕДЕЛЕНО,
		|	ВременнаяТаблицаШапка.ФизЛицо,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	ВременнаяТаблицаШапка.Касса.ВалютаДенежныхСредств,
		|	ВременнаяТаблицаШапка.Касса.ВалютаДенежныхСредств,
		|	ВременнаяТаблицаПодотчет.СуммаПлатежа,
		|	ВременнаяТаблицаПодотчет.СуммаПлатежа,
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаШапка.Операция.Наименование + ВЫБОР
		|		КОГДА (ВЫРАЗИТЬ(ВременнаяТаблицаШапка.Комментарий КАК СТРОКА(1024))) = """"
		|			ТОГДА """"
		|		ИНАЧЕ "" - ""
		|	КОНЕЦ + (ВЫРАЗИТЬ(ВременнаяТаблицаШапка.Комментарий КАК СТРОКА(1024))),
		|	ВременнаяТаблицаПодотчет.СуммаПлатежа * ВременнаяТаблицаШапка.Курс
		|ИЗ
		|	ВременнаяТаблицаПодотчет КАК ВременнаяТаблицаПодотчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО ВременнаяТаблицаПодотчет.Ссылка = ВременнаяТаблицаШапка.Ссылка
		|ГДЕ
		|	ВременнаяТаблицаШапка.Операция.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПКО.ВозвратОтПодотчетника)
		|	И ВременнаяТаблицаПодотчет.СуммаПлатежа <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.Касса.СчетУчета,
		|	ВременнаяТаблицаШапка.СчетУчета,
		|	ВременнаяТаблицаШапка.Касса,
		|	ВременнаяТаблицаШапка.СтатьяДвиженияДенежныхСредств,
		|	НЕОПРЕДЕЛЕНО,
		|	ВременнаяТаблицаШапка.Касса,
		|	ВременнаяТаблицаШапка.СтатьяДвиженияДенежныхСредств,
		|	НЕОПРЕДЕЛЕНО,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.Касса.СчетУчета.Валютный
		|			ТОГДА ВременнаяТаблицаШапка.Касса.ВалютаДенежныхСредств
		|		ИНАЧЕ &ВалютаРегламентированногоУчета
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.СчетУчета.Валютный
		|			ТОГДА ВременнаяТаблицаШапка.ВалютаКонвертации
		|		ИНАЧЕ &ВалютаРегламентированногоУчета
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.Касса.СчетУчета.Валютный
		|			ТОГДА ВременнаяТаблицаШапка.СуммаДокумента
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.СчетУчета.Валютный
		|			ТОГДА ВременнаяТаблицаШапка.СуммаКонвертации
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаШапка.Операция.Наименование + ВЫБОР
		|		КОГДА (ВЫРАЗИТЬ(ВременнаяТаблицаШапка.Комментарий КАК СТРОКА(1024))) = """"
		|			ТОГДА """"
		|		ИНАЧЕ "" - ""
		|	КОНЕЦ + (ВЫРАЗИТЬ(ВременнаяТаблицаШапка.Комментарий КАК СТРОКА(1024))),
		|	ВременнаяТаблицаШапка.СуммаДокумента * ВременнаяТаблицаШапка.Курс
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|ГДЕ
		|	ВременнаяТаблицаШапка.Операция.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПКО.Конвертация)
		|	И ВременнаяТаблицаШапка.СуммаДокумента <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.СуммаКР > 0
		|			ТОГДА ВременнаяТаблицаШапка.СчетУчета
		|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УбыткиОтКурсовыхРазницПоОперациямВИностраннойВалюте)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.СуммаКР > 0
		|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходОтКурсовыхРазницПоОперациямВИностраннойВалюте)
		|		ИНАЧЕ ВременнаяТаблицаШапка.СчетУчета
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.СуммаКР > 0
		|			ТОГДА ВременнаяТаблицаШапка.Касса
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.КурсовыеРазницы)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.СуммаКР > 0
		|			ТОГДА ВременнаяТаблицаШапка.СтатьяДвиженияДенежныхСредств
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	НЕОПРЕДЕЛЕНО,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.СуммаКР > 0
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ВременнаяТаблицаШапка.Касса
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.СуммаКР > 0
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ВременнаяТаблицаШапка.СтатьяДвиженияДенежныхСредств
		|	КОНЕЦ,
		|	НЕОПРЕДЕЛЕНО,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.СуммаКР > 0
		|			ТОГДА ВременнаяТаблицаШапка.Касса.ВалютаДенежныхСредств
		|		ИНАЧЕ &ВалютаРегламентированногоУчета
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.СуммаКР > 0
		|			ТОГДА &ВалютаРегламентированногоУчета
		|		ИНАЧЕ ВременнаяТаблицаШапка.Касса.ВалютаДенежныхСредств
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.СуммаКР > 0
		|			ТОГДА ВременнаяТаблицаШапка.СуммаКР / ВременнаяТаблицаШапка.Курс
		|		ИНАЧЕ ВременнаяТаблицаШапка.СуммаКР
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.СуммаКР > 0
		|			ТОГДА ВременнаяТаблицаШапка.СуммаКР
		|		ИНАЧЕ ВременнаяТаблицаШапка.СуммаКР / ВременнаяТаблицаШапка.Курс
		|	КОНЕЦ,
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.СуммаКР > 0
		|			ТОГДА ""Доход ""
		|		ИНАЧЕ ""Расход ""
		|	КОНЕЦ + ВременнаяТаблицаШапка.СодержаниеОКРКонвертация,
		|	ВременнаяТаблицаШапка.СуммаКР
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|ГДЕ
		|	ВременнаяТаблицаШапка.Операция.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПКО.Конвертация)
		|	И ВременнаяТаблицаШапка.СуммаКР <> 0";
						
	//Операционная курсовая разница
	ТекстОКР = "";
	Если НЕ Константы.НеСчитатьОперационныеКурсовыеРазницы.Получить() Тогда	
		
		Если ДокументСсылка.ВалютаДенежныхСредств <> ВалютаРегламентированногоУчета И ДокументСсылка.ВалютаДоговора <> ВалютаРегламентированногоУчета Тогда
			ТекстОКР =
			"ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА (ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов - ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВЫБОР
			|				КОГДА ВременнаяТаблицаШапка.КурсДоговора > ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов
			|					ТОГДА ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.КурсДоговора
			|				ИНАЧЕ ВременнаяТаблицаШапка.КурсДоговора / ВременнаяТаблицаШапка.Курс
			|			КОНЕЦ) * ВременнаяТаблицаШапка.Курс < 0
			|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УбыткиОтКурсовыхРазницПоОперациямВИностраннойВалюте)
			|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.СчетУчета
			|	КОНЕЦ КАК СчетДт,
			|	ВЫБОР
			|		КОГДА (ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов - ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВЫБОР
			|				КОГДА ВременнаяТаблицаШапка.КурсДоговора > ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов
			|					ТОГДА ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.КурсДоговора
			|				ИНАЧЕ ВременнаяТаблицаШапка.КурсДоговора / ВременнаяТаблицаШапка.Курс
			|			КОНЕЦ) * ВременнаяТаблицаШапка.Курс < 0
			|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СчетУчета
			|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходОтКурсовыхРазницПоОперациямВИностраннойВалюте)
			|	КОНЕЦ КАК СчетКт,
			|	ВЫБОР
			|		КОГДА (ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов - ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВЫБОР
			|				КОГДА ВременнаяТаблицаШапка.КурсДоговора > ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов
			|					ТОГДА ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.КурсДоговора
			|				ИНАЧЕ ВременнаяТаблицаШапка.КурсДоговора / ВременнаяТаблицаШапка.Курс
			|			КОНЕЦ) * ВременнаяТаблицаШапка.Курс < 0
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.КурсовыеРазницы)
			|		ИНАЧЕ ВременнаяТаблицаШапка.Контрагент
			|	КОНЕЦ КАК СубконтоДт1,
			|	ВЫБОР
			|		КОГДА (ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов - ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВЫБОР
			|				КОГДА ВременнаяТаблицаШапка.КурсДоговора > ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов
			|					ТОГДА ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.КурсДоговора
			|				ИНАЧЕ ВременнаяТаблицаШапка.КурсДоговора / ВременнаяТаблицаШапка.Курс
			|			КОНЕЦ) * ВременнаяТаблицаШапка.Курс < 0
			|			ТОГДА НЕОПРЕДЕЛЕНО
			|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.ДоговорКонтрагента
			|	КОНЕЦ КАК СубконтоДт2,
			|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
			|	ВЫБОР
			|		КОГДА (ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов - ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВЫБОР
			|				КОГДА ВременнаяТаблицаШапка.КурсДоговора > ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов
			|					ТОГДА ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.КурсДоговора
			|				ИНАЧЕ ВременнаяТаблицаШапка.КурсДоговора / ВременнаяТаблицаШапка.Курс
			|			КОНЕЦ) * ВременнаяТаблицаШапка.Курс < 0
			|			ТОГДА ВременнаяТаблицаШапка.Контрагент
			|		ИНАЧЕ НЕОПРЕДЕЛЕНО
			|	КОНЕЦ КАК СубконтоКт1,
			|	ВЫБОР
			|		КОГДА (ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов - ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВЫБОР
			|				КОГДА ВременнаяТаблицаШапка.КурсДоговора > ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов
			|					ТОГДА ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.КурсДоговора
			|				ИНАЧЕ ВременнаяТаблицаШапка.КурсДоговора / ВременнаяТаблицаШапка.Курс
			|			КОНЕЦ) * ВременнаяТаблицаШапка.Курс < 0
			|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.ДоговорКонтрагента
			|		ИНАЧЕ НЕОПРЕДЕЛЕНО
			|	КОНЕЦ КАК СубконтоКт2,
			|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
			|	&ВалютаРегламентированногоУчета КАК ВалютаДт,
			|	ВременнаяТаблицаШапка.ВалютаДоговора КАК ВалютаКт,
			|	0 КАК ВалютнаяСуммаДт,
			|	0 КАК ВалютнаяСуммаКт,
			|	ВременнаяТаблицаШапка.Дата,
			|	ВременнаяТаблицаШапка.Организация,
			|	ВременнаяТаблицаШапка.СодержаниеОКР,
			|	ВЫБОР
			|		КОГДА (ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов - ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВЫБОР
			|				КОГДА ВременнаяТаблицаШапка.КурсДоговора > ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов
			|					ТОГДА ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.КурсДоговора
			|				ИНАЧЕ ВременнаяТаблицаШапка.КурсДоговора / ВременнаяТаблицаШапка.Курс
			|			КОНЕЦ) * ВременнаяТаблицаШапка.Курс > 0
			|			ТОГДА (ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов - ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВЫБОР
			|					КОГДА ВременнаяТаблицаШапка.КурсДоговора > ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов
			|						ТОГДА ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.КурсДоговора
			|					ИНАЧЕ ВременнаяТаблицаШапка.КурсДоговора / ВременнаяТаблицаШапка.Курс
			|				КОНЕЦ) * ВременнаяТаблицаШапка.Курс
			|		ИНАЧЕ -((ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов - ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВЫБОР
			|				КОГДА ВременнаяТаблицаШапка.КурсДоговора > ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов
			|					ТОГДА ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.КурсДоговора
			|				ИНАЧЕ ВременнаяТаблицаШапка.КурсДоговора / ВременнаяТаблицаШапка.Курс
			|			КОНЕЦ) * ВременнаяТаблицаШапка.Курс)
			|	КОНЕЦ КАК Сумма
			|ИЗ
			|	ВременнаяТаблицаРасшифровкаПлатежа КАК ВременнаяТаблицаРасшифровкаПлатежа
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
			|		ПО ВременнаяТаблицаРасшифровкаПлатежа.Ссылка = ВременнаяТаблицаШапка.Ссылка
			|ГДЕ
			|	НЕ (ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов - ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВЫБОР
			|				КОГДА ВременнаяТаблицаШапка.КурсДоговора > ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов
			|					ТОГДА ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.КурсДоговора
			|				ИНАЧЕ ВременнаяТаблицаШапка.КурсДоговора / ВременнаяТаблицаШапка.Курс
			|			КОНЕЦ) * ВременнаяТаблицаШапка.Курс = 0					
			|	И НЕ ВременнаяТаблицаШапка.ВалютаДоговора = ВременнаяТаблицаШапка.Касса.ВалютаДенежныхСредств
			|	И НЕ ВременнаяТаблицаШапка.КурсДоговора = ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов";		
		Иначе
			ТекстОКР = 
			"ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаШапка.Курс - ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов * ВременнаяТаблицаШапка.КурсДоговора < 0
			|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УбыткиОтКурсовыхРазницПоОперациямВИностраннойВалюте)
			|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.СчетУчета
			|	КОНЕЦ КАК СчетДт,
			|	ВЫБОР
			|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаШапка.Курс - ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов * ВременнаяТаблицаШапка.КурсДоговора < 0
			|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СчетУчета
			|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходОтКурсовыхРазницПоОперациямВИностраннойВалюте)
			|	КОНЕЦ КАК СчетКт,
			|	ВЫБОР
			|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаШапка.Курс - ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов * ВременнаяТаблицаШапка.КурсДоговора < 0
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.КурсовыеРазницы)
			|		ИНАЧЕ ВременнаяТаблицаШапка.Контрагент
			|	КОНЕЦ КАК СубконтоДт1,
			|	ВЫБОР
			|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаШапка.Курс - ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов * ВременнаяТаблицаШапка.КурсДоговора < 0
			|			ТОГДА НЕОПРЕДЕЛЕНО
			|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.ДоговорКонтрагента
			|	КОНЕЦ КАК СубконтоДт2,
			|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
			|	ВЫБОР
			|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаШапка.Курс - ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов * ВременнаяТаблицаШапка.КурсДоговора < 0
			|			ТОГДА ВременнаяТаблицаШапка.Контрагент
			|		ИНАЧЕ НЕОПРЕДЕЛЕНО
			|	КОНЕЦ КАК СубконтоКт1,
			|	ВЫБОР
			|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаШапка.Курс - ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов * ВременнаяТаблицаШапка.КурсДоговора < 0
			|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.ДоговорКонтрагента
			|		ИНАЧЕ НЕОПРЕДЕЛЕНО
			|	КОНЕЦ КАК СубконтоКт2,
			|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
			|	&ВалютаРегламентированногоУчета КАК ВалютаДт,
			|	ВременнаяТаблицаШапка.ВалютаДоговора КАК ВалютаКт,
			|	0 КАК ВалютнаяСуммаДт,
			|	0 КАК ВалютнаяСуммаКт,
			|	ВременнаяТаблицаШапка.Дата,
			|	ВременнаяТаблицаШапка.Организация,
			|	ВременнаяТаблицаШапка.СодержаниеОКР,
			|	ВЫБОР
			|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаШапка.Курс - ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов * ВременнаяТаблицаШапка.КурсДоговора > 0
			|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаШапка.Курс - ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов * ВременнаяТаблицаШапка.КурсДоговора
			|		ИНАЧЕ -(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаШапка.Курс - ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов * ВременнаяТаблицаШапка.КурсДоговора)
			|	КОНЕЦ КАК Сумма
			|ИЗ
			|	ВременнаяТаблицаРасшифровкаПлатежа КАК ВременнаяТаблицаРасшифровкаПлатежа
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
			|		ПО ВременнаяТаблицаРасшифровкаПлатежа.Ссылка = ВременнаяТаблицаШапка.Ссылка
			|ГДЕ
			|	НЕ ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаШапка.Курс - ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов * ВременнаяТаблицаШапка.КурсДоговора = 0
			|	И НЕ ВременнаяТаблицаШапка.ВалютаДоговора = ВременнаяТаблицаШапка.Касса.ВалютаДенежныхСредств
			|	И НЕ ВременнаяТаблицаШапка.КурсДоговора = ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов";		
					
		КонецЕсли;
		ТекстОКР = 
		"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|"
		+ ТекстОКР;	
		
	КонецЕсли;
		
	Запрос.Текст = Запрос.Текст + ТекстОКР;			
	
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	
	РезультатЗапроса = Запрос.Выполнить();	
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаХозрасчетный", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаДенежныеСредства()

// Формирует таблицу значений, содержащую данные для проведения по регистру накопления ДвиженияДенежныхСредств.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДДС(СтруктураДополнительныеСвойства)
	
	ВалютаРегламентированногоУчета = СтруктураДополнительныеСвойства.ДляПроведения.ВалютаРегламентированногоУчета;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =	
		"ВЫБРАТЬ
		|	ВременнаяТаблицаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств КАК Статья,
		|	ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаШапка.Курс КАК Сумма,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаШапка.Дата КАК Период
		|ИЗ
		|	ВременнаяТаблицаРасшифровкаПлатежа КАК ВременнаяТаблицаРасшифровкаПлатежа
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО ВременнаяТаблицаРасшифровкаПлатежа.Ссылка = ВременнаяТаблицаШапка.Ссылка
		|ГДЕ
		|	НЕ ВременнаяТаблицаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
		|	И (ВременнаяТаблицаШапка.Операция.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПКО.ОплатаОтПокупателя)
		|			ИЛИ ВременнаяТаблицаШапка.Операция.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПКО.ВозвратОтПоставщика)
		|			ИЛИ ВременнаяТаблицаШапка.Операция.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПКО.РасчетыПоЗаймам))
		|	И ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаВозвратЗаработнойПлаты.СтатьяДвиженияДенежныхСредств,
		|	ВременнаяТаблицаВозвратЗаработнойПлаты.СуммаПлатежа * ВременнаяТаблицаШапка.Курс,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаШапка.Дата
		|ИЗ
		|	ВременнаяТаблицаВозвратЗаработнойПлаты КАК ВременнаяТаблицаВозвратЗаработнойПлаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО ВременнаяТаблицаВозвратЗаработнойПлаты.Ссылка = ВременнаяТаблицаШапка.Ссылка
		|ГДЕ
		|	НЕ ВременнаяТаблицаВозвратЗаработнойПлаты.СтатьяДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
		|	И ВременнаяТаблицаШапка.Операция.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПКО.ВозвратОтСотрудника)
		|	И ВременнаяТаблицаВозвратЗаработнойПлаты.СуммаПлатежа <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаПодотчет.СтатьяДвиженияДенежныхСредств,
		|	ВременнаяТаблицаПодотчет.СуммаПлатежа * ВременнаяТаблицаШапка.Курс,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаШапка.Дата
		|ИЗ
		|	ВременнаяТаблицаПодотчет КАК ВременнаяТаблицаПодотчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО ВременнаяТаблицаПодотчет.Ссылка = ВременнаяТаблицаШапка.Ссылка
		|ГДЕ
		|	НЕ ВременнаяТаблицаПодотчет.СтатьяДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
		|	И ВременнаяТаблицаШапка.Операция.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПКО.ВозвратОтПодотчетника)
		|	И ВременнаяТаблицаПодотчет.СуммаПлатежа <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаПрочийПриход.СтатьяДвиженияДенежныхСредств,
		|	ВременнаяТаблицаПрочийПриход.СуммаПлатежа * ВременнаяТаблицаШапка.Курс,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаШапка.Дата
		|ИЗ
		|	ВременнаяТаблицаПрочийПриход КАК ВременнаяТаблицаПрочийПриход
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО ВременнаяТаблицаПрочийПриход.Ссылка = ВременнаяТаблицаШапка.Ссылка
		|ГДЕ
		|	НЕ ВременнаяТаблицаПрочийПриход.СтатьяДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
		|	И ВременнаяТаблицаШапка.Операция.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПКО.ПрочийПриход)
		|	И ВременнаяТаблицаПрочийПриход.СуммаПлатежа <> 0";
		
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);		
		
	РезультатЗапроса = Запрос.Выполнить();	
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДДС", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру накопления ВозвратДенежныхСредствПодотчетником.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаОтразитьВозвратПодотчетником(СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.ФизЛицо,
		|	ВременнаяТаблицаПодотчет.СуммаПлатежа * ВременнаяТаблицаШапка.Курс КАК Сумма,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаШапка.Дата КАК Период
		|ИЗ
		|	ВременнаяТаблицаПодотчет КАК ВременнаяТаблицаПодотчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО ВременнаяТаблицаПодотчет.Ссылка = ВременнаяТаблицаШапка.Ссылка";	
		
		
	РезультатЗапроса = Запрос.Выполнить();	
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОтразитьВозвратПодотчетником", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру "АвансыПодотчетника".
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаАвансыПодотчетника(ДокументСсылка,СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.Ссылка КАК Документ,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	ВременнаяТаблицаШапка.ФизЛицо КАК ФизЛицо,
		|	ВременнаяТаблицаШапка.ВалютаДенежныхСредств КАК Валюта,
		|	-ВременнаяТаблицаШапка.СуммаДокумента КАК Сумма
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|ГДЕ
		|	ВременнаяТаблицаШапка.Операция = ЗНАЧЕНИЕ(Справочник.ОперацииПКО.ВозвратДенежныхСредствПодотчетником)";	
	РезультатЗапроса = Запрос.Выполнить();	
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаАвансыПодотчетника", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	//СтатьяДт - для проводок по РН ДДС
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПриходныйКассовыйОрдер.Ссылка,
		|	ПриходныйКассовыйОрдер.Номер,
		|	ПриходныйКассовыйОрдер.Дата,
		|	ПриходныйКассовыйОрдер.Проведен,
		|	ПриходныйКассовыйОрдер.Организация,
		|	ПриходныйКассовыйОрдер.Операция,
		|	ПриходныйКассовыйОрдер.Касса,
		|	ПриходныйКассовыйОрдер.ВалютаДенежныхСредств,
		|	ПриходныйКассовыйОрдер.ВалютаДоговора,
		|	ПриходныйКассовыйОрдер.СтатьяДвиженияДенежныхСредств,
		|	ПриходныйКассовыйОрдер.Контрагент,
		|	ПриходныйКассовыйОрдер.СчетУчета,
		|	ПриходныйКассовыйОрдер.ФизЛицо,
		|	ПриходныйКассовыйОрдер.БанковскийСчет,
		|	ПриходныйКассовыйОрдер.Курс,
		|	ПриходныйКассовыйОрдер.КурсДоговора,
		|	ПриходныйКассовыйОрдер.ДокументОснование,
		|	ПриходныйКассовыйОрдер.СуммаДокумента,
		|	ПриходныйКассовыйОрдер.Комментарий,
		|	ПриходныйКассовыйОрдер.Автор,
		|	ПриходныйКассовыйОрдер.НазначениеПлатежа,
		|	ПриходныйКассовыйОрдер.ПринятоОт,
		|	ПриходныйКассовыйОрдер.Основание,
		|	ПриходныйКассовыйОрдер.Приложение,
		|	ПриходныйКассовыйОрдер.ПоДокументу,
		|	&СодержаниеОКР КАК СодержаниеОКР,
		|	&СодержаниеОКРКонвертация КАК СодержаниеОКРКонвертация,
		|	ПриходныйКассовыйОрдер.СуммаКонвертации,
		|	ПриходныйКассовыйОрдер.ВалютаКонвертации,
		|	ПриходныйКассовыйОрдер.КурсВалютыКонвертации,
		|	ПриходныйКассовыйОрдер.КурсОбмена,
		|	ПриходныйКассовыйОрдер.КросскурсНБКР,
		|	ПриходныйКассовыйОрдер.ПрямойКурс,
		|	ПриходныйКассовыйОрдер.СуммаКР
		|ПОМЕСТИТЬ ВременнаяТаблицаШапка
		|ИЗ
		|	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
		|ГДЕ
		|	ПриходныйКассовыйОрдер.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка,
		|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.ДоговорКонтрагента,
		|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств,
		|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.СчетУчета,
		|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.СуммаПлатежа,
		|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.КурсВзаиморасчетов,
		|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Комментарий,
		|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.НомерСтроки,
		|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Контрагент,
		|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.СуммаВзаиморасчетов
		|ПОМЕСТИТЬ ВременнаяТаблицаРасшифровкаПлатежа
		|ИЗ
		|	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПриходныйКассовыйОрдерРасшифровкаПлатежа
		|ГДЕ
		|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПриходныйКассовыйОрдерПрочиеРасходы.Ссылка,
		|	ПриходныйКассовыйОрдерПрочиеРасходы.НомерСтроки,
		|	ПриходныйКассовыйОрдерПрочиеРасходы.СчетУчета,
		|	ПриходныйКассовыйОрдерПрочиеРасходы.СтатьяДвиженияДенежныхСредств,
		|	ПриходныйКассовыйОрдерПрочиеРасходы.СуммаПлатежа,
		|	ПриходныйКассовыйОрдерПрочиеРасходы.Субконто1,
		|	ПриходныйКассовыйОрдерПрочиеРасходы.Субконто2,
		|	ПриходныйКассовыйОрдерПрочиеРасходы.Субконто3
		|ПОМЕСТИТЬ ВременнаяТаблицаПрочийПриход
		|ИЗ
		|	Документ.ПриходныйКассовыйОрдер.ПрочиеРасходы КАК ПриходныйКассовыйОрдерПрочиеРасходы
		|ГДЕ
		|	ПриходныйКассовыйОрдерПрочиеРасходы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПриходныйКассовыйОрдерВозвратЗаработнойПлаты.Ссылка,
		|	ПриходныйКассовыйОрдерВозвратЗаработнойПлаты.НомерСтроки,
		|	ПриходныйКассовыйОрдерВозвратЗаработнойПлаты.Ведомость,
		|	ПриходныйКассовыйОрдерВозвратЗаработнойПлаты.ФизЛицо,
		|	ПриходныйКассовыйОрдерВозвратЗаработнойПлаты.СтатьяДвиженияДенежныхСредств,
		|	ПриходныйКассовыйОрдерВозвратЗаработнойПлаты.СуммаПлатежа
		|ПОМЕСТИТЬ ВременнаяТаблицаВозвратЗаработнойПлаты
		|ИЗ
		|	Документ.ПриходныйКассовыйОрдер.ВозвратЗаработнойПлаты КАК ПриходныйКассовыйОрдерВозвратЗаработнойПлаты
		|ГДЕ
		|	ПриходныйКассовыйОрдерВозвратЗаработнойПлаты.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПриходныйКассовыйОрдерВыдачаВПодотчет.Ссылка,
		|	ПриходныйКассовыйОрдерВыдачаВПодотчет.НомерСтроки,
		|	ПриходныйКассовыйОрдерВыдачаВПодотчет.СтатьяДвиженияДенежныхСредств,
		|	ПриходныйКассовыйОрдерВыдачаВПодотчет.СуммаПлатежа
		|ПОМЕСТИТЬ ВременнаяТаблицаПодотчет
		|ИЗ
		|	Документ.ПриходныйКассовыйОрдер.ВыдачаВПодотчет КАК ПриходныйКассовыйОрдерВыдачаВПодотчет
		|ГДЕ
		|	ПриходныйКассовыйОрдерВыдачаВПодотчет.Ссылка = &Ссылка";	
				
	Запрос.УстановитьПараметр("Ссылка", 		ДокументСсылка);
	Запрос.УстановитьПараметр("Организация", 	ДокументСсылка.Организация);
	Запрос.УстановитьПараметр("СодержаниеОКР", 	?(ДокументСсылка.РасшифровкаПлатежа.Количество() > 0, "ОКР. Курс НБКР = " + ДокументСсылка.Курс, ""));	
	Запрос.УстановитьПараметр("СодержаниеОКРКонвертация", 	"ОКР - Конвертация. Кросскурс НБКР = " + СтруктураДополнительныеСвойства.ДляПроведения.КросскурсНБКР);
	
	Запрос.Выполнить();
	
	СформироватьТаблицаХозрасчетный(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДДС(СтруктураДополнительныеСвойства);
	СформироватьТаблицаОтразитьВозвратПодотчетником(СтруктураДополнительныеСвойства);
	СформироватьТаблицаАвансыПодотчетника(ДокументСсылка, СтруктураДополнительныеСвойства);

КонецПроцедуры // ИнициализироватьДанныеДокумента()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьСтрокуСчетовКт(ВыборкаРасшифровкаПлатежа)

	Первый = Истина;
	СтрокаСчетаКт = "";
	
	Пока ВыборкаРасшифровкаПлатежа.Следующий()  Цикл
		СтрокаСчетаКт = СтрокаСчетаКт + ?(Первый, ВыборкаРасшифровкаПлатежа.СчетУчета, ", " + ВыборкаРасшифровкаПлатежа.СчетУчета);                    
		Первый = Ложь;
	КонецЦикла;
	
	ВыборкаРасшифровкаПлатежа.Сбросить();
	
	Возврат СтрокаСчетаКт;
	
КонецФункции // ()

Функция СформироватьСтрокуКодовАналитическогоУчета(ВыборкаПрочиеРасходы)

	Первый = Истина;
	Строка = "";
	
	Пока ВыборкаПрочиеРасходы.Следующий()  Цикл
		Код = ВыборкаПрочиеРасходы.КодАналитическогоУчета;
		Если ЗначениеЗаполнено(Код) Тогда
			Строка = Строка + ?(Первый, Код, ", " + Код);                    
			Первый = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	ВыборкаПрочиеРасходы.Сбросить();
	
	Возврат Строка;
	
КонецФункции // ()

#КонецОбласти

#Область ВерсионированиеОбъектов

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область ИнтерфейсПечати

// Формирует и возвращает текст запроса для выборки данных,
// необходимых для формирования печатной формы
//
Функция ПолучитьТекстЗапросаДляФормированияПечатнойФормыПКО()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ПриходныйКассовыйОрдер.Ссылка,
	|	ПриходныйКассовыйОрдер.ВерсияДанных,
	|	ПриходныйКассовыйОрдер.ПометкаУдаления,
	|	ПриходныйКассовыйОрдер.Номер,
	|	ПриходныйКассовыйОрдер.Дата,
	|	ПриходныйКассовыйОрдер.Проведен,
	|	ПриходныйКассовыйОрдер.Организация,
	|	ПриходныйКассовыйОрдер.Операция,
	|	ПриходныйКассовыйОрдер.Касса,
	|	ПриходныйКассовыйОрдер.ВалютаДенежныхСредств,
	|	ПриходныйКассовыйОрдер.ВалютаДоговора,
	|	ПриходныйКассовыйОрдер.СтатьяДвиженияДенежныхСредств,
	|	ПриходныйКассовыйОрдер.Контрагент,
	|	ПриходныйКассовыйОрдер.СчетУчета КАК Корреспонденция,
	|	ПриходныйКассовыйОрдер.ФизЛицо,
	|	ПриходныйКассовыйОрдер.БанковскийСчет,
	|	ПриходныйКассовыйОрдер.Курс КАК Курс,
	|	ПриходныйКассовыйОрдер.ДокументОснование,
	|	ПриходныйКассовыйОрдер.СуммаДокумента,
	|	ПриходныйКассовыйОрдер.Комментарий,
	|	ПриходныйКассовыйОрдер.Автор,
	|	ПриходныйКассовыйОрдер.НазначениеПлатежа,
	|	ПриходныйКассовыйОрдер.ПринятоОт,
	|	ПриходныйКассовыйОрдер.Основание,
	|	ПриходныйКассовыйОрдер.Приложение,
	|	ПриходныйКассовыйОрдер.Касса.СчетУчета КАК Дебет,
	|	ПриходныйКассовыйОрдер.ФизЛицо.Код КАК ТабельныйНомерФизЛица,
	|	ПриходныйКассовыйОрдер.РасшифровкаПлатежа.(
	|		СчетУчета КАК СчетКт
	|	),
	|	"""" КАК ПредставлениеПодразделения
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	|ГДЕ
	|	ПриходныйКассовыйОрдер.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка,
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.НомерСтроки,
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.ДоговорКонтрагента,
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств,
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.СчетУчета,
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.СуммаПлатежа,
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Комментарий,
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Контрагент.Код КАК КодКонтрагента
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПриходныйКассовыйОрдерРасшифровкаПлатежа
	|ГДЕ
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриходныйКассовыйОрдерПрочиеРасходы.Ссылка,
	|	ПриходныйКассовыйОрдерПрочиеРасходы.НомерСтроки,
	|	ПриходныйКассовыйОрдерПрочиеРасходы.СчетУчета,
	|	ПриходныйКассовыйОрдерПрочиеРасходы.СтатьяДвиженияДенежныхСредств,
	|	ПриходныйКассовыйОрдерПрочиеРасходы.СуммаПлатежа,
	|	ПриходныйКассовыйОрдерПрочиеРасходы.Субконто1,
	|	ПриходныйКассовыйОрдерПрочиеРасходы.Субконто2,
	|	ПриходныйКассовыйОрдерПрочиеРасходы.Субконто3,
	|	ВЫБОР
	|		КОГДА ПриходныйКассовыйОрдерПрочиеРасходы.Субконто1 ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ВЫРАЗИТЬ(ПриходныйКассовыйОрдерПрочиеРасходы.Субконто1 КАК Справочник.ФизическиеЛица).Код
	|		КОГДА ПриходныйКассовыйОрдерПрочиеРасходы.Субконто1 ССЫЛКА Справочник.Контрагенты
	|			ТОГДА ВЫРАЗИТЬ(ПриходныйКассовыйОрдерПрочиеРасходы.Субконто1 КАК Справочник.Контрагенты).Код
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК КодАналитическогоУчета
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер.ПрочиеРасходы КАК ПриходныйКассовыйОрдерПрочиеРасходы
	|ГДЕ
	|	ПриходныйКассовыйОрдерПрочиеРасходы.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриходныйКассовыйОрдерВозвратЗаработнойПлаты.Ссылка,
	|	ПриходныйКассовыйОрдерВозвратЗаработнойПлаты.НомерСтроки,
	|	ПриходныйКассовыйОрдерВозвратЗаработнойПлаты.Ведомость,
	|	ПриходныйКассовыйОрдерВозвратЗаработнойПлаты.ФизЛицо,
	|	ПриходныйКассовыйОрдерВозвратЗаработнойПлаты.ФизЛицо.Код КАК КодАналитическогоУчета,
	|	ПриходныйКассовыйОрдерВозвратЗаработнойПлаты.СтатьяДвиженияДенежныхСредств,
	|	ПриходныйКассовыйОрдерВозвратЗаработнойПлаты.СуммаПлатежа
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер.ВозвратЗаработнойПлаты КАК ПриходныйКассовыйОрдерВозвратЗаработнойПлаты
	|ГДЕ
	|	ПриходныйКассовыйОрдерВозвратЗаработнойПлаты.Ссылка В(&МассивОбъектов)";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Функция формирует табличный документ с печатной формой ПКО
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьПКО(МассивОбъектов, ОбъектыПечати)
	Перем ПодразделениеОтветственныхЛиц;
	
	УказыватьВремяОплаты = Константы.ВремяПечатиПКО.Получить();
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВалютаРегламентированногоУчета = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПриходныйКассовыйОрдер_КО1";
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = ПолучитьТекстЗапросаДляФормированияПечатнойФормыПКО();
	
	РезультатЗапроса 			= Запрос.ВыполнитьПакет();
	Шапка 						= РезультатЗапроса[0].Выбрать();
	ТаблицаРасшифровкаПлатежа	= РезультатЗапроса[1].Выгрузить();
	ВыборкаПрочийПриход			= РезультатЗапроса[2].Выбрать();
	ВыборкаЗП					= РезультатЗапроса[3].Выбрать();

	ПервыйДокумент = Истина;
	Пока Шапка.Следующий() Цикл
		
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ИмяМакета = "КО1";
		Макет = Документы.ПриходныйКассовыйОрдер.ПолучитьМакет(ИмяМакета);
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		
		Валютный = Шапка.ВалютаДенежныхСредств <> ВалютаРегламентированногоУчета;
		
		// Выводим шапку РКО		
		ОбластьМакетаШапка 	= Макет.ПолучитьОбласть("Шапка");		
		ОбластьМакетаШапка.Параметры.Заполнить(Шапка);
		ОбластьМакетаШапка.Параметры.Валюта 						= Шапка.ВалютаДенежныхСредств;
		
		
		НашаОрганизация = Шапка.Организация;
		ОбластьМакетаШапка.Параметры.ПредставлениеОрганизации 		= ?(ЗначениеЗаполнено(НашаОрганизация.НаименованиеПолное), 
																		НашаОрганизация.НаименованиеПолное, НашаОрганизация.Наименование);		
		ОбластьМакетаШапка.Параметры.ОрганизацияПоОКПО 				= НашаОрганизация.КодПоОКПО;
		ОбластьМакетаШапка.Параметры.ДатаДокумента     				= Формат(Шапка.Дата, "ДФ = 'дд.ММ.гггг'")+" г.";
		ОбластьМакетаШапка.Параметры.НомерДокумента    				= ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Шапка.Номер);
		
		Если Шапка.Операция.ВидОперации = Перечисления.ВидыОперацийПКО.ОплатаОтПокупателя
			ИЛИ Шапка.Операция.ВидОперации = Перечисления.ВидыОперацийПКО.ВозвратОтПоставщика
			ИЛИ Шапка.Операция.ВидОперации = Перечисления.ВидыОперацийПКО.РасчетыПоЗаймам Тогда
			ОбластьМакетаШапка.Параметры.Сумма 					= ТаблицаРасшифровкаПлатежа.Итог("СуммаПлатежа");
			ОбластьМакетаШапка.Параметры.СчетДт 				= Шапка.Дебет;
			ОбластьМакетаШапка.Параметры.СчетКт 				= ТаблицаРасшифровкаПлатежа[0].СчетУчета;
			ОбластьМакетаШапка.Параметры.КодАналитическогоУчета = Шапка.ТабельныйНомерФизЛица;
		ИначеЕсли Шапка.Операция.ВидОперации = Перечисления.ВидыОперацийПКО.ПрочийПриход Тогда			
			ОбластьМакетаШапка.Параметры.Сумма 					= Шапка.СуммаДокумента;
			ОбластьМакетаШапка.Параметры.СчетДт 				= Шапка.Дебет;
			ОбластьМакетаШапка.Параметры.СчетКт 				= СформироватьСтрокуСчетовКт(ВыборкаПрочийПриход);
			ОбластьМакетаШапка.Параметры.КодАналитическогоУчета = СформироватьСтрокуКодовАналитическогоУчета(ВыборкаПрочийПриход);			
		ИначеЕсли Шапка.Операция.ВидОперации = Перечисления.ВидыОперацийПКО.ВозвратОтСотрудника Тогда			
			ОбластьМакетаШапка.Параметры.Сумма 					= Шапка.СуммаДокумента;
			ОбластьМакетаШапка.Параметры.СчетДт 				= Шапка.Дебет;
			ОбластьМакетаШапка.Параметры.СчетКт 				= Шапка.Корреспонденция;
			ОбластьМакетаШапка.Параметры.КодАналитическогоУчета = СформироватьСтрокуКодовАналитическогоУчета(ВыборкаЗП);								
		Иначе
			ОбластьМакетаШапка.Параметры.Сумма 					= Шапка.СуммаДокумента;
			ОбластьМакетаШапка.Параметры.СчетДт 				= Шапка.Дебет;
			ОбластьМакетаШапка.Параметры.СчетКт 				= Шапка.Корреспонденция;
			ОбластьМакетаШапка.Параметры.КодАналитическогоУчета = Шапка.ТабельныйНомерФизЛица;
		КонецЕсли;
		
		ОбластьМакетаШапка.Параметры.СуммаПрописью     			= РаботаСКурсамиВалют.СформироватьСуммуПрописью(Шапка.СуммаДокумента, Шапка.ВалютаДенежныхСредств);

		Руководители 	= БухгалтерскийУчетСервер.ОтветственныеЛицаОрганизаций(Шапка.Организация, КонецДня(Шапка.Дата));
		Руководитель 	= Руководители.Руководитель;
		РуководительДолжность = Руководители.РуководительДолжность;
		Бухгалтер    	= Руководители.ГлавныйБухгалтер;
		Кассир    		= Руководители.Кассир;
		
		ОбластьМакетаШапка.Параметры.ФИОГлавногоБухгалтера 		= Бухгалтер;
		ОбластьМакетаШапка.Параметры.ФИОКассира            		= Кассир;
		
		ОбластьМакетаШапка.Параметры.Основание             		= Шапка.Основание;				
		ОбластьМакетаШапка.Параметры.ПринятоОт      			= Шапка.ПринятоОт;		
		ОбластьМакетаШапка.Параметры.Приложение             	= Шапка.Приложение;
		
		ТабличныйДокумент.Вывести(ОбластьМакетаШапка);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		                                               НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
													   
		Если УказыватьВремяОплаты Тогда
			ОбластьМакетаВремя 					= Макет.ПолучитьОбласть("ПодвалВремя");
			ОбластьМакетаВремя.Параметры.Время	= Формат(Шапка.Дата, "ДЛФ=T");											   			
			ТабличныйДокумент.Вывести(ОбластьМакетаВремя);
		КонецЕсли;
		
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	// Устанавливаем признак доступности печати покомплектно.
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	// Проверяем, нужно ли для макета ПКО формировать табличный документ.
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "КО1") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"КО1", НСтр("ru = 'Печать ПКО'"), ПечатьПКО(МассивОбъектов, ОбъектыПечати),,
			"Документ.ПриходныйКассовыйОрдер.КО1");
	КонецЕсли;	
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "КО1";
	КомандаПечати.Представление = НСтр("ru = 'Печать ПКО'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.Порядок = 1;
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли