#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыПроведенияДокумента

// Формирует таблицу значений, содержащую данные для проведения по регистру бухгалтерии Хозрасчетный.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаХозрасчетный(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	ВалютаРегламентированногоУчета = СтруктураДополнительныеСвойства.ДляПроведения.ВалютаРегламентированногоУчета;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	
		"ВЫБРАТЬ
		|	ВременнаяТаблицаРасшифровкаПлатежа.СчетУчета КАК СчетДт,
		|	ВременнаяТаблицаШапка.БанковскийСчет.СчетУчета КАК СчетКт,
		|	ВременнаяТаблицаШапка.Контрагент КАК СубконтоДт1,
		|	ВременнаяТаблицаРасшифровкаПлатежа.ДоговорКонтрагента КАК СубконтоДт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
		|	ВременнаяТаблицаШапка.БанковскийСчет КАК СубконтоКт1,
		|	ВременнаяТаблицаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств КАК СубконтоКт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.СчетУчета.Валютный
		|			ТОГДА ВременнаяТаблицаШапка.ВалютаДоговора
		|		ИНАЧЕ &ВалютаРегламентированногоУчета
		|	КОНЕЦ КАК ВалютаДт,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.БанковскийСчет.СчетУчета.Валютный
		|			ТОГДА ВременнаяТаблицаШапка.БанковскийСчет.ВалютаДенежныхСредств
		|		ИНАЧЕ &ВалютаРегламентированногоУчета
		|	КОНЕЦ КАК ВалютаКт,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.СчетУчета.Валютный
		|			ТОГДА ВЫБОР
		|					КОГДА ВременнаяТаблицаШапка.Курс >= ВременнаяТаблицаШапка.КурсДоговора
		|						ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов
		|					ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа / ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов
		|				КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ВалютнаяСуммаДт,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.БанковскийСчет.СчетУчета.Валютный
		|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ВалютнаяСуммаКт,
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаШапка.Операция КАК Содержание,
		|	ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаШапка.Курс КАК Сумма,
		|	0 КАК КоличествоДт,
		|	0 КАК КоличествоКт
		|ИЗ
		|	ВременнаяТаблицаРасшифровкаПлатежа КАК ВременнаяТаблицаРасшифровкаПлатежа
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО ИСТИНА
		|ГДЕ
		|	(ВременнаяТаблицаШапка.Операция.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППИ.ОплатаПоставщику)
		|			ИЛИ ВременнаяТаблицаШапка.Операция.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППИ.ВозвратПокупателю)
		|			ИЛИ ВременнаяТаблицаШапка.Операция.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППИ.РасчетыПоЗаймам))
		|	И ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаНалоги.СчетУчета,
		|	ВременнаяТаблицаШапка.БанковскийСчет.СчетУчета,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	ВременнаяТаблицаШапка.БанковскийСчет,
		|	ВременнаяТаблицаНалоги.СтатьяДвиженияДенежныхСредств,
		|	НЕОПРЕДЕЛЕНО,
		|	ВременнаяТаблицаШапка.БанковскийСчет.ВалютаДенежныхСредств,
		|	ВременнаяТаблицаШапка.БанковскийСчет.ВалютаДенежныхСредств,
		|	ВременнаяТаблицаНалоги.СуммаПлатежа,
		|	ВременнаяТаблицаНалоги.СуммаПлатежа,
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаШапка.Операция,
		|	ВременнаяТаблицаНалоги.СуммаПлатежа * ВременнаяТаблицаШапка.Курс,
		|	0,
		|	0
		|ИЗ
		|	ВременнаяТаблицаНалоги КАК ВременнаяТаблицаНалоги
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО ИСТИНА
		|ГДЕ
		|	ВременнаяТаблицаШапка.Операция.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППИ.ОплатаНалогов)
		|	И ВременнаяТаблицаНалоги.СуммаПлатежа <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.БанковскийСчетПолучателя.СчетУчета,
		|	ВременнаяТаблицаШапка.БанковскийСчет.СчетУчета,
		|	ВременнаяТаблицаШапка.БанковскийСчетПолучателя,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	ВременнаяТаблицаШапка.БанковскийСчет,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	ВременнаяТаблицаШапка.БанковскийСчетПолучателя.ВалютаДенежныхСредств,
		|	ВременнаяТаблицаШапка.БанковскийСчет.ВалютаДенежныхСредств,
		|	ВременнаяТаблицаШапка.СуммаДокумента,
		|	ВременнаяТаблицаШапка.СуммаДокумента,
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаШапка.Операция,
		|	ВременнаяТаблицаШапка.СуммаДокумента * ВременнаяТаблицаШапка.Курс,
		|	0,
		|	0
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|ГДЕ
		|	ВременнаяТаблицаШапка.Операция.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППИ.ПереводНаДругойСчет)
		|	И ВременнаяТаблицаШапка.СуммаДокумента <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаПрочийРасход.СчетУчета,
		|	ВременнаяТаблицаШапка.БанковскийСчет.СчетУчета,
		|	ВременнаяТаблицаПрочийРасход.Субконто1,
		|	ВременнаяТаблицаПрочийРасход.Субконто2,
		|	ВременнаяТаблицаПрочийРасход.Субконто3,
		|	ВременнаяТаблицаШапка.БанковскийСчет,
		|	ВременнаяТаблицаПрочийРасход.СтатьяДвиженияДенежныхСредств,
		|	НЕОПРЕДЕЛЕНО,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаПрочийРасход.СчетУчета.Валютный
		|			ТОГДА ВременнаяТаблицаШапка.БанковскийСчет.ВалютаДенежныхСредств
		|		ИНАЧЕ &ВалютаРегламентированногоУчета
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.БанковскийСчет.СчетУчета.Валютный
		|			ТОГДА ВременнаяТаблицаШапка.БанковскийСчет.ВалютаДенежныхСредств
		|		ИНАЧЕ &ВалютаРегламентированногоУчета
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаПрочийРасход.СчетУчета.Валютный
		|			ТОГДА ВременнаяТаблицаПрочийРасход.СуммаПлатежа
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.БанковскийСчет.СчетУчета.Валютный
		|			ТОГДА ВременнаяТаблицаПрочийРасход.СуммаПлатежа
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаШапка.Операция,
		|	ВременнаяТаблицаПрочийРасход.СуммаПлатежа * ВременнаяТаблицаШапка.Курс,
		|	0,
		|	0
		|ИЗ
		|	ВременнаяТаблицаПрочийРасход КАК ВременнаяТаблицаПрочийРасход
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО ИСТИНА
		|ГДЕ
		|	ВременнаяТаблицаШапка.Операция.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППИ.ПрочийРасход)
		|	И ВременнаяТаблицаПрочийРасход.СуммаПлатежа <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НачисленнаяЗаработнаяПлата),
		|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ЗадолженностьПоДепонированнойЗаработнойПлате),
		|	ВедомостьНаВыплатуЗарплатыЗарплата.ФизЛицо,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	ВременнаяТаблицаШапка.БанковскийСчет,
		|	ВременнаяТаблицаЗП.СтатьяДвиженияДенежныхСредств,
		|	НЕОПРЕДЕЛЕНО,
		|	ВременнаяТаблицаШапка.БанковскийСчет.ВалютаДенежныхСредств,
		|	ВременнаяТаблицаШапка.БанковскийСчет.ВалютаДенежныхСредств,
		|	ЕСТЬNULL(ВедомостьНаВыплатуЗарплатыЗарплата.СуммаКВыплате, ВременнаяТаблицаЗП.СуммаПлатежа),
		|	ЕСТЬNULL(ВедомостьНаВыплатуЗарплатыЗарплата.СуммаКВыплате, ВременнаяТаблицаЗП.СуммаПлатежа),
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаШапка.Операция,
		|	ЕСТЬNULL(ВедомостьНаВыплатуЗарплатыЗарплата.СуммаКВыплате, ВременнаяТаблицаЗП.СуммаПлатежа) * ВременнаяТаблицаШапка.Курс,
		|	0,
		|	0
		|ИЗ
		|	ВременнаяТаблицаЗП КАК ВременнаяТаблицаЗП
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО ИСТИНА
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВедомостьЗП.Зарплата КАК ВедомостьНаВыплатуЗарплатыЗарплата
		|		ПО ВременнаяТаблицаЗП.ФизЛицо = ВедомостьНаВыплатуЗарплатыЗарплата.ФизЛицо
		|ГДЕ
		|	ВременнаяТаблицаШапка.Операция.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППИ.ВыплатаЗП)
		|	И ТИПЗНАЧЕНИЯ(ВременнаяТаблицаЗП.Ведомость) = ТИП(Документ.ВедомостьЗП)
		|	И ВременнаяТаблицаЗП.СуммаПлатежа <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НачисленнаяЗаработнаяПлата),
		|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ЗадолженностьПоДепонированнойЗаработнойПлате),
		|	ВыплатуЗарплатыЗарплата.ФизЛицо,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	ВременнаяТаблицаШапка.БанковскийСчет,
		|	ВременнаяТаблицаЗП.СтатьяДвиженияДенежныхСредств,
		|	НЕОПРЕДЕЛЕНО,
		|	ВременнаяТаблицаШапка.БанковскийСчет.ВалютаДенежныхСредств,
		|	ВременнаяТаблицаШапка.БанковскийСчет.ВалютаДенежныхСредств,
		|	ЕСТЬNULL(ВыплатуЗарплатыЗарплата.СуммаКВыплате, ВременнаяТаблицаЗП.СуммаПлатежа),
		|	ЕСТЬNULL(ВыплатуЗарплатыЗарплата.СуммаКВыплате, ВременнаяТаблицаЗП.СуммаПлатежа),
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаШапка.Операция,
		|	ЕСТЬNULL(ВыплатуЗарплатыЗарплата.СуммаКВыплате, ВременнаяТаблицаЗП.СуммаПлатежа) * ВременнаяТаблицаШапка.Курс,
		|	0,
		|	0
		|ИЗ
		|	ВременнаяТаблицаЗП КАК ВременнаяТаблицаЗП
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО ИСТИНА
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыплатаЗП.Зарплата КАК ВыплатуЗарплатыЗарплата
		|		ПО ВременнаяТаблицаЗП.ФизЛицо = ВыплатуЗарплатыЗарплата.ФизЛицо
		|ГДЕ
		|	ВременнаяТаблицаШапка.Операция.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППИ.ВыплатаЗП)
		|	И ТИПЗНАЧЕНИЯ(ВременнаяТаблицаЗП.Ведомость) = ТИП(Документ.ВыплатаЗП)
		|	И ВременнаяТаблицаЗП.СуммаПлатежа <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.СчетУчета,
		|	ВременнаяТаблицаШапка.БанковскийСчет.СчетУчета,
		|	ВременнаяТаблицаШапка.ФизЛицо,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	ВременнаяТаблицаШапка.БанковскийСчет,
		|	ВременнаяТаблицаПодотчет.СтатьяДвиженияДенежныхСредств,
		|	НЕОПРЕДЕЛЕНО,
		|	ВременнаяТаблицаШапка.БанковскийСчет.ВалютаДенежныхСредств,
		|	ВременнаяТаблицаШапка.БанковскийСчет.ВалютаДенежныхСредств,
		|	ВременнаяТаблицаПодотчет.СуммаПлатежа,
		|	ВременнаяТаблицаПодотчет.СуммаПлатежа,
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаШапка.Операция,
		|	ВременнаяТаблицаПодотчет.СуммаПлатежа * ВременнаяТаблицаШапка.Курс,
		|	0,
		|	0
		|ИЗ
		|	ВременнаяТаблицаПодотчет КАК ВременнаяТаблицаПодотчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО ИСТИНА
		|ГДЕ
		|	ВременнаяТаблицаШапка.Операция.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППИ.ВыдачаПодотчетнику)
		|	И ВременнаяТаблицаПодотчет.СуммаПлатежа <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.СчетКомиссииБанка,
		|	ВременнаяТаблицаШапка.БанковскийСчет.СчетУчета,
		|	ВременнаяТаблицаШапка.СтатьяЗатратКомиссияБанка,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	ВременнаяТаблицаШапка.БанковскийСчет,
		|	ВременнаяТаблицаШапка.СтатьяДвиженияДенежныхСредствДляКоммисииБанка,
		|	НЕОПРЕДЕЛЕНО,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.СчетКомиссииБанка.Валютный
		|			ТОГДА ВременнаяТаблицаШапка.БанковскийСчет.ВалютаДенежныхСредств
		|		ИНАЧЕ &ВалютаРегламентированногоУчета
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.БанковскийСчет.СчетУчета.Валютный
		|			ТОГДА ВременнаяТаблицаШапка.БанковскийСчет.ВалютаДенежныхСредств
		|		ИНАЧЕ &ВалютаРегламентированногоУчета
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.СчетКомиссииБанка.Валютный
		|			ТОГДА ВременнаяТаблицаШапка.КомиссияБанка
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.БанковскийСчет.СчетУчета.Валютный
		|			ТОГДА ВременнаяТаблицаШапка.КомиссияБанка
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	""Комиссия банка"",
		|	ВременнаяТаблицаШапка.КомиссияБанка * ВременнаяТаблицаШапка.Курс,
		|	0,
		|	0
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|ГДЕ
		|	ВременнаяТаблицаШапка.СниматьКомиссиюБанкаСЭтогоЖеСчета
		|	И ВременнаяТаблицаШапка.КомиссияБанка <> 0";
		
	//Операционная курсовая разница
	ТекстОКР = "";
	Если НЕ Константы.НеСчитатьОперационныеКурсовыеРазницы.Получить() Тогда	
		Если ДокументСсылка.ВалютаДенежныхСредств <> ВалютаРегламентированногоУчета И ДокументСсылка.ВалютаДоговора <> ВалютаРегламентированногоУчета Тогда
			ТекстОКР =
			"ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА (ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов - ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВЫБОР
			|				КОГДА ВременнаяТаблицаШапка.КурсДоговора > ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов
			|					ТОГДА ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.КурсДоговора
			|				ИНАЧЕ ВременнаяТаблицаШапка.КурсДоговора / ВременнаяТаблицаШапка.Курс
			|			КОНЕЦ) * ВременнаяТаблицаШапка.Курс > 0
			|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УбыткиОтКурсовыхРазницПоОперациямВИностраннойВалюте)
			|		ИНАЧЕ ВременнаяТаблицаШапка.БанковскийСчет.СчетУчета
			|	КОНЕЦ КАК СчетДт,
			|	ВЫБОР
			|		КОГДА (ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов - ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВЫБОР
			|				КОГДА ВременнаяТаблицаШапка.КурсДоговора > ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов
			|					ТОГДА ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.КурсДоговора
			|				ИНАЧЕ ВременнаяТаблицаШапка.КурсДоговора / ВременнаяТаблицаШапка.Курс
			|			КОНЕЦ) * ВременнаяТаблицаШапка.Курс > 0
			|			ТОГДА ВременнаяТаблицаШапка.БанковскийСчет.СчетУчета
			|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходОтКурсовыхРазницПоОперациямВИностраннойВалюте)
			|	КОНЕЦ КАК СчетКт,
			|	ВЫБОР
			|		КОГДА (ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов - ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВЫБОР
			|				КОГДА ВременнаяТаблицаШапка.КурсДоговора > ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов
			|					ТОГДА ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.КурсДоговора
			|				ИНАЧЕ ВременнаяТаблицаШапка.КурсДоговора / ВременнаяТаблицаШапка.Курс
			|			КОНЕЦ) * ВременнаяТаблицаШапка.Курс > 0
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.КурсовыеРазницы)
			|		ИНАЧЕ ВременнаяТаблицаШапка.Контрагент
			|	КОНЕЦ КАК СубконтоДт1,
			|	ВЫБОР
			|		КОГДА (ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов - ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВЫБОР
			|				КОГДА ВременнаяТаблицаШапка.КурсДоговора > ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов
			|					ТОГДА ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.КурсДоговора
			|				ИНАЧЕ ВременнаяТаблицаШапка.КурсДоговора / ВременнаяТаблицаШапка.Курс
			|			КОНЕЦ) * ВременнаяТаблицаШапка.Курс > 0
			|			ТОГДА НЕОПРЕДЕЛЕНО
			|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.ДоговорКонтрагента
			|	КОНЕЦ КАК СубконтоДт2,
			|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
			|	ВЫБОР
			|		КОГДА (ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов - ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВЫБОР
			|				КОГДА ВременнаяТаблицаШапка.КурсДоговора > ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов
			|					ТОГДА ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.КурсДоговора
			|				ИНАЧЕ ВременнаяТаблицаШапка.КурсДоговора / ВременнаяТаблицаШапка.Курс
			|			КОНЕЦ) * ВременнаяТаблицаШапка.Курс > 0
			|			ТОГДА ВременнаяТаблицаШапка.Контрагент
			|		ИНАЧЕ НЕОПРЕДЕЛЕНО
			|	КОНЕЦ КАК СубконтоКт1,
			|	ВЫБОР
			|		КОГДА (ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов - ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВЫБОР
			|				КОГДА ВременнаяТаблицаШапка.КурсДоговора > ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов
			|					ТОГДА ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.КурсДоговора
			|				ИНАЧЕ ВременнаяТаблицаШапка.КурсДоговора / ВременнаяТаблицаШапка.Курс
			|			КОНЕЦ) * ВременнаяТаблицаШапка.Курс > 0
			|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.ДоговорКонтрагента
			|		ИНАЧЕ НЕОПРЕДЕЛЕНО
			|	КОНЕЦ КАК СубконтоКт2,
			|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
			|	ВЫБОР
			|		КОГДА (ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов - ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВЫБОР
			|				КОГДА ВременнаяТаблицаШапка.КурсДоговора > ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов
			|					ТОГДА ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.КурсДоговора
			|				ИНАЧЕ ВременнаяТаблицаШапка.КурсДоговора / ВременнаяТаблицаШапка.Курс
			|			КОНЕЦ) * ВременнаяТаблицаШапка.Курс > 0
			|			ТОГДА &ВалютаРегламентированногоУчета
			|		ИНАЧЕ ВременнаяТаблицаШапка.БанковскийСчет.ВалютаДенежныхСредств
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА (ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов - ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВЫБОР
			|				КОГДА ВременнаяТаблицаШапка.КурсДоговора > ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов
			|					ТОГДА ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.КурсДоговора
			|				ИНАЧЕ ВременнаяТаблицаШапка.КурсДоговора / ВременнаяТаблицаШапка.Курс
			|			КОНЕЦ) * ВременнаяТаблицаШапка.Курс > 0
			|			ТОГДА ВременнаяТаблицаШапка.БанковскийСчет.ВалютаДенежныхСредств
			|		ИНАЧЕ &ВалютаРегламентированногоУчета
			|	КОНЕЦ,
			|	0,
			|	0,
			//|	ВЫБОР
			//|		КОГДА (ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов - ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВЫБОР
			//|				КОГДА ВременнаяТаблицаШапка.КурсДоговора > ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов
			//|					ТОГДА ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.КурсДоговора
			//|				ИНАЧЕ ВременнаяТаблицаШапка.КурсДоговора / ВременнаяТаблицаШапка.Курс
			//|			КОНЕЦ) * ВременнаяТаблицаШапка.Курс > 0
			//|			ТОГДА 0
			//|		ИНАЧЕ 
			//|			ВЫБОР
			//|				КОГДА ВременнаяТаблицаРасшифровкаПлатежа.СчетУчета.Валютный
			//|					ТОГДА 
			//|						ВЫБОР
			//|							КОГДА ВременнаяТаблицаШапка.Курс >= ВременнаяТаблицаШапка.КурсДоговора
			//|								ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов
			//|							ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа / ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов
			//|						КОНЕЦ
			//|				ИНАЧЕ 0
			//|			КОНЕЦ
			//|	КОНЕЦ КАК ВалютнаяСуммаДт,
			//|	ВЫБОР
			//|		КОГДА (ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов - ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВЫБОР
			//|				КОГДА ВременнаяТаблицаШапка.КурсДоговора > ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов
			//|					ТОГДА ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.КурсДоговора
			//|				ИНАЧЕ ВременнаяТаблицаШапка.КурсДоговора / ВременнаяТаблицаШапка.Курс
			//|			КОНЕЦ) * ВременнаяТаблицаШапка.Курс > 0
			//|			ТОГДА 
			//|				ВЫБОР
			//|					КОГДА ВременнаяТаблицаРасшифровкаПлатежа.СчетУчета.Валютный
			//|						ТОГДА 
			//|							ВЫБОР
			//|								КОГДА ВременнаяТаблицаШапка.Курс >= ВременнаяТаблицаШапка.КурсДоговора
			//|									ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов
			//|							ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа / ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов
			//|						КОНЕЦ
			//|					ИНАЧЕ 0
			//|				КОНЕЦ
			//|		ИНАЧЕ 0
			//|	КОНЕЦ КАК ВалютнаяСуммаКт,
			|	ВременнаяТаблицаШапка.Дата,
			|	ВременнаяТаблицаШапка.Организация,
			|	ВременнаяТаблицаШапка.СодержаниеОКР КАК Содержание,
			|	ВЫБОР
			|		КОГДА (ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов - ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВЫБОР
			|				КОГДА ВременнаяТаблицаШапка.КурсДоговора > ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов
			|					ТОГДА ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.КурсДоговора
			|				ИНАЧЕ ВременнаяТаблицаШапка.КурсДоговора / ВременнаяТаблицаШапка.Курс
			|			КОНЕЦ) * ВременнаяТаблицаШапка.Курс > 0
			|			ТОГДА (ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов - ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВЫБОР
			|				КОГДА ВременнаяТаблицаШапка.КурсДоговора > ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов
			|					ТОГДА ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.КурсДоговора
			|				ИНАЧЕ ВременнаяТаблицаШапка.КурсДоговора / ВременнаяТаблицаШапка.Курс
			|			КОНЕЦ) * ВременнаяТаблицаШапка.Курс
			|		ИНАЧЕ -((ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов - ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВЫБОР
			|				КОГДА ВременнаяТаблицаШапка.КурсДоговора > ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов
			|					ТОГДА ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.КурсДоговора
			|				ИНАЧЕ ВременнаяТаблицаШапка.КурсДоговора / ВременнаяТаблицаШапка.Курс
			|			КОНЕЦ) * ВременнаяТаблицаШапка.Курс)
			|	КОНЕЦ КАК Сумма,
			|	0 КАК КоличествоДт,
			|	0 КАК КоличествоКт
			|ИЗ
			|	ВременнаяТаблицаРасшифровкаПлатежа КАК ВременнаяТаблицаРасшифровкаПлатежа
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
			|		ПО ИСТИНА
			|ГДЕ
			|	НЕ (ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов - ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВЫБОР
			|				КОГДА ВременнаяТаблицаШапка.КурсДоговора > ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов
			|					ТОГДА ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.КурсДоговора
			|				ИНАЧЕ ВременнаяТаблицаШапка.КурсДоговора / ВременнаяТаблицаШапка.Курс
			|			КОНЕЦ) * ВременнаяТаблицаШапка.Курс = 0
			|	И НЕ ВременнаяТаблицаШапка.ВалютаДоговора = ВременнаяТаблицаШапка.БанковскийСчет.ВалютаДенежныхСредств
			|	И НЕ ВременнаяТаблицаШапка.КурсДоговора = ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов";
			
		Иначе
			ТекстОКР =
			"ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаШапка.Курс - ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов * ВременнаяТаблицаШапка.КурсДоговора > 0
			|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УбыткиОтКурсовыхРазницПоОперациямВИностраннойВалюте)
			|		ИНАЧЕ ВременнаяТаблицаШапка.БанковскийСчет.СчетУчета
			|	КОНЕЦ КАК СчетДт,
			|	ВЫБОР
			|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаШапка.Курс - ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов * ВременнаяТаблицаШапка.КурсДоговора > 0
			|			ТОГДА ВременнаяТаблицаШапка.БанковскийСчет.СчетУчета
			|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходОтКурсовыхРазницПоОперациямВИностраннойВалюте)
			|	КОНЕЦ КАК СчетКт,
			|	ВЫБОР
			|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаШапка.Курс - ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов * ВременнаяТаблицаШапка.КурсДоговора > 0
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.КурсовыеРазницы)
			|		ИНАЧЕ ВременнаяТаблицаШапка.Контрагент
			|	КОНЕЦ КАК СубконтоДт1,
			|	ВЫБОР
			|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаШапка.Курс - ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов * ВременнаяТаблицаШапка.КурсДоговора > 0
			|			ТОГДА НЕОПРЕДЕЛЕНО
			|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.ДоговорКонтрагента
			|	КОНЕЦ КАК СубконтоДт2,
			|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
			|	ВЫБОР
			|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаШапка.Курс - ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов * ВременнаяТаблицаШапка.КурсДоговора > 0
			|			ТОГДА ВременнаяТаблицаШапка.Контрагент
			|		ИНАЧЕ НЕОПРЕДЕЛЕНО
			|	КОНЕЦ КАК СубконтоКт1,
			|	ВЫБОР
			|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаШапка.Курс - ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов * ВременнаяТаблицаШапка.КурсДоговора > 0
			|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.ДоговорКонтрагента
			|		ИНАЧЕ НЕОПРЕДЕЛЕНО
			|	КОНЕЦ КАК СубконтоКт2,
			|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
			|	ВЫБОР
			|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаШапка.Курс - ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов * ВременнаяТаблицаШапка.КурсДоговора > 0
			|			ТОГДА &ВалютаРегламентированногоУчета
			|		ИНАЧЕ ВременнаяТаблицаШапка.БанковскийСчет.ВалютаДенежныхСредств
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаШапка.Курс - ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов * ВременнаяТаблицаШапка.КурсДоговора > 0
			|			ТОГДА ВременнаяТаблицаШапка.БанковскийСчет.ВалютаДенежныхСредств
			|		ИНАЧЕ &ВалютаРегламентированногоУчета
			|	КОНЕЦ,
			|	0,
			|	0,
			//|	ВЫБОР
			//|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаШапка.Курс - ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов * ВременнаяТаблицаШапка.КурсДоговора > 0
			//|			ТОГДА 0
			//|		ИНАЧЕ 
			//|			ВЫБОР
			//|				КОГДА ВременнаяТаблицаРасшифровкаПлатежа.СчетУчета.Валютный
			//|					ТОГДА 
			//|						ВЫБОР
			//|							КОГДА ВременнаяТаблицаШапка.Курс >= ВременнаяТаблицаШапка.КурсДоговора
			//|								ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов
			//|							ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа / ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов
			//|						КОНЕЦ
			//|				ИНАЧЕ 0
			//|			КОНЕЦ
			//|	КОНЕЦ КАК ВалютнаяСуммаДт,
			//|	ВЫБОР
			//|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаШапка.Курс - ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов * ВременнаяТаблицаШапка.КурсДоговора > 0
			//|			ТОГДА 
			//|				ВЫБОР
			//|					КОГДА ВременнаяТаблицаРасшифровкаПлатежа.СчетУчета.Валютный
			//|						ТОГДА 
			//|							ВЫБОР
			//|								КОГДА ВременнаяТаблицаШапка.Курс >= ВременнаяТаблицаШапка.КурсДоговора
			//|									ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов
			//|								ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа / ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов
			//|							КОНЕЦ
			//|					ИНАЧЕ 0
			//|				КОНЕЦ
			//|		ИНАЧЕ 0
			//|	КОНЕЦ КАК ВалютнаяСуммаКт,
			|	ВременнаяТаблицаШапка.Дата,
			|	ВременнаяТаблицаШапка.Организация,
			|	ВременнаяТаблицаШапка.СодержаниеОКР КАК Содержание,
			|	ВЫБОР
			|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаШапка.Курс - ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов * ВременнаяТаблицаШапка.КурсДоговора > 0
			|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаШапка.Курс - ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов * ВременнаяТаблицаШапка.КурсДоговора
			|		ИНАЧЕ -(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаШапка.Курс - ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов * ВременнаяТаблицаШапка.КурсДоговора)
			|	КОНЕЦ КАК Сумма,
			|	0 КАК КоличествоДт,
			|	0 КАК КоличествоКт
			|ИЗ
			|	ВременнаяТаблицаРасшифровкаПлатежа КАК ВременнаяТаблицаРасшифровкаПлатежа
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
			|		ПО ИСТИНА
			|ГДЕ
			|	НЕ ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаШапка.Курс - ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов * ВременнаяТаблицаШапка.КурсДоговора = 0
			|	И НЕ ВременнаяТаблицаШапка.ВалютаДоговора = ВременнаяТаблицаШапка.БанковскийСчет.ВалютаДенежныхСредств
			|	И НЕ ВременнаяТаблицаШапка.КурсДоговора = ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов";
			
		КонецЕсли;
		ТекстОКР = 
		"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|"
		+ ТекстОКР;	
	КонецЕсли;
		
	Запрос.Текст = Запрос.Текст + ТекстОКР;	
		
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);	
	
	РезультатЗапроса = Запрос.Выполнить();	
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаХозрасчетный", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаДенежныеСредства()

// Формирует таблицу значений, содержащую данные для проведения по регистру накопления ДвиженияДенежныхСредств.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДДС(СтруктураДополнительныеСвойства)
	ВалютаРегламентированногоУчета = СтруктураДополнительныеСвойства.ДляПроведения.ВалютаРегламентированногоУчета;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =	
		"ВЫБРАТЬ
		|	ВременнаяТаблицаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств КАК Статья,
		|	-ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаШапка.Курс КАК Сумма,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаШапка.Дата КАК Период
		|ИЗ
		|	ВременнаяТаблицаРасшифровкаПлатежа КАК ВременнаяТаблицаРасшифровкаПлатежа
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО ИСТИНА
		|ГДЕ
		|	НЕ ВременнаяТаблицаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
		|	И (ВременнаяТаблицаШапка.Операция.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППИ.ОплатаПоставщику)
		|			ИЛИ ВременнаяТаблицаШапка.Операция.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППИ.ВозвратПокупателю)
		|			ИЛИ ВременнаяТаблицаШапка.Операция.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППИ.РасчетыПоЗаймам))
		|	И ВЫБОР
		|			КОГДА ВременнаяТаблицаШапка.ВалютаДоговора = &ВалютаРегламентированногоУчета
		|				ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа
		|			ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов * ВременнаяТаблицаШапка.Курс
		|		КОНЕЦ <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаНалоги.СтатьяДвиженияДенежныхСредств,
		|	ВременнаяТаблицаНалоги.СуммаПлатежа,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаШапка.Дата
		|ИЗ
		|	ВременнаяТаблицаНалоги КАК ВременнаяТаблицаНалоги
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО ИСТИНА
		|ГДЕ
		| 	НЕ ВременнаяТаблицаНалоги.СтатьяДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
		|	И ВременнаяТаблицаШапка.Операция.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППИ.ОплатаНалогов)
		|	И ВременнаяТаблицаНалоги.СуммаПлатежа <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаПрочийРасход.СтатьяДвиженияДенежныхСредств,
		|	ВременнаяТаблицаПрочийРасход.СуммаПлатежа,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаШапка.Дата
		|ИЗ
		|	ВременнаяТаблицаПрочийРасход КАК ВременнаяТаблицаПрочийРасход
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО ИСТИНА
		|ГДЕ
		| 	НЕ ВременнаяТаблицаПрочийРасход.СтатьяДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
		|	И ВременнаяТаблицаШапка.Операция.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППИ.ПрочийРасход)
		|	И ВременнаяТаблицаПрочийРасход.СуммаПлатежа <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаЗП.СтатьяДвиженияДенежныхСредств,
		|	ВременнаяТаблицаЗП.СуммаПлатежа,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаШапка.Дата
		|ИЗ
		|	ВременнаяТаблицаЗП КАК ВременнаяТаблицаЗП
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО ИСТИНА
		|ГДЕ
		| 	НЕ ВременнаяТаблицаЗП.СтатьяДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
		|	И ВременнаяТаблицаШапка.Операция.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППИ.ВыплатаЗП)
		|	И ВременнаяТаблицаЗП.СуммаПлатежа <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаПодотчет.СтатьяДвиженияДенежныхСредств,
		|	ВременнаяТаблицаПодотчет.СуммаПлатежа,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаШапка.Дата
		|ИЗ
		|	ВременнаяТаблицаПодотчет КАК ВременнаяТаблицаПодотчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО ИСТИНА
		|ГДЕ
		| 	НЕ ВременнаяТаблицаПодотчет.СтатьяДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
		|	И ВременнаяТаблицаШапка.Операция.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППИ.ВыдачаПодотчетнику)
		|	И ВременнаяТаблицаПодотчет.СуммаПлатежа <> 0";
		
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	РезультатЗапроса = Запрос.Выполнить();	
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДДС", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаВыплаченнаяЗарплата(ДокументСсылка, СтруктураДополнительныеСвойства)
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =		     
		"ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаЗП.ФизЛицо,
		|	ВременнаяТаблицаШапка.ДокументОснование КАК Ведомость,
		|   ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ДокументОснование Ссылка Документ.ВедомостьЗП
		|			ТОГДА ВЫРАЗИТЬ(ВременнаяТаблицаШапка.ДокументОснование КАК Документ.ВедомостьЗП).ПериодРегистрации
		|       ИНАЧЕ ВЫРАЗИТЬ(ВременнаяТаблицаШапка.ДокументОснование КАК Документ.ВыплатаЗП).ПериодРегистрации
		|   КОНЕЦ  КАК ПериодРегистрации,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыВыплатыЗарплаты.ЧерезБанк) КАК ВидВыплаты,
		|	ВременнаяТаблицаЗП.СуммаПлатежа КАК Сумма
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаЗП КАК ВременнаяТаблицаЗП
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВременнаяТаблицаШапка.Операция.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППИ.ВыплатаЗП)";
		
	РезультатЗапроса = Запрос.Выполнить();
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВыплаченнаяЗарплата", РезультатЗапроса.Выгрузить());
КонецПроцедуры // СформироватьТаблицаВыплаченнаяЗарплата()

// Формирует таблицу значений, содержащую данные для проведения по регистру накопления ДанныеРеестраГТД.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДанныеРеестраГТД(ДокументСсылка,СтруктураДополнительныеСвойства)
	
	ВалютаРегламентированногоУчета = СтруктураДополнительныеСвойства.ДляПроведения.ВалютаРегламентированногоУчета;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	ВременнаяТаблицаРасшифровкаПлатежа.ДокументРасчетов КАК Документ,
		|	ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаШапка.Курс КАК Сумма
		|ИЗ
		|	ВременнаяТаблицаРасшифровкаПлатежа КАК ВременнаяТаблицаРасшифровкаПлатежа
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО ИСТИНА
		|ГДЕ
		|	(ВременнаяТаблицаШапка.Операция.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППИ.ОплатаПоставщику)
		|				И (ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.ДокументРасчетов КАК Документ.ГТДПоИмпорту) ССЫЛКА Документ.ГТДПоИмпорту
		|					И НЕ (ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.ДокументРасчетов КАК Документ.ГТДПоИмпорту)) = ЗНАЧЕНИЕ(Документ.ГТДПоИмпорту.ПустаяСсылка))
		|			ИЛИ ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.ДокументРасчетов КАК Документ.ПоступлениеТоваровУслуг) ССЫЛКА Документ.ПоступлениеТоваровУслуг
		|				И НЕ (ВЫРАЗИТЬ(ВременнаяТаблицаРасшифровкаПлатежа.ДокументРасчетов КАК Документ.ПоступлениеТоваровУслуг)) = ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровУслуг.ПустаяСсылка))
		|	И ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа <> 0";
	
		
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	
	РезультатЗапроса = Запрос.Выполнить();	
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДанныеРеестраГТД", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру "АвансыПодотчетника".
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаАвансыПодотчетника(ДокументСсылка,СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.Ссылка КАК Документ,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	ВременнаяТаблицаШапка.ФизЛицо КАК ФизЛицо,
		|	ВременнаяТаблицаШапка.ВалютаДенежныхСредств КАК Валюта,
		|	ВременнаяТаблицаШапка.СуммаДокумента КАК Сумма
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|ГДЕ
		|	ВременнаяТаблицаШапка.Операция = ЗНАЧЕНИЕ(Справочник.ОперацииППИ.ПеречислениеДенежныхСредствПодотчетнику)";	
	РезультатЗапроса = Запрос.Выполнить();	
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаАвансыПодотчетника", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПлатежноеПоручениеИсходящее.Ссылка,
		|	ПлатежноеПоручениеИсходящее.Номер,
		|	ПлатежноеПоручениеИсходящее.Дата,
		|	ПлатежноеПоручениеИсходящее.Проведен,
		|	ПлатежноеПоручениеИсходящее.Организация,
		|	ПлатежноеПоручениеИсходящее.Операция,
		|	ПлатежноеПоручениеИсходящее.БанковскийСчет,
		|	ПлатежноеПоручениеИсходящее.СтатьяДвиженияДенежныхСредств,
		|	ПлатежноеПоручениеИсходящее.Контрагент,
		|	ПлатежноеПоручениеИсходящее.БанковскийСчетПолучателя,
		|	ПлатежноеПоручениеИсходящее.ФизЛицо,
		|	ПлатежноеПоручениеИсходящее.СчетУчета,
		|	ПлатежноеПоручениеИсходящее.СуммаДокумента,
		|	ПлатежноеПоручениеИсходящее.ДокументОснование,
		|	ПлатежноеПоручениеИсходящее.ВалютаДенежныхСредств,
		|	ПлатежноеПоручениеИсходящее.Курс,
		|	ПлатежноеПоручениеИсходящее.БанкПосредник,
		|	ПлатежноеПоручениеИсходящее.КомиссияБанка,
		|	ПлатежноеПоручениеИсходящее.СчетКомиссииБанка,
		|	ПлатежноеПоручениеИсходящее.СниматьКомиссиюБанкаСЭтогоЖеСчета,
		|	ПлатежноеПоручениеИсходящее.СтатьяЗатратКомиссияБанка,
		|	ПлатежноеПоручениеИсходящее.СтатьяДвиженияДенежныхСредствДляКоммисииБанка,
		|	ПлатежноеПоручениеИсходящее.НалоговыйПериод,
		|	ПлатежноеПоручениеИсходящее.СчетБанкаПосредника,
		|	ПлатежноеПоручениеИсходящее.ПечатьВРамке,
		|	ПлатежноеПоручениеИсходящее.ВтораяПодписьНеПредусмотрена,
		|	ПлатежноеПоручениеИсходящее.КодНазначенияПлатежа,
		|	ПлатежноеПоручениеИсходящее.НазначениеПлатежа,
		|	ПлатежноеПоручениеИсходящее.КартСчет,
		|	&СодержаниеОКР КАК СодержаниеОКР,
		|	ПлатежноеПоручениеИсходящее.ВалютаДоговора,
		|	ПлатежноеПоручениеИсходящее.КурсДоговора
		|ПОМЕСТИТЬ ВременнаяТаблицаШапка
		|ИЗ
		|	Документ.ПлатежноеПоручениеИсходящее КАК ПлатежноеПоручениеИсходящее
		|ГДЕ
		|	ПлатежноеПоручениеИсходящее.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.ДоговорКонтрагента,
		|	ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств,
		|	ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.СчетУчета,
		|	ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.СуммаПлатежа,
		|	ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.КурсВзаиморасчетов,
		|	ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.Комментарий,
		|	ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.СуммаВзаиморасчетов,
		|	ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.ДокументРасчетов
		|ПОМЕСТИТЬ ВременнаяТаблицаРасшифровкаПлатежа
		|ИЗ
		|	Документ.ПлатежноеПоручениеИсходящее.РасшифровкаПлатежа КАК ПлатежноеПоручениеИсходящееРасшифровкаПлатежа
		|ГДЕ
		|	ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПлатежноеПоручениеИсходящееНалоги.СчетУчета,
		|	ПлатежноеПоручениеИсходящееНалоги.СуммаПлатежа,
		|	ПлатежноеПоручениеИсходящееНалоги.СтатьяДвиженияДенежныхСредств
		|ПОМЕСТИТЬ ВременнаяТаблицаНалоги
		|ИЗ
		|	Документ.ПлатежноеПоручениеИсходящее.Налоги КАК ПлатежноеПоручениеИсходящееНалоги
		|ГДЕ
		|	ПлатежноеПоручениеИсходящееНалоги.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПлатежноеПоручениеИсходящееПрочиеРасходы.СчетУчета,
		|	ПлатежноеПоручениеИсходящееПрочиеРасходы.СтатьяДвиженияДенежныхСредств,
		|	ПлатежноеПоручениеИсходящееПрочиеРасходы.СуммаПлатежа,
		|	ПлатежноеПоручениеИсходящееПрочиеРасходы.Субконто1,
		|	ПлатежноеПоручениеИсходящееПрочиеРасходы.Субконто2,
		|	ПлатежноеПоручениеИсходящееПрочиеРасходы.Субконто3
		|ПОМЕСТИТЬ ВременнаяТаблицаПрочийРасход
		|ИЗ
		|	Документ.ПлатежноеПоручениеИсходящее.ПрочиеРасходы КАК ПлатежноеПоручениеИсходящееПрочиеРасходы
		|ГДЕ
		|	ПлатежноеПоручениеИсходящееПрочиеРасходы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПлатежноеПоручениеИсходящееВыплатаЗаработнойПлаты.ФизЛицо,
		|	ПлатежноеПоручениеИсходящееВыплатаЗаработнойПлаты.Ведомость,
		|	ПлатежноеПоручениеИсходящееВыплатаЗаработнойПлаты.СуммаПлатежа,
		|	ПлатежноеПоручениеИсходящееВыплатаЗаработнойПлаты.СтатьяДвиженияДенежныхСредств
		|ПОМЕСТИТЬ ВременнаяТаблицаЗП
		|ИЗ
		|	Документ.ПлатежноеПоручениеИсходящее.ВыплатаЗаработнойПлаты КАК ПлатежноеПоручениеИсходящееВыплатаЗаработнойПлаты
		|ГДЕ
		|	ПлатежноеПоручениеИсходящееВыплатаЗаработнойПлаты.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПлатежноеПоручениеИсходящееВыдачаВПодотчет.СтатьяДвиженияДенежныхСредств,
		|	ПлатежноеПоручениеИсходящееВыдачаВПодотчет.СуммаПлатежа
		|ПОМЕСТИТЬ ВременнаяТаблицаПодотчет
		|ИЗ
		|	Документ.ПлатежноеПоручениеИсходящее.ВыдачаВПодотчет КАК ПлатежноеПоручениеИсходящееВыдачаВПодотчет
		|ГДЕ
		|	ПлатежноеПоручениеИсходящееВыдачаВПодотчет.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", 		ДокументСсылка);
	Запрос.УстановитьПараметр("СодержаниеОКР", 	?(ДокументСсылка.РасшифровкаПлатежа.Количество() > 0, "ОКР. Курс НБКР = " + ДокументСсылка.Курс, ""));	
	Запрос.Выполнить();
	
	СформироватьТаблицаХозрасчетный(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДДС(СтруктураДополнительныеСвойства);
	СформироватьТаблицаВыплаченнаяЗарплата(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДанныеРеестраГТД(ДокументСсылка,СтруктураДополнительныеСвойства);
	СформироватьТаблицаАвансыПодотчетника(ДокументСсылка, СтруктураДополнительныеСвойства);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

#КонецОбласти

#Область ВерсионированиеОбъектов

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область ИнтерфейсПечати

// Формирует и возвращает текст запроса для выборки данных,
// необходимых для формирования печатной формы
//
Функция ПолучитьТекстЗапросаДляФормированияПечатнойФормыППИ()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ПлатежноеПоручениеИсходящее.Ссылка,
	|	ПлатежноеПоручениеИсходящее.Номер,
	|	ПлатежноеПоручениеИсходящее.Дата,
	|	ПлатежноеПоручениеИсходящее.Операция,
	|	ПлатежноеПоручениеИсходящее.Организация,
	|	ПлатежноеПоручениеИсходящее.БанковскийСчет КАК БанковскийСчет,
	|	ПлатежноеПоручениеИсходящее.БанковскийСчетПолучателя КАК БанковскийСчетПолучателя,
	|	ПлатежноеПоручениеИсходящее.СуммаДокумента,
	|	ПлатежноеПоручениеИсходящее.Контрагент,
	|	ПлатежноеПоручениеИсходящее.КодНазначенияПлатежа,
	|	ПлатежноеПоручениеИсходящее.ВтораяПодписьНеПредусмотрена,
	|	ПлатежноеПоручениеИсходящее.ПечатьВРамке,
	|	ПлатежноеПоручениеИсходящее.БанкПосредник,
	|	ПлатежноеПоручениеИсходящее.СчетБанкаПосредника,
	|	ПлатежноеПоручениеИсходящее.Автор,
	|	ПлатежноеПоручениеИсходящее.НазначениеПлатежа,
	|	ПлатежноеПоручениеИсходящее.ДокументОснование,
	|	ПлатежноеПоручениеИсходящее.СниматьКомиссиюБанкаСЭтогоЖеСчета,
	|	ПлатежноеПоручениеИсходящее.БанковскийСчет.ВалютаДенежныхСредств,
	|	ПлатежноеПоручениеИсходящее.Организация.КодПоОКПО КАК КодОКПОПлательщика,
	|	ПлатежноеПоручениеИсходящее.БанковскийСчет.Банк.Код КАК БИКБанкаПлательщика,
	|	ПлатежноеПоручениеИсходящее.БанковскийСчет.Банк КАК БанкПлательщика,
	|	ПлатежноеПоручениеИсходящее.БанковскийСчетПолучателя.Банк.Код КАК БИКБанкаПолучателя,
	|	ПлатежноеПоручениеИсходящее.БанковскийСчетПолучателя.Банк КАК БанкПолучателя,
	|	ПлатежноеПоручениеИсходящее.БанковскийСчет.НомерСчета,
	|	ПлатежноеПоручениеИсходящее.БанковскийСчетПолучателя.НомерСчета,
	|	ПлатежноеПоручениеИсходящее.БанковскийСчет.ВалютаДенежныхСредств КАК ВалютаДокумента,
	|	ПлатежноеПоручениеИсходящее.Организация.ИНН КАК ИННОрганизации,
	|	ПлатежноеПоручениеИсходящее.Контрагент.ИНН КАК ИННПолучателя,
	|	ПлатежноеПоручениеИсходящее.БанковскийСчетПолучателя.Банк.Адрес КАК АдресБанкаПолучателя,
	|	ПлатежноеПоручениеИсходящее.БанковскийСчет.Банк.Адрес КАК АдресБанкаПлательщика,
	|	ПлатежноеПоручениеИсходящее.Организация.НаименованиеПолное,
	|	ПлатежноеПоручениеИсходящее.Контрагент.НаименованиеПолное,
	|	ПлатежноеПоручениеИсходящее.ПечатьНаОдномЛистеДваЭкземпляра,
	|	ПлатежноеПоручениеИсходящее.Организация.РегНомерСоцФонда КАК РегистрНомерСФ,
	|	НЕОПРЕДЕЛЕНО КАК ПредставлениеПодразделения,
	|	ПлатежноеПоручениеИсходящее.КартСчет,
	|	ПлатежноеПоручениеИсходящее.БанковскийСчет.РазделительДляПечатиСумм КАК РазделительДляПечатиСумм,
	|	ПлатежноеПоручениеИсходящее.ПрочиеРасходы.(
	|		Ссылка,
	|		НомерСтроки,
	|		СчетУчета,
	|		СтатьяДвиженияДенежныхСредств,
	|		СуммаПлатежа,
	|		Субконто1,
	|		Субконто2,
	|		Субконто3
	|	),
	|	ПлатежноеПоручениеИсходящее.ПолучательПФ.НаименованиеПолное КАК ПолучательПФНаименованиеПолное,
	|	ПлатежноеПоручениеИсходящее.ПолучательПФ.ИНН
	|ИЗ
	|	Документ.ПлатежноеПоручениеИсходящее КАК ПлатежноеПоручениеИсходящее
	|ГДЕ
	|	ПлатежноеПоручениеИсходящее.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПлатежноеПоручениеИсходящееВыплатаЗаработнойПлаты.Ссылка,
	|	ПлатежноеПоручениеИсходящееВыплатаЗаработнойПлаты.НомерСтроки,
	|	ПлатежноеПоручениеИсходящееВыплатаЗаработнойПлаты.ФизЛицо,
	|	ПлатежноеПоручениеИсходящееВыплатаЗаработнойПлаты.ФизЛицо.ИНН КАК ИННФизЛица,
	|	ПлатежноеПоручениеИсходящееВыплатаЗаработнойПлаты.Ведомость,
	|	ПлатежноеПоручениеИсходящееВыплатаЗаработнойПлаты.СуммаПлатежа,
	|	ПлатежноеПоручениеИсходящееВыплатаЗаработнойПлаты.СтатьяДвиженияДенежныхСредств
	|ИЗ
	|	Документ.ПлатежноеПоручениеИсходящее.ВыплатаЗаработнойПлаты КАК ПлатежноеПоручениеИсходящееВыплатаЗаработнойПлаты
	|ГДЕ
	|	ПлатежноеПоручениеИсходящееВыплатаЗаработнойПлаты.Ссылка В(&МассивОбъектов)";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Функция формирует табличный документ с печатной формой ПКО
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьППИ(МассивОбъектов, ОбъектыПечати)
	Перем ПодразделениеОтветственныхЛиц;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = ПолучитьТекстЗапросаДляФормированияПечатнойФормыППИ();
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Шапка 		= РезультатЗапроса[0].Выбрать();
	ВременнаяТаблицаЗП 	= РезультатЗапроса[1].Выгрузить();
	
	ПервыйДокумент = Истина;
	Пока Шапка.Следующий()  Цикл
		Если Шапка.ПечатьНаОдномЛистеДваЭкземпляра Тогда
			КоличествоЭкземплярНаСтранице = 2;
		Иначе
			КоличествоЭкземплярНаСтранице = 1;
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;

		
		Для Сч = 1 По КоличествоЭкземплярНаСтранице Цикл
			
			
			Если Шапка.ПечатьВРамке Тогда
				ИмяМакета = "ПлатежноеПоручениеВРамке";
				ТабличныйДокумент.КлючПараметровПечати = "ПлатежноеПоручениеИсходящее_ПлатежноеПоручениеВРамке";
			Иначе	
			    ИмяМакета = "ПлатежноеПоручение";
				ТабличныйДокумент.КлючПараметровПечати = "ПлатежноеПоручениеИсходящее_ПлатежноеПоручение";
			КонецЕсли;
			Макет = Документы.ПлатежноеПоручениеИсходящее.ПолучитьМакет(ИмяМакета);
			
			// Запомним номер строки, с которой начали выводить текущий документ.
			
			Валютный = Шапка.ВалютаДокумента <> ВалютаРегламентированногоУчета;
			
			// Выводим шапку ПКО
			
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			
			ОбластьМакета.Параметры.Заполнить(Шапка);
			ОбластьМакета.Параметры.Плательщик 					= Шапка.ОрганизацияНаименованиеПолное;
			ОбластьМакета.Параметры.НомерСчетаПлательщика 		= Шапка.БанковскийСчетНомерСчета;
			ОбластьМакета.Параметры.КодОКПОПлательщика 			= Шапка.КодОКПОПлательщика;
			ОбластьМакета.Параметры.РегистрНомерСФ 				= Шапка.РегистрНомерСФ;
			ОбластьМакета.Параметры.БИКБанкаПлательщика			= Шапка.БИКБанкаПлательщика;
			ОбластьМакета.Параметры.БанкПлательщика				= "" + Шапка.БанкПлательщика 
																+ ?(ЗначениеЗаполнено(Шапка.АдресБанкаПлательщика), 
																", " + Символы.ПС + Шапка.АдресБанкаПлательщика, "");
			
			
			ОбластьМакета.Параметры.БИКБанкаПолучателя			= Шапка.БИКБанкаПолучателя;
				
			Если Шапка.Операция.ВидОперации = Перечисления.ВидыОперацийППИ.ВыплатаЗП
				 И ЗначениеЗаполнено(Шапка.КартСчет) Тогда
				
				ОбластьМакета.Параметры.Получатель				= ВременнаяТаблицаЗП[0].ФизЛицо;
				СтруктураКартСчета = ПолучитьКарСчет(Шапка.КартСчет);	
				ОбластьМакета.Параметры.НомерСчетаПолучателя	= СтруктураКартСчета.КартСчет;			
				ОбластьМакета.Параметры.БанкПолучателя			= СтруктураКартСчета.Банк;	
				
			ИначеЕсли Шапка.Операция.ВидОперации = Перечисления.ВидыОперацийППИ.ПрочийРасход Тогда
				ВременнаяТаблицаПрочийРасход = Шапка.ПрочиеРасходы.Выгрузить();
				Если ЗначениеЗаполнено(Шапка.ПолучательПФНаименованиеПолное) Тогда
					ОбластьМакета.Параметры.Получатель		=  Шапка.ПолучательПФНаименованиеПолное;    
				Иначе
					Если ВременнаяТаблицаПрочийРасход.Количество() > 0 Тогда
						СтрокаТаблицыРасход = ВременнаяТаблицаПрочийРасход[0];
						Если СтрокаТаблицыРасход.СчетУчета = ПланыСчетов.Хозрасчетный.ЗадолженностьПоИсполнительнымЛистам Тогда
							ОбластьМакета.Параметры.Получатель		= СтрокаТаблицыРасход.Субконто2.НаименованиеПолное;
						ИначеЕсли ТипЗнч(СтрокаТаблицыРасход.Субконто1) = ТИП("СправочникСсылка.ФизическиеЛица") Тогда
							ОбластьМакета.Параметры.Получатель		= СтрокаТаблицыРасход.Субконто1.НаименованиеПолное;
						ИначеЕсли ТипЗнч(СтрокаТаблицыРасход.Субконто2) = ТИП("СправочникСсылка.ФизическиеЛица") Тогда
							ОбластьМакета.Параметры.Получатель		= СтрокаТаблицыРасход.Субконто2.НаименованиеПолное;							
						ИначеЕсли ТипЗнч(СтрокаТаблицыРасход.Субконто1) = ТИП("СправочникСсылка.Контрагенты") Тогда
							ОбластьМакета.Параметры.Получатель		= СтрокаТаблицыРасход.Субконто1.НаименованиеПолное;
						ИначеЕсли ТипЗнч(СтрокаТаблицыРасход.Субконто2) = ТИП("СправочникСсылка.Контрагенты") Тогда
							ОбластьМакета.Параметры.Получатель		= СтрокаТаблицыРасход.Субконто2.НаименованиеПолное;						
				
						КонецЕсли;							 
					КонецЕсли;
				КонецЕсли;
				ОбластьМакета.Параметры.НомерСчетаПолучателя	= Шапка.БанковскийСчетПолучателяНомерСчета;			
				ОбластьМакета.Параметры.БанкПолучателя			= "" + Шапка.БанкПолучателя 
																+ ?(ЗначениеЗаполнено(Шапка.АдресБанкаПолучателя), 
																", " + Символы.ПС + Шапка.АдресБанкаПолучателя, "");				
			ИначеЕсли (ТипЗнч(Шапка.ДокументОснование) = Тип("ДокументСсылка.ВедомостьЗП") 
					ИЛИ ТипЗнч(Шапка.ДокументОснование) = Тип("ДокументСсылка.ВыплатаЗП")) 
					И Шапка.Операция.ВидОперации = Перечисления.ВидыОперацийППИ.ВыплатаЗП Тогда
					
				ОбластьМакета.Параметры.Получатель				= ВременнаяТаблицаЗП[0].ФизЛицо;
				ОбластьМакета.Параметры.ИННПолучателя           = ВременнаяТаблицаЗП[0].ИННФизЛица;
				ОбластьМакета.Параметры.БанкПолучателя			= "" + Шапка.БанкПолучателя 
																+ ?(ЗначениеЗаполнено(Шапка.АдресБанкаПолучателя), 
																", " + Символы.ПС + Шапка.АдресБанкаПолучателя, "");
				ОбластьМакета.Параметры.НомерСчетаПолучателя	= Шапка.БанковскийСчетПолучателяНомерСчета;
			Иначе
				Если Шапка.Операция.ВидОперации = Перечисления.ВидыОперацийППИ.ПереводНаДругойСчет Тогда
					ОбластьМакета.Параметры.Получатель			= Шапка.ОрганизацияНаименованиеПолное;
				Иначе
					ОбластьМакета.Параметры.Получатель			= Шапка.КонтрагентНаименованиеПолное;
					ОбластьМакета.Параметры.ИННПолучателя		= Шапка.ПолучательПФИНН;
				КонецЕсли;				
				ОбластьМакета.Параметры.НомерСчетаПолучателя	= Шапка.БанковскийСчетПолучателяНомерСчета;			
				ОбластьМакета.Параметры.БанкПолучателя			= "" + Шапка.БанкПолучателя 
																+ ?(ЗначениеЗаполнено(Шапка.АдресБанкаПолучателя), 
																", " + Символы.ПС + Шапка.АдресБанкаПолучателя, "");		
			КонецЕсли;
			
			ОбластьМакета.Параметры.НомерСчетаБанкПосредник		= Шапка.СчетБанкаПосредника;			
			ОбластьМакета.Параметры.КодНазначенияПлатежа		= Шапка.КодНазначенияПлатежа;
			ОбластьМакета.Параметры.НазначениеПлатежа			= Шапка.НазначениеПлатежа;

			Сумма = Формат(Шапка.СуммаДокумента, "ЧЦ=15; ЧДЦ=2");
			Разделитель = ?(ЗначениеЗаполнено(Шапка.РазделительДляПечатиСумм), Шапка.РазделительДляПечатиСумм, ",");
			Сумма = СтрЗаменить(Сумма, ",", Разделитель);
			
			ОбластьМакета.Параметры.Сумма		      = Сумма + ?(Валютный, " " + СокрЛП(Шапка.ВалютаДокумента), "");
			ОбластьМакета.Параметры.СуммаПрописью     = РаботаСКурсамиВалют.СформироватьСуммуПрописью(Шапка.СуммаДокумента, Шапка.ВалютаДокумента);
			
			ОбластьМакета.Параметры.ДатаДокумента     = Формат(Шапка.Дата, "ДЛФ=DD");
			ОбластьМакета.Параметры.НаименованиеНомер = "ПЛАТЕЖНОЕ ПОРУЧЕНИЕ ИСХОДЯЩЕЕ № " + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Шапка.Номер, Истина, Истина);
			
			ОбластьМакета.Параметры.ВтораяПодпись		  = ?(Шапка.ВтораяПодписьНеПредусмотрена, "Вторая подпись не предусмотрена", "Главный бухгалтер");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			Если Шапка.ПечатьНаОдномЛистеДваЭкземпляра И Сч = 1 Тогда
			    ОбластьМакета = Макет.ПолучитьОбласть("ЛинияРазреза");
				ТабличныйДокумент.Вывести(ОбластьМакета);
			КонецЕсли;
														   
		КонецЦикла;
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		                                               НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
													   
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПолучитьКарСчет(Строка)
	Массив = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Строка, ",");	
	Структура = Новый Структура;
	Если Массив.Количество() > 0 Тогда
		Структура.Вставить("КартСчет", Массив[0]);
	Иначе
		Структура.Вставить("КартСчет", 	"");
		Структура.Вставить("Банк", 		"");
	КонецЕсли;
	Если Массив.Количество() > 1 Тогда
		Структура.Вставить(" Банк", Массив[1]);
	Иначе
		Структура.Вставить("Банк", 		"");		
	КонецЕсли;
	
	Возврат Структура;	

КонецФункции // ()

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	// Устанавливаем признак доступности печати покомплектно.
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	// Проверяем, нужно ли для макета ППИ формировать табличный документ.
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПлатежноеПоручение") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"ПлатежноеПоручение", НСтр("ru = 'Печать ППИ'"), ПечатьППИ(МассивОбъектов, ОбъектыПечати),,
			"Документ.ПлатежноеПоручениеИсходящее.ПлатежноеПоручение");
	КонецЕсли;
		
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПлатежноеПоручение";
	КомандаПечати.Представление = НСтр("ru = 'Печать ППИ'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.Порядок = 1;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли