#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Процедура - обработчик события ОбработкаЗаполнения объекта.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеОбъектовБП.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения);
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Дата = КонецМесяца(ТекущаяДатаСеанса());
		Если ЕстьДокументВУказанныйПериод(Дата) Тогда
			Дата = Дата('00010101');
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаПроверкиЗаполнения объекта.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	// Предварительный контроль
	ВыполнитьПредварительныйКонтроль(Отказ);	
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

#КонецОбласти
	
#Область СлужебныеПроцедурыИФункции

// Процедура выполняет контроль противоречий.
//
Процедура ВыполнитьПредварительныйКонтроль(Отказ)
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;	
КонецПроцедуры

Функция ЕстьДокументВУказанныйПериод(Дата)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетПоНДС.Ссылка
		|ИЗ
		|	Документ.ОтчетПоНДС КАК ОтчетПоНДС
		|ГДЕ
		|	НЕ ОтчетПоНДС.ПометкаУдаления
		|	И КОНЕЦПЕРИОДА(ОтчетПоНДС.Дата, МЕСЯЦ) = &Дата";
	
	Запрос.УстановитьПараметр("Дата", Дата);		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка.Количество() > 0 	

КонецФункции 

// Процедура заполняет табличную часть
//
Процедура ЗаполнитьТабличнуюЧастьОтчетОсновной() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗакрытиеМесяца.Ссылка,
		|	ЗакрытиеМесяца.РасчетНДС
		|ИЗ
		|	Документ.ЗакрытиеМесяца КАК ЗакрытиеМесяца
		|ГДЕ
		|	НЕ ЗакрытиеМесяца.ПометкаУдаления
		|	И КОНЕЦПЕРИОДА(ЗакрытиеМесяца.Дата, МЕСЯЦ) = &Дата
		|	И ЗакрытиеМесяца.Организация = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗакрытиеМесяцаНДС.Строка,
		|	ЗакрытиеМесяцаНДС.Содержание,
		|	ЗакрытиеМесяцаНДС.Сумма
		|ИЗ
		|	Документ.ЗакрытиеМесяца.НДС КАК ЗакрытиеМесяцаНДС
		|ГДЕ
		|	ЗакрытиеМесяцаНДС.Ссылка.Дата = &Дата
		|	И ЗакрытиеМесяцаНДС.Ссылка.Проведен
		|	И ЗакрытиеМесяцаНДС.Ссылка.Организация = &Организация";				
	Запрос.УстановитьПараметр("Организация", 	Организация);	
	Запрос.УстановитьПараметр("Дата", 			КонецМесяца(Дата));
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ВыборкаЗМ = РезультатЗапроса[0].Выбрать();	
	Если ВыборкаЗМ.Количество() = 0 Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'В период ""%1"" нет документа ""Закрытие месяца""! Табличная часть ""Отчет по НДС"" не может быть заполнена'"), 
										ПредставлениеПериода(НачалоМесяца(Дата), КонецМесяца(Дата)));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;	
	ИначеЕсли ВыборкаЗМ.Следующий() И НЕ ВыборкаЗМ.РасчетНДС Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'В документе ""Закрытие месяца"" за период ""%1"" расчет НДС не производился! Табличная часть ""Отчет по НДС"" не может быть заполнена'"), 
										ПредставлениеПериода(НачалоМесяца(Дата), КонецМесяца(Дата)));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;	
	КонецЕсли;
	
	ОтчетОсновной.Загрузить(РезультатЗапроса[1].Выгрузить());
	
КонецПроцедуры // ЗаполнитьТабличнуюЧасть()

// Процедура заполняет табличную часть
//
Процедура ЗаполнитьТабличнуюЧастьОтчетРеестрПоставок(НалоговыйКонтракт, НеУчитыватьЗакупкиБезНДС) Экспорт

	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АвансыДоотгрузкаОбороты.ДокументОтгрузки КАК ДокументОтгрузки,
		|	АвансыДоотгрузкаОбороты.Контрагент КАК Контрагент,
		|	ВЫБОР
		|		КОГДА АвансыДоотгрузкаОбороты.Контрагент.НаименованиеПолное <> """"
		|			ТОГДА АвансыДоотгрузкаОбороты.Контрагент.НаименованиеПолное
		|		ИНАЧЕ АвансыДоотгрузкаОбороты.Контрагент.Наименование
		|	КОНЕЦ КАК КонтрагентНаименование,
		|	АвансыДоотгрузкаОбороты.Контрагент.ИНН КАК ИННКонтрагента,
		|	ВЫБОР
		|		КОГДА АвансыДоотгрузкаОбороты.Контрагент.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			ТОГДА АвансыДоотгрузкаОбороты.Контрагент.ГНС.Код
		|		ИНАЧЕ АвансыДоотгрузкаОбороты.Контрагент.СтранаРезидентства.Код
		|	КОНЕЦ КАК КодГНС,
		|	АвансыДоотгрузкаОбороты.Договор КАК Договор,
		|	АвансыДоотгрузкаОбороты.ДокументА КАК ДокументА,
		|	""АВАНС-1"" КАК СерияСФ,
		|	ВЫБОР
		|		КОГДА АвансыДоотгрузкаОбороты.СуммаПриход > 0
		|			ТОГДА ВЫБОР
		|					КОГДА АвансыДоотгрузкаОбороты.ДокументА ССЫЛКА Документ.ПлатежноеПоручениеВходящее
		|						ТОГДА ВЫРАЗИТЬ(АвансыДоотгрузкаОбороты.ДокументА КАК Документ.ПлатежноеПоручениеВходящее).Дата
		|					КОГДА АвансыДоотгрузкаОбороты.ДокументА ССЫЛКА Документ.ВводНачальныхОстатков
		|						ТОГДА ВЫРАЗИТЬ(АвансыДоотгрузкаОбороты.ДокументА КАК Документ.ВводНачальныхОстатков).Дата
		|					КОГДА АвансыДоотгрузкаОбороты.ДокументА ССЫЛКА Документ.ПриходныйКассовыйОрдер
		|						ТОГДА ВЫРАЗИТЬ(АвансыДоотгрузкаОбороты.ДокументА КАК Документ.ПриходныйКассовыйОрдер).Дата
		|					КОГДА АвансыДоотгрузкаОбороты.ДокументА ССЫЛКА Документ.ВозвратТоваровОтПокупателя
		|						ТОГДА ВЫРАЗИТЬ(АвансыДоотгрузкаОбороты.ДокументА КАК Документ.ВозвратТоваровОтПокупателя).Дата
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА АвансыДоотгрузкаОбороты.ДокументОтгрузки ССЫЛКА Документ.РеализацияТоваровУслуг
		|					ТОГДА ВЫРАЗИТЬ(АвансыДоотгрузкаОбороты.ДокументОтгрузки КАК Документ.РеализацияТоваровУслуг).Дата
		|				КОГДА АвансыДоотгрузкаОбороты.ДокументОтгрузки ССЫЛКА Документ.ПлатежноеПоручениеИсходящее
		|					ТОГДА ВЫРАЗИТЬ(АвансыДоотгрузкаОбороты.ДокументОтгрузки КАК Документ.ПлатежноеПоручениеИсходящее).Дата
		|				КОГДА АвансыДоотгрузкаОбороты.ДокументОтгрузки ССЫЛКА Документ.РасходныйКассовыйОрдер
		|					ТОГДА ВЫРАЗИТЬ(АвансыДоотгрузкаОбороты.ДокументОтгрузки КАК Документ.РасходныйКассовыйОрдер).Дата
		|			КОНЕЦ
		|	КОНЕЦ КАК Дата,
		|	ВЫБОР
		|		КОГДА АвансыДоотгрузкаОбороты.СуммаПриход > 0
		|			ТОГДА ВЫБОР
		|					КОГДА АвансыДоотгрузкаОбороты.ДокументА ССЫЛКА Документ.ПлатежноеПоручениеВходящее
		|						ТОГДА ВЫРАЗИТЬ(АвансыДоотгрузкаОбороты.ДокументА КАК Документ.ПлатежноеПоручениеВходящее).Номер
		|					КОГДА АвансыДоотгрузкаОбороты.ДокументА ССЫЛКА Документ.ВводНачальныхОстатков
		|						ТОГДА ВЫРАЗИТЬ(АвансыДоотгрузкаОбороты.ДокументА КАК Документ.ВводНачальныхОстатков).Номер
		|					КОГДА АвансыДоотгрузкаОбороты.ДокументА ССЫЛКА Документ.ПриходныйКассовыйОрдер
		|						ТОГДА ВЫРАЗИТЬ(АвансыДоотгрузкаОбороты.ДокументА КАК Документ.ПриходныйКассовыйОрдер).Номер
		|					КОГДА АвансыДоотгрузкаОбороты.ДокументА ССЫЛКА Документ.ВозвратТоваровОтПокупателя
		|						ТОГДА ВЫРАЗИТЬ(АвансыДоотгрузкаОбороты.ДокументА КАК Документ.ВозвратТоваровОтПокупателя).Номер
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА АвансыДоотгрузкаОбороты.ДокументОтгрузки ССЫЛКА Документ.РеализацияТоваровУслуг
		|					ТОГДА ВЫРАЗИТЬ(АвансыДоотгрузкаОбороты.ДокументОтгрузки КАК Документ.РеализацияТоваровУслуг).Номер
		|				КОГДА АвансыДоотгрузкаОбороты.ДокументОтгрузки ССЫЛКА Документ.ПлатежноеПоручениеИсходящее
		|					ТОГДА ВЫРАЗИТЬ(АвансыДоотгрузкаОбороты.ДокументОтгрузки КАК Документ.ПлатежноеПоручениеИсходящее).Номер
		|				КОГДА АвансыДоотгрузкаОбороты.ДокументОтгрузки ССЫЛКА Документ.РасходныйКассовыйОрдер
		|					ТОГДА ВЫРАЗИТЬ(АвансыДоотгрузкаОбороты.ДокументОтгрузки КАК Документ.РасходныйКассовыйОрдер).Номер
		|			КОНЕЦ
		|	КОНЕЦ КАК НомерСФ,
		|	АвансыДоотгрузкаОбороты.СуммаПриход - АвансыДоотгрузкаОбороты.СуммаНДСПриход - АвансыДоотгрузкаОбороты.СуммаНСППриход КАК СуммаПриход,
		|	АвансыДоотгрузкаОбороты.СуммаРасход - АвансыДоотгрузкаОбороты.СуммаНДСРасход - АвансыДоотгрузкаОбороты.СуммаНСПРасход КАК СуммаРасход,
		|	АвансыДоотгрузкаОбороты.СуммаНДСПриход КАК СуммаНДСПриход,
		|	АвансыДоотгрузкаОбороты.СуммаНДСРасход КАК СуммаНДСРасход,
		|	АвансыДоотгрузкаОбороты.СуммаНСППриход КАК СуммаНСППриход,
		|	АвансыДоотгрузкаОбороты.СуммаНСПРасход КАК СуммаНСПРасход
		|ПОМЕСТИТЬ ВременнаяТаблицаАвансыДоотгрузка
		|ИЗ
		|	РегистрНакопления.АвансыДоотгрузка.Обороты(&НачалоПериода, &КонецПериода, , Организация = &Организация) КАК АвансыДоотгрузкаОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаАвансыДоотгрузка.Контрагент КАК Контрагент,
		|	ВременнаяТаблицаАвансыДоотгрузка.КонтрагентНаименование КАК КонтрагентНаименование,
		|	ВременнаяТаблицаАвансыДоотгрузка.ИННКонтрагента КАК ИННКонтрагента,
		|	ВременнаяТаблицаАвансыДоотгрузка.КодГНС КАК КодГНС,
		|	ВременнаяТаблицаАвансыДоотгрузка.Договор КАК Договор,
		|	ВременнаяТаблицаАвансыДоотгрузка.ДокументА КАК ДокументА,
		|	ВременнаяТаблицаАвансыДоотгрузка.СерияСФ КАК СерияСФ,
		|	ВременнаяТаблицаАвансыДоотгрузка.Дата КАК ДатаВыписки,
		|	ВременнаяТаблицаАвансыДоотгрузка.НомерСФ КАК НомерСФ,
		|	111 КАК КодПоставки,
		|	ВременнаяТаблицаАвансыДоотгрузка.СуммаПриход КАК СтоимостьБезНДС,
		|	ВременнаяТаблицаАвансыДоотгрузка.СуммаНДСПриход КАК СуммаНДС,
		|	ВременнаяТаблицаАвансыДоотгрузка.СуммаНСППриход КАК СуммаНСП,
		|	ВЫБОР
		|		КОГДА &НСПВСумме
		|			ТОГДА ВременнаяТаблицаАвансыДоотгрузка.СуммаПриход + ВременнаяТаблицаАвансыДоотгрузка.СуммаНДСПриход + ВременнаяТаблицаАвансыДоотгрузка.СуммаНСППриход
		|		ИНАЧЕ ВременнаяТаблицаАвансыДоотгрузка.СуммаПриход + ВременнаяТаблицаАвансыДоотгрузка.СуммаНДСПриход
		|	КОНЕЦ КАК ОбщаяСтоимостьСНДС,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаАвансыДоотгрузка.Контрагент.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК КонтрагентСтранаРезидентстваЕАЭС
		|ИЗ
		|	ВременнаяТаблицаАвансыДоотгрузка КАК ВременнаяТаблицаАвансыДоотгрузка
		|ГДЕ
		|	ВременнаяТаблицаАвансыДоотгрузка.СуммаПриход > 0
		|	И ВЫБОР
		|			КОГДА &НеУчитыватьЗакупкиБезНДС
		|				ТОГДА ВременнаяТаблицаАвансыДоотгрузка.СуммаНДСПриход <> 0
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаВыписки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаАвансыДоотгрузка.Контрагент КАК Контрагент,
		|	ВременнаяТаблицаАвансыДоотгрузка.КонтрагентНаименование КАК КонтрагентНаименование,
		|	ВременнаяТаблицаАвансыДоотгрузка.ИННКонтрагента КАК ИННКонтрагента,
		|	ВременнаяТаблицаАвансыДоотгрузка.КодГНС КАК КодГНС,
		|	ВременнаяТаблицаАвансыДоотгрузка.Договор КАК Договор,
		|	ВременнаяТаблицаАвансыДоотгрузка.ДокументА КАК ДокументА,
		|	ВременнаяТаблицаАвансыДоотгрузка.Дата КАК ДатаВыписки,
		|	ВременнаяТаблицаАвансыДоотгрузка.СерияСФ КАК СерияСФ,
		|	ВременнаяТаблицаАвансыДоотгрузка.НомерСФ КАК НомерСФ,
		|	112 КАК КодПоставки,
		|	-ВременнаяТаблицаАвансыДоотгрузка.СуммаРасход КАК СтоимостьБезНДС,
		|	-ВременнаяТаблицаАвансыДоотгрузка.СуммаНДСРасход КАК СуммаНДС,
		|	-ВременнаяТаблицаАвансыДоотгрузка.СуммаНСПРасход КАК СуммаНСП,
		|	-ВЫБОР
		|		КОГДА &НСПВСумме
		|			ТОГДА ВременнаяТаблицаАвансыДоотгрузка.СуммаРасход + ВременнаяТаблицаАвансыДоотгрузка.СуммаНДСРасход + ВременнаяТаблицаАвансыДоотгрузка.СуммаНСПРасход
		|		ИНАЧЕ ВременнаяТаблицаАвансыДоотгрузка.СуммаРасход + ВременнаяТаблицаАвансыДоотгрузка.СуммаНДСРасход
		|	КОНЕЦ КАК ОбщаяСтоимостьСНДС,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаАвансыДоотгрузка.Контрагент.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК КонтрагентСтранаРезидентстваЕАЭС
		|ИЗ
		|	ВременнаяТаблицаАвансыДоотгрузка КАК ВременнаяТаблицаАвансыДоотгрузка
		|ГДЕ
		|	ВременнаяТаблицаАвансыДоотгрузка.СуммаРасход > 0
		|	И ВЫБОР
		|			КОГДА &НеУчитыватьЗакупкиБезНДС
		|				ТОГДА ВременнаяТаблицаАвансыДоотгрузка.СуммаНДСРасход <> 0
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаВыписки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СчетаФактурыВыписанные.Контрагент КАК Контрагент,
		|	СчетаФактурыВыписанные.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	СчетаФактурыВыписанные.СтавкаНДС КАК СтавкаНДС,
		|	СчетаФактурыВыписанные.СерияБланкаСФ КАК СерияСФ,
		|	СчетаФактурыВыписанные.НомерБланкаСФ КАК НомерСФ,
		|	СчетаФактурыВыписанные.КорСерияБланкаСФ КАК КорСерияСФ,
		|	СчетаФактурыВыписанные.КорНомерБланкаСФ КАК КорНомерСФ,
		|	СчетаФактурыВыписанные.Контрагент.ИНН КАК ИННКонтрагента,
		|	ВЫБОР
		|		КОГДА СчетаФактурыВыписанные.Контрагент.НаименованиеПолное <> """"
		|			ТОГДА СчетаФактурыВыписанные.Контрагент.НаименованиеПолное
		|		ИНАЧЕ СчетаФактурыВыписанные.Контрагент.Наименование
		|	КОНЕЦ КАК КонтрагентНаименование,
		|	ВЫБОР
		|		КОГДА СчетаФактурыВыписанные.Контрагент.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			ТОГДА СчетаФактурыВыписанные.Контрагент.ГНС.Код
		|		ИНАЧЕ СчетаФактурыВыписанные.Контрагент.СтранаРезидентства.Код
		|	КОНЕЦ КАК КодГНС,
		|	СчетаФактурыВыписанные.ВидПоставкиНДС.Код КАК КодПоставки,
		|	СчетаФактурыВыписанные.ДатаПоставки КАК ДатаПоставки,
		|	СУММА(СчетаФактурыВыписанные.СуммаБезНДС) КАК СтоимостьБезНДС,
		|	СУММА(СчетаФактурыВыписанные.СуммаНДС) КАК СуммаНДС,
		|	СУММА(СчетаФактурыВыписанные.СуммаНеоблагаемая) КАК СуммаНСП,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(СчетаФактурыВыписанные.Регистратор КАК Документ.СчетФактураВыписанный) ССЫЛКА Документ.СчетФактураВыписанный
		|			ТОГДА ВЫРАЗИТЬ(СчетаФактурыВыписанные.Регистратор КАК Документ.СчетФактураВыписанный).Дата
		|		ИНАЧЕ СчетаФактурыВыписанные.ДатаСФ
		|	КОНЕЦ КАК ДатаВыписки,
		|	СУММА(ВЫБОР
		|			КОГДА &НСПВСумме
		|				ТОГДА СчетаФактурыВыписанные.СуммаБезНДС + СчетаФактурыВыписанные.СуммаНДС + СчетаФактурыВыписанные.СуммаНеоблагаемая
		|			ИНАЧЕ СчетаФактурыВыписанные.СуммаБезНДС + СчетаФактурыВыписанные.СуммаНДС
		|		КОНЕЦ) КАК ОбщаяСтоимостьСНДС,
		|	ВЫБОР
		|		КОГДА СчетаФактурыВыписанные.Контрагент.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК КонтрагентСтранаРезидентстваЕАЭС,
		|	СчетаФактурыВыписанные.Документ.Номер КАК ДокументНомер
		|ИЗ
		|	РегистрСведений.СчетаФактурыВыписанные КАК СчетаФактурыВыписанные
		|ГДЕ
		|	СчетаФактурыВыписанные.Организация = &Организация
		|	И СчетаФактурыВыписанные.ДатаПоставки МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ВЫБОР
		|			КОГДА &НеУчитыватьЗакупкиБезНДС
		|				ТОГДА СчетаФактурыВыписанные.СуммаНДС <> 0
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА СчетаФактурыВыписанные.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
		|					ИЛИ СчетаФактурыВыписанные.Регистратор ССЫЛКА Документ.ВозвратТоваровОтПокупателя
		|				ТОГДА СчетаФактурыВыписанные.СерияБланкаСФ <> """"
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	СчетаФактурыВыписанные.ДатаПоставки,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(СчетаФактурыВыписанные.Регистратор КАК Документ.СчетФактураВыписанный) ССЫЛКА Документ.СчетФактураВыписанный
		|			ТОГДА ВЫРАЗИТЬ(СчетаФактурыВыписанные.Регистратор КАК Документ.СчетФактураВыписанный).Дата
		|		ИНАЧЕ СчетаФактурыВыписанные.ДатаСФ
		|	КОНЕЦ,
		|	СчетаФактурыВыписанные.ВидПоставкиНДС.Код,
		|	СчетаФактурыВыписанные.Контрагент,
		|	СчетаФактурыВыписанные.СтавкаНДС,
		|	СчетаФактурыВыписанные.ДоговорКонтрагента,
		|	СчетаФактурыВыписанные.КорСерияБланкаСФ,
		|	СчетаФактурыВыписанные.КорНомерБланкаСФ,
		|	СчетаФактурыВыписанные.СерияБланкаСФ,
		|	СчетаФактурыВыписанные.Контрагент.ИНН,
		|	ВЫБОР
		|		КОГДА СчетаФактурыВыписанные.Контрагент.НаименованиеПолное <> """"
		|			ТОГДА СчетаФактурыВыписанные.Контрагент.НаименованиеПолное
		|		ИНАЧЕ СчетаФактурыВыписанные.Контрагент.Наименование
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА СчетаФактурыВыписанные.Контрагент.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			ТОГДА СчетаФактурыВыписанные.Контрагент.ГНС.Код
		|		ИНАЧЕ СчетаФактурыВыписанные.Контрагент.СтранаРезидентства.Код
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА СчетаФактурыВыписанные.Контрагент.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	СчетаФактурыВыписанные.НомерБланкаСФ,
		|	СчетаФактурыВыписанные.Документ.Номер
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаВыписки";
	Запрос.УстановитьПараметр("НачалоПериода", 				НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("КонецПериода", 				КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Организация", 				Организация);  
	Запрос.УстановитьПараметр("НСПВСумме", 					НСПвСумме);
	Запрос.УстановитьПараметр("НеУчитыватьЗакупкиБезНДС", 	НеУчитыватьЗакупкиБезНДС);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ВыборкаАвансы 		= МассивРезультатов[1].Выбрать();
	ВыборкаДоотгрузки 	= МассивРезультатов[2].Выбрать();
	ВыборкаОтгрузки 	= МассивРезультатов[3].Выбрать();
	
	// Начало отгрузки.
	Пока ВыборкаОтгрузки.Следующий() Цикл
		
		Если НалоговыйКонтракт Тогда
			НоваяСтрокаАванс = ОтчетРеестрПоставокНаОсновеНалоговогоКонтракта.Добавить();
		Иначе
			НоваяСтрокаАванс = ОтчетРеестрПоставок.Добавить();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(НоваяСтрокаАванс, ВыборкаОтгрузки);	
		Если ВыборкаОтгрузки.СерияСФ = "ДПБУ" И ВыборкаОтгрузки.НомерСФ = "" Тогда
			НоваяСтрокаАванс.НомерСФ = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ВыборкаОтгрузки.ДокументНомер);
		КонецЕсли;
	КонецЦикла;	
	// Конец отгрузки.
	
	// Начало Авансы.
	Пока ВыборкаАвансы.Следующий() Цикл
		
		Если НалоговыйКонтракт Тогда
			НоваяСтрокаАванс = ОтчетРеестрПоставокНаОсновеНалоговогоКонтракта.Добавить();
		Иначе
			НоваяСтрокаАванс = ОтчетРеестрПоставок.Добавить();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(НоваяСтрокаАванс, ВыборкаАвансы);		
	КонецЦикла;	
	// Конец Авансы.
	
	// Начало Доотгрузки.
	Пока ВыборкаДоотгрузки.Следующий() Цикл
		
		Если НалоговыйКонтракт Тогда
			НоваяСтрокаАванс = ОтчетРеестрПоставокНаОсновеНалоговогоКонтракта.Добавить();
		Иначе
			НоваяСтрокаАванс = ОтчетРеестрПоставок.Добавить();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(НоваяСтрокаАванс, ВыборкаДоотгрузки);		
	КонецЦикла;	
	// Конец Доотгрузки.
КонецПроцедуры	

// УДАЛИТЬ

// Процедура заполняет табличную часть
//
Процедура Старая_ЗаполнитьТабличнуюЧастьОтчетРеестрПоставок() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СчетаФактурыВыписанные.Документ КАК Документ,
	|	СчетаФактурыВыписанные.Контрагент КАК Контрагент,
	|	СчетаФактурыВыписанные.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	СчетаФактурыВыписанные.Контрагент.ИНН КАК КонтрагентИНН,
	|	СчетаФактурыВыписанные.ДатаСФ КАК ДатаСФ,
	|	СчетаФактурыВыписанные.СерияБланкаСФ КАК СерияБланкаСФ,
	|	СчетаФактурыВыписанные.НомерБланкаСФ КАК НомерБланкаСФ,
	|	1 КАК КоличествоСтрок,
	|	ВЫБОР
	|		КОГДА СчетаФактурыВыписанные.Контрагент.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
	|			ТОГДА СчетаФактурыВыписанные.Контрагент.ГНС.Код
	|		ИНАЧЕ СчетаФактурыВыписанные.Контрагент.СтранаРезидентства.Код
	|	КОНЕЦ КАК КодГНС,
	|	СчетаФактурыВыписанные.ВидПоставкиНДС.Код КАК КодПоставки,
	|	СчетаФактурыВыписанные.Регистратор КАК СФВыписанныеРегистратор,
	|	СчетаФактурыВыписанные.Документ.Дата КАК ДатаВыписки,
	|	СУММА(СчетаФактурыВыписанные.СуммаБезНДС) КАК СуммаБезНДС,
	|	СУММА(СчетаФактурыВыписанные.СуммаНДС) КАК СуммаНДС,
	|	СУММА(СчетаФактурыВыписанные.СуммаНеоблагаемая) КАК СуммаНеоблагаемая,
	|	СчетаФактурыВыписанные.СтавкаНДС КАК СтавкаНДС
	|ПОМЕСТИТЬ ВременнаяТаблицаСФВыписанные
	|ИЗ
	|	РегистрСведений.СчетаФактурыВыписанные КАК СчетаФактурыВыписанные
	|ГДЕ
	|	СчетаФактурыВыписанные.ДатаСФ МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	СчетаФактурыВыписанные.Документ,
	|	СчетаФактурыВыписанные.Контрагент,
	|	СчетаФактурыВыписанные.ДоговорКонтрагента,
	|	СчетаФактурыВыписанные.ДатаСФ,
	|	СчетаФактурыВыписанные.СерияБланкаСФ,
	|	СчетаФактурыВыписанные.НомерБланкаСФ,
	|	СчетаФактурыВыписанные.ВидПоставкиНДС.Код,
	|	СчетаФактурыВыписанные.Регистратор,
	|	СчетаФактурыВыписанные.Контрагент.ИНН,
	|	СчетаФактурыВыписанные.Документ.Дата,
	|	ВЫБОР
	|		КОГДА СчетаФактурыВыписанные.Контрагент.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
	|			ТОГДА СчетаФактурыВыписанные.Контрагент.ГНС.Код
	|		ИНАЧЕ СчетаФактурыВыписанные.Контрагент.СтранаРезидентства.Код
	|	КОНЕЦ,
	|	СчетаФактурыВыписанные.СтавкаНДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВременнаяТаблицаСФВыписанные.Контрагент, ПродажиОбороты.Контрагент) КАК Контрагент,
	|	ПродажиОбороты.Договор КАК Договор,
	|	ПродажиОбороты.СтавкаНДС КАК СтавкаНДС,
	//|	ВЫБОР
	//|		КОГДА ПродажиОбороты.СтавкаНДС = ЗНАЧЕНИЕ(Справочник.СтавкиНДС.БезНДС)
	//|			ТОГДА ""ДПБУ""
	//|		ИНАЧЕ РеализацияИтоги.СерияБланкаСФ
	//|	КОНЕЦ КАК СерияСФ,
	|	РеализацияИтоги.СерияБланкаСФ КАК СерияСФ,
	//|	ВЫБОР
	//|		КОГДА ПродажиОбороты.СтавкаНДС = ЗНАЧЕНИЕ(Справочник.СтавкиНДС.БезНДС)
	//|			ТОГДА ПродажиОбороты.ДокументРеализации.Номер
	//|		ИНАЧЕ РеализацияИтоги.НомерБланкаСФ
	//|	КОНЕЦ КАК НомерСФ,
	|	РеализацияИтоги.НомерБланкаСФ КАК НомерСФ,
	|	ПродажиОбороты.Контрагент.ИНН КАК ИНН,
	|	1 КАК КоличествоСтрок,
	|	ВЫБОР
	|		КОГДА ПродажиОбороты.Контрагент.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
	|			ТОГДА ПродажиОбороты.Контрагент.ГНС.Код
	|		ИНАЧЕ ПродажиОбороты.Контрагент.СтранаРезидентства.Код
	|	КОНЕЦ КАК КодГНС,
	|	РеализацияИтоги.КодВидаПоставкиНДС КАК КодПоставки,
	|	НАЧАЛОПЕРИОДА(ПродажиОбороты.ПериодСекунда, ДЕНЬ) КАК ДатаПоставки,
	|	СУММА(ПродажиОбороты.СуммаОборот) КАК Отгрузка,
	|	СУММА(ПродажиОбороты.СуммаНДСОборот) КАК СуммаНДС,
	|	СУММА(ПродажиОбороты.СуммаНСПОборот) КАК СуммаНСП,
	|	НАЧАЛОПЕРИОДА(ЕСТЬNULL(РеализацияИтоги.ДокументРеализации.Дата, ПродажиОбороты.ПериодСекунда), ДЕНЬ) КАК Дата,
	|	СУММА(ПродажиОбороты.СуммаОборот + ПродажиОбороты.СуммаНДСОборот + ВЫБОР
	|			КОГДА &НСПВСумме
	|				ТОГДА ПродажиОбороты.СуммаНСПОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОбщаяСтоимостьСНДС
	|ПОМЕСТИТЬ ВременнаяТаблицаОтгрузкаТекущегоМесяца
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Авто,
	|			Организация = &Организация
	|				И ИСТИНА) КАК ПродажиОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеализацияИтоги КАК РеализацияИтоги
	|		ПО ПродажиОбороты.ДокументРеализации = РеализацияИтоги.ДокументРеализации
	|			И ПродажиОбороты.Договор = РеализацияИтоги.Договор
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСФВыписанные КАК ВременнаяТаблицаСФВыписанные
	|		ПО ПродажиОбороты.ДокументРеализации = ВременнаяТаблицаСФВыписанные.Документ
	|ГДЕ
	|	ВременнаяТаблицаСФВыписанные.Документ ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажиОбороты.СтавкаНДС,
	|	ЕСТЬNULL(ВременнаяТаблицаСФВыписанные.Контрагент, ПродажиОбороты.Контрагент),
	|	ПродажиОбороты.Договор,
	|	РеализацияИтоги.СерияБланкаСФ,
	|	РеализацияИтоги.НомерБланкаСФ,
	|	ПродажиОбороты.Контрагент.ИНН,
	|	ВЫБОР
	|		КОГДА ПродажиОбороты.Контрагент.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
	|			ТОГДА ПродажиОбороты.Контрагент.ГНС.Код
	|		ИНАЧЕ ПродажиОбороты.Контрагент.СтранаРезидентства.Код
	|	КОНЕЦ,
	|	РеализацияИтоги.КодВидаПоставкиНДС,
	|	НАЧАЛОПЕРИОДА(ПродажиОбороты.ПериодСекунда, ДЕНЬ),
	|	НАЧАЛОПЕРИОДА(ЕСТЬNULL(РеализацияИтоги.ДокументРеализации.Дата, ПродажиОбороты.ПериодСекунда), ДЕНЬ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВременнаяТаблицаСФВыписанные.СФВыписанныеРегистратор.Контрагент,
	|	ВременнаяТаблицаСФВыписанные.СФВыписанныеРегистратор.ДоговорКонтрагента,
	|	ВременнаяТаблицаСФВыписанные.СтавкаНДС,
	|	ВременнаяТаблицаСФВыписанные.СерияБланкаСФ,
	|	ВременнаяТаблицаСФВыписанные.НомерБланкаСФ,
	|	ВременнаяТаблицаСФВыписанные.Контрагент.ИНН,
	|	1,
	|	ВременнаяТаблицаСФВыписанные.КодГНС,
	|	ВременнаяТаблицаСФВыписанные.КодПоставки,
	|	НАЧАЛОПЕРИОДА(ВременнаяТаблицаСФВыписанные.ДатаСФ, ДЕНЬ),
	|	СУММА(ВременнаяТаблицаСФВыписанные.СуммаБезНДС),
	|	СУММА(ВременнаяТаблицаСФВыписанные.СуммаНДС),
	|	СУММА(ВременнаяТаблицаСФВыписанные.СуммаНеоблагаемая),
	|	НАЧАЛОПЕРИОДА(ВременнаяТаблицаСФВыписанные.ДатаВыписки, ДЕНЬ),
	|	СУММА(ВременнаяТаблицаСФВыписанные.СуммаБезНДС + ВременнаяТаблицаСФВыписанные.СуммаНДС + ВЫБОР
	|			КОГДА &НСПВСумме
	|				ТОГДА ВременнаяТаблицаСФВыписанные.СуммаНеоблагаемая
	|			ИНАЧЕ 0
	|		КОНЕЦ)
	|ИЗ
	|	ВременнаяТаблицаСФВыписанные КАК ВременнаяТаблицаСФВыписанные
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаСФВыписанные.СФВыписанныеРегистратор.Контрагент,
	|	ВременнаяТаблицаСФВыписанные.СФВыписанныеРегистратор.ДоговорКонтрагента,
	|	ВременнаяТаблицаСФВыписанные.Контрагент.ИНН,
	|	ВременнаяТаблицаСФВыписанные.КодГНС,
	|	ВременнаяТаблицаСФВыписанные.КодПоставки,
	|	ВременнаяТаблицаСФВыписанные.СерияБланкаСФ,
	|	ВременнаяТаблицаСФВыписанные.НомерБланкаСФ,
	|	НАЧАЛОПЕРИОДА(ВременнаяТаблицаСФВыписанные.ДатаВыписки, ДЕНЬ),
	|	НАЧАЛОПЕРИОДА(ВременнаяТаблицаСФВыписанные.ДатаСФ, ДЕНЬ),
	|	ВременнаяТаблицаСФВыписанные.СтавкаНДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяца.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяца.Договор КАК Договор,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяца.СтавкаНДС КАК СтавкаНДС,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяца.СерияСФ КАК СерияСФ,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяца.НомерСФ КАК НомерСФ,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяца.ИНН КАК ИНН,
	|	СУММА(ВременнаяТаблицаОтгрузкаТекущегоМесяца.КоличествоСтрок) КАК КоличествоСтрок,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяца.КодГНС КАК КодГНС,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяца.КодПоставки КАК КодПоставки,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяца.ДатаПоставки КАК ДатаПоставки,
	|	СУММА(ВременнаяТаблицаОтгрузкаТекущегоМесяца.Отгрузка) КАК Отгрузка,
	|	СУММА(ВременнаяТаблицаОтгрузкаТекущегоМесяца.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ВременнаяТаблицаОтгрузкаТекущегоМесяца.СуммаНСП) КАК СуммаНСП,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяца.Дата КАК Дата,
	|	СУММА(ВременнаяТаблицаОтгрузкаТекущегоМесяца.ОбщаяСтоимостьСНДС) КАК ОбщаяСтоимостьСНДС
	|ПОМЕСТИТЬ ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал
	|ИЗ
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяца КАК ВременнаяТаблицаОтгрузкаТекущегоМесяца
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяца.СерияСФ,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяца.НомерСФ,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяца.ИНН,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяца.ДатаПоставки,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяца.КодГНС,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяца.Контрагент,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяца.СтавкаНДС,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяца.КодПоставки,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяца.Договор,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяца.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.Договор КАК Договор,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.Отгрузка) КАК Отгрузка
	|ПОМЕСТИТЬ ВременнаяТаблицаСписокКонтрагентов
	|ИЗ
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал КАК ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.Договор,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.Контрагент,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.СтавкаНДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АвансыДоотгрузкаОстатки.Контрагент КАК Контрагент,
	|	АвансыДоотгрузкаОстатки.Договор КАК Договор,
	|	АвансыДоотгрузкаОстатки.ДокументА КАК ДокументАванса,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(АвансыДоотгрузкаОстатки.ДокументА КАК Документ.ПлатежноеПоручениеВходящее) ССЫЛКА Документ.ПлатежноеПоручениеВходящее
	|			ТОГДА ВЫРАЗИТЬ(АвансыДоотгрузкаОстатки.ДокументА КАК Документ.ПлатежноеПоручениеВходящее).Дата
	|		КОГДА ВЫРАЗИТЬ(АвансыДоотгрузкаОстатки.ДокументА КАК Документ.ПлатежноеПоручениеИсходящее) ССЫЛКА Документ.ПлатежноеПоручениеИсходящее
	|			ТОГДА ВЫРАЗИТЬ(АвансыДоотгрузкаОстатки.ДокументА КАК Документ.ПлатежноеПоручениеИсходящее).Дата
	|		КОГДА ВЫРАЗИТЬ(АвансыДоотгрузкаОстатки.ДокументА КАК Документ.ПриходныйКассовыйОрдер) ССЫЛКА Документ.ПриходныйКассовыйОрдер
	|			ТОГДА ВЫРАЗИТЬ(АвансыДоотгрузкаОстатки.ДокументА КАК Документ.ПриходныйКассовыйОрдер).Дата
	|		КОГДА ВЫРАЗИТЬ(АвансыДоотгрузкаОстатки.ДокументА КАК Документ.РасходныйКассовыйОрдер) ССЫЛКА Документ.РасходныйКассовыйОрдер
	|			ТОГДА ВЫРАЗИТЬ(АвансыДоотгрузкаОстатки.ДокументА КАК Документ.РасходныйКассовыйОрдер).Дата
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	КОНЕЦ КАК ДатаДокумента,
	|	АвансыДоотгрузкаОстатки.СуммаОстаток КАК АвансыОплата,
	|	АвансыДоотгрузкаОстатки.СуммаНДСОстаток КАК СуммаНДСОстаток,
	|	АвансыДоотгрузкаОстатки.СуммаНСПОстаток КАК СуммаНСПОстаток
	|ПОМЕСТИТЬ ВременнаяТаблицаАвансы
	|ИЗ
	|	РегистрНакопления.АвансыДоотгрузка.Остатки(
	|			&НачалоПериода,
	|			Организация = &Организация
	|				И (Контрагент, Договор) В
	|					(ВЫБРАТЬ
	|						ВременнаяТаблицаСписокКонтрагентов.Контрагент,
	|						ВременнаяТаблицаСписокКонтрагентов.Договор
	|					ИЗ
	|						ВременнаяТаблицаСписокКонтрагентов КАК ВременнаяТаблицаСписокКонтрагентов)) КАК АвансыДоотгрузкаОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаАвансы.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаАвансы.Договор КАК Договор
	|ПОМЕСТИТЬ ВременнаяТаблицаСписокКонтрагентовСАвансами
	|ИЗ
	|	ВременнаяТаблицаАвансы КАК ВременнаяТаблицаАвансы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаАвансы.Договор,
	|	ВременнаяТаблицаАвансы.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаАвансы.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаАвансы.Договор КАК Договор,
	|	ВременнаяТаблицаАвансы.ДокументАванса КАК ДокументАванса,
	|	ВременнаяТаблицаАвансы.ДатаДокумента КАК ДатаПоставки,
	|	ВременнаяТаблицаАвансы.АвансыОплата КАК АвансыОплата,
	|	ВременнаяТаблицаАвансы.СуммаНДСОстаток КАК СуммаНДСОстаток,
	|	ВременнаяТаблицаАвансы.СуммаНСПОстаток КАК СуммаНСПОстаток,
	|	ВременнаяТаблицаАвансы.Контрагент.Наименование КАК КонтрагентНаименование,
	|	ВременнаяТаблицаАвансы.Контрагент.ИНН КАК ИННКонтрагента,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаАвансы.Контрагент.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
	|			ТОГДА ""АВАНС-1""
	|		КОГДА ВременнаяТаблицаАвансы.Контрагент.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
	|			ТОГДА ""АВАНС-2""
	|		ИНАЧЕ ""АВАНС-3""
	|	КОНЕЦ КАК СтранаАванса,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаАвансы.ДокументАванса ССЫЛКА Документ.ПлатежноеПоручениеВходящее
	|			ТОГДА ВЫРАЗИТЬ(ВременнаяТаблицаАвансы.ДокументАванса КАК Документ.ПлатежноеПоручениеВходящее).Номер
	|		КОГДА ВременнаяТаблицаАвансы.ДокументАванса ССЫЛКА Документ.ПлатежноеПоручениеИсходящее
	|			ТОГДА ВЫРАЗИТЬ(ВременнаяТаблицаАвансы.ДокументАванса КАК Документ.ПлатежноеПоручениеИсходящее).Номер
	|		КОГДА ВременнаяТаблицаАвансы.ДокументАванса ССЫЛКА Документ.ПриходныйКассовыйОрдер
	|			ТОГДА ВЫРАЗИТЬ(ВременнаяТаблицаАвансы.ДокументАванса КАК Документ.ПриходныйКассовыйОрдер).Номер
	|		КОГДА ВременнаяТаблицаАвансы.ДокументАванса ССЫЛКА Документ.РасходныйКассовыйОрдер
	|			ТОГДА ВЫРАЗИТЬ(ВременнаяТаблицаАвансы.ДокументАванса КАК Документ.РасходныйКассовыйОрдер).Номер
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НомерДокументаАванса
	|ИЗ
	|	ВременнаяТаблицаАвансы КАК ВременнаяТаблицаАвансы
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контрагент,
	|	Договор,
	|	ДатаПоставки
	|ИТОГИ
	|	МАКСИМУМ(Контрагент),
	|	СУММА(АвансыОплата),
	|	СУММА(СуммаНДСОстаток),
	|	СУММА(СуммаНСПОстаток)
	|ПО
	|	Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.Контрагент.Наименование КАК КонтрагентНаименование,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.Договор КАК Договор,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.ИНН КАК ИННКонтрагента,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.КодГНС КАК КодГНС,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.ДатаПоставки КАК ДатаПоставки,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.СерияСФ КАК СерияСФ,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.НомерСФ КАК НомерСФ,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.Дата КАК ДатаВыписки,
	|	СУММА(ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.КоличествоСтрок) КАК КоличествоСтрок,
	|	СУММА(ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.Отгрузка) КАК СтоимостьБезНДС,
	|	СУММА(ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.СуммаНСП) КАК СуммаНСП,
	|	СУММА(ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.ОбщаяСтоимостьСНДС) КАК ОбщаяСтоимостьСНДС,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.КодПоставки КАК КодПоставки,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.СтавкаНДС КАК СтавкаНДС,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.Контрагент.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК КонтрагентСтранаРезидентстваЕАЭС
	|ИЗ
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал КАК ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСписокКонтрагентовСАвансами КАК ВременнаяТаблицаСписокКонтрагентовСАвансами
	|		ПО ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.Договор = ВременнаяТаблицаСписокКонтрагентовСАвансами.Договор
	|ГДЕ
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.Отгрузка <> 0
	|	И НЕ ВременнаяТаблицаСписокКонтрагентовСАвансами.Договор ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.Контрагент,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.Договор,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.ИНН,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.КодГНС,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.ДатаПоставки,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.СерияСФ,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.НомерСФ,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.Дата,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.Контрагент.Наименование,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.КодПоставки,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.СтавкаНДС,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.Контрагент.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контрагент,
	|	Договор,
	|	ДатаПоставки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.Контрагент.НаименованиеПолное КАК КонтрагентНаименование,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.Договор КАК Договор,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.ИНН КАК ИННКонтрагента,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.КодГНС КАК КодГНС,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.ДатаПоставки КАК ДатаПоставки,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.СерияСФ КАК СерияСФ,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.НомерСФ КАК НомерСФ,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.Дата КАК ДатаВыписки,
	|	СУММА(ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.КоличествоСтрок) КАК КоличествоСтрок,
	|	СУММА(ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.Отгрузка) КАК СтоимостьБезНДС,
	|	СУММА(ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.СуммаНСП) КАК СуммаНСП,
	|	СУММА(ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.ОбщаяСтоимостьСНДС) КАК ОбщаяСтоимостьСНДС,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.КодПоставки КАК КодПоставки,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.СтавкаНДС КАК СтавкаНДС,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.Контрагент.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК КонтрагентСтранаРезидентстваЕАЭС
	|ИЗ
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал КАК ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСписокКонтрагентовСАвансами КАК ВременнаяТаблицаСписокКонтрагентовСАвансами
	|		ПО ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.Договор = ВременнаяТаблицаСписокКонтрагентовСАвансами.Договор
	|ГДЕ
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.Отгрузка <> 0
	|	И ВременнаяТаблицаСписокКонтрагентовСАвансами.Договор ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.Контрагент,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.Договор,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.ИНН,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.КодГНС,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.ДатаПоставки,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.СерияСФ,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.НомерСФ,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.Дата,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.КодПоставки,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.СтавкаНДС,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.Контрагент.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВременнаяТаблицаОтгрузкаТекущегоМесяцаФинал.Контрагент.НаименованиеПолное
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контрагент,
	|	Договор,
	|	ДатаПоставки";
	
	Запрос.УстановитьПараметр("НачалоПериода", 	НачалоМесяца(Дата));            
	Запрос.УстановитьПараметр("КонецПериода", 	КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Организация", 	Организация); 
	Запрос.УстановитьПараметр("НСПвСумме", 		НСПвСумме); 
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаДоговор 				= РезультатЗапроса[6].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ТаблицаОтгрузокДоотгрузок	= РезультатЗапроса[7].Выгрузить();
	ТаблицаОтгрузкиБезАвансов	= РезультатЗапроса[8].Выгрузить();	
	
	Пока ВыборкаДоговор.Следующий() Цикл
		Договор 				= ВыборкаДоговор.Договор;
		Контрагент 				= ВыборкаДоговор.Контрагент; 
		АвансыОплатаИтог 		= ВыборкаДоговор.АвансыОплата;
		ТекущаяОтгрузкаОстатокИтог	= 0;
		ТекущаяОплатаОстатокИтог	= 0;
		
		ВыборкаДокумента = ВыборкаДоговор.Выбрать();
		
		// Начало << Доотгрузка
		
		Отбор = Новый Структура;
		Отбор.Вставить("Договор", ВыборкаДоговор.Договор);		
		ТаблицаОтгрузокКонтрагента 	= ТаблицаОтгрузокДоотгрузок.Скопировать(Отбор);
		
		Пока ВыборкаДокумента.Следующий() 
			И АвансыОплатаИтог > 0 
			И ТаблицаОтгрузокКонтрагента.Количество() > 0 
			И ТаблицаОтгрузокКонтрагента.Итог("СтоимостьБезНДС") > 0 Цикл
			
			НоваяСтрокаАванс = ОтчетРеестрПоставок.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаАванс, ВыборкаДокумента);
			НоваяСтрокаАванс.КодПоставки = "111";
			НоваяСтрокаАванс.СерияСФ = ВыборкаДокумента.СтранаАванса;
			НоваяСтрокаАванс.НомерСФ = ВыборкаДокумента.НомерДокументаАванса;
			СтоимостьБезНДСАвансы = 0;
			СуммаНДСАвансы 	= 0;
			СуммаНСПАвансы 	= 0;
			
			ТекущаяОплата = ВыборкаДокумента.АвансыОплата;
			ТекущийОстатокНДС = ВыборкаДокумента.СуммаНДСОстаток;
			ТекущийОстатокНСП = ВыборкаДокумента.СуммаНСПОстаток;
			ПродолжитьОбходТаблицы = Истина;
			Пока ПродолжитьОбходТаблицы Цикл
				Для каждого СтрокаТаблицы Из ТаблицаОтгрузокКонтрагента Цикл
					Если ТекущаяОплата > 0 Тогда	
						НоваяСтрокаДоотгрузки = ОтчетРеестрПоставок.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрокаДоотгрузки, СтрокаТаблицы);
						НоваяСтрокаДоотгрузки.КодПоставки = "112";
						Если ТекущаяОплата >= СтрокаТаблицы.СтоимостьБезНДС Тогда	
							ТекущаяОплата = ТекущаяОплата - СтрокаТаблицы.СтоимостьБезНДС;
							НоваяСтрокаДоотгрузки.СтоимостьБезНДС = -СтрокаТаблицы.СтоимостьБезНДС;
							НоваяСтрокаДоотгрузки.СуммаНДС  = -СтрокаТаблицы.СтоимостьБезНДС * Окр(ВыборкаДокумента.СуммаНДСОстаток / ВыборкаДокумента.АвансыОплата, 2);
							НоваяСтрокаДоотгрузки.СуммаНСП  = -СтрокаТаблицы.СтоимостьБезНДС * Окр(ВыборкаДокумента.СуммаНСПОстаток / ВыборкаДокумента.АвансыОплата, 2);
							НоваяСтрокаДоотгрузки.ОбщаяСтоимостьСНДС  = НоваяСтрокаДоотгрузки.СтоимостьБезНДС	+ НоваяСтрокаДоотгрузки.СуммаНДС + ?(НСПвСумме, НоваяСтрокаДоотгрузки.СуммаНСП, 0);
							СтоимостьБезНДСАвансы = СтоимостьБезНДСАвансы 	+ НоваяСтрокаДоотгрузки.СтоимостьБезНДС;
							СуммаНДСАвансы 	= СуммаНДСАвансы	+ НоваяСтрокаДоотгрузки.СуммаНДС;
							СуммаНСПАвансы 	= СуммаНСПАвансы	+ НоваяСтрокаДоотгрузки.СуммаНСП;							
							ТекущийОстатокНДС 				= ТекущийОстатокНДС - НоваяСтрокаДоотгрузки.СуммаНДС;
							ТекущийОстатокНСП 				= ТекущийОстатокНСП - НоваяСтрокаДоотгрузки.СуммаНСП;							
							ТаблицаОтгрузокКонтрагента.Удалить(СтрокаТаблицы);
						Иначе
							НоваяСтрокаДоотгрузки.СтоимостьБезНДС = -ТекущаяОплата;
							НоваяСтрокаДоотгрузки.СуммаНДС 	= -ТекущийОстатокНДС;
							НоваяСтрокаДоотгрузки.СуммаНСП 	= -ТекущийОстатокНСП;
							НоваяСтрокаДоотгрузки.ОбщаяСтоимостьСНДС  = НоваяСтрокаДоотгрузки.СтоимостьБезНДС	+ НоваяСтрокаДоотгрузки.СуммаНДС + ?(НСПвСумме, НоваяСтрокаДоотгрузки.СуммаНСП, 0);
							СтоимостьБезНДСАвансы = СтоимостьБезНДСАвансы 	+ НоваяСтрокаДоотгрузки.СтоимостьБезНДС;
							СуммаНДСАвансы 	= СуммаНДСАвансы	+ НоваяСтрокаДоотгрузки.СуммаНДС;
							СуммаНСПАвансы 	= СуммаНСПАвансы	+ НоваяСтрокаДоотгрузки.СуммаНСП;							
							СтрокаТаблицы.СтоимостьБезНДС = СтрокаТаблицы.СтоимостьБезНДС - ТекущаяОплата;
							СтрокаТаблицы.СуммаНДС = СтрокаТаблицы.СуммаНДС - ТекущийОстатокНДС;
							СтрокаТаблицы.СуммаНСП = СтрокаТаблицы.СуммаНСП - ТекущийОстатокНСП;
							ТекущаяОплата = 0;
							ПродолжитьОбходТаблицы = Ложь;
							Прервать;
						КонецЕсли;						
						
					Иначе
						ПродолжитьОбходТаблицы = Ложь;
						Прервать;
					КонецЕсли;
				КонецЦикла;		
				Если ТаблицаОтгрузокКонтрагента.Количество() = 0 Тогда
					ПродолжитьОбходТаблицы = Ложь;				
				КонецЕсли;								
			
			КонецЦикла;
			НоваяСтрокаАванс.СтоимостьБезНДС 		= -СтоимостьБезНДСАвансы;
			НоваяСтрокаАванс.СуммаНДС 		= -СуммаНДСАвансы;
			НоваяСтрокаАванс.СуммаНСП 		= -СуммаНСПАвансы;
			НоваяСтрокаАванс.ОбщаяСтоимостьСНДС	= -(СтоимостьБезНДСАвансы + СуммаНДСАвансы + ?(НСПвСумме, СуммаНСПАвансы, 0));
		
		КонецЦикла;
		// Доотгрузка >> Конец
		
		// Остатки не отгрузок после всех доотгрузок по контрагенту
		Для каждого СтрокаТаблицы Из ТаблицаОтгрузокКонтрагента Цикл
			НоваяСтрокаДоотгрузки = ОтчетРеестрПоставок.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаДоотгрузки, СтрокаТаблицы);
			НоваяСтрокаДоотгрузки.СтоимостьБезНДС = СтрокаТаблицы.СтоимостьБезНДС;
			НоваяСтрокаДоотгрузки.СуммаНДС  = СтрокаТаблицы.СуммаНДС;
			НоваяСтрокаДоотгрузки.СуммаНСП  = СтрокаТаблицы.СуммаНСП;
			НоваяСтрокаДоотгрузки.ОбщаяСтоимостьСНДС  = СтрокаТаблицы.СтоимостьБезНДС 	+ СтрокаТаблицы.СуммаНДС + ?(НСПвСумме, СтрокаТаблицы.СуммаНСП, 0);
			НоваяСтрокаДоотгрузки.КодПоставки  = СокрЛП(СтрокаТаблицы.КодПоставки);
		КонецЦикла;	
		
	КонецЦикла;	
	
	// Отгрузка по контрагентам, у которых не было ни одного аванса
	Для каждого СтрокаТаблицы Из ТаблицаОтгрузкиБезАвансов Цикл
		НоваяСтрокаДоотгрузки = ОтчетРеестрПоставок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаДоотгрузки, СтрокаТаблицы);
		НоваяСтрокаДоотгрузки.СтоимостьБезНДС = СтрокаТаблицы.СтоимостьБезНДС;
		НоваяСтрокаДоотгрузки.СуммаНДС  = СтрокаТаблицы.СуммаНДС;
		НоваяСтрокаДоотгрузки.СуммаНСП  = СтрокаТаблицы.СуммаНСП;
		НоваяСтрокаДоотгрузки.ОбщаяСтоимостьСНДС  = СтрокаТаблицы.ОбщаяСтоимостьСНДС;
		НоваяСтрокаДоотгрузки.КодПоставки  = СокрЛП(СтрокаТаблицы.КодПоставки);
	КонецЦикла;
	
	Если ОтчетРеестрПоставок.Количество() = 0 Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'В период ""%1"" нет данных для заполнения отчета ""Реестр поставок""!'"), 
										ПредставлениеПериода(НачалоМесяца(Дата), КонецМесяца(Дата)));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);		
	КонецЕсли;	
КонецПроцедуры // ЗаполнитьТабличнуюЧасть()

// КОНЕЦ УДАЛИТЬ

Процедура РассчитатьИтогиОтчетаРеестрПоставок() Экспорт
	ИтогоПоРееструБНДС      		= 0;
	ИтогоПоРееструНДС       		= 0;
	ИтогоПоРееструОбщаяСтоимость  	= 0;
	
	// ОБЛАГАЕМЫЕ ПОСТАВКИ 
	ИтогоСуммаБНДСОбл			= 0;
	ИтогоСуммаНДСОбл			= 0;
	ИтогоОбщаяСтоимостьОбл		= 0;
	
	// С кодом поставки 102 
	ИтогоСуммаБНДСОбл_102		= 0;
	ИтогоСуммаНДСОбл_102		= 0;
	ИтогоОбщаяСтоимостьОбл_102	= 0;
	
	ИтогоСуммаБНДСНул		= 0;
	ИтогоСуммаБНДСОблЕАЭС	= 0;
	ИтогоСуммаБНДСОСВ		= 0;
	
	ТаблицаСтавок = УчетНДСВызовСервера.ПолучитьСтавкиНДССНулевымиЗначениями(Дата);
	СтруктураПоиска = Новый Структура();
	СтруктураПоиска.Вставить("СтавкаНДС", Справочники.СтавкиНДС.ПустаяСсылка());
	
	Для каждого СтрокаТабличнойЧасти Из ОтчетРеестрПоставок Цикл
		СтруктураПоиска.СтавкаНДС = СтрокаТабличнойЧасти.СтавкаНДС;
		МассивСтавок = ТаблицаСтавок.НайтиСтроки(СтруктураПоиска);
		
		Если МассивСтавок.Количество() = 0 Тогда
				ИтогоСуммаБНДСОбл      	= ИтогоСуммаБНДСОбл + СтрокаТабличнойЧасти.СтоимостьБезНДС;
				ИтогоСуммаНДСОбл      	= ИтогоСуммаНДСОбл + СтрокаТабличнойЧасти.СуммаНДС;
				ИтогоОбщаяСтоимостьОбл	= ИтогоОбщаяСтоимостьОбл + СтрокаТабличнойЧасти.СтоимостьБезНДС + СтрокаТабличнойЧасти.СуммаНДС; 
				
				Если СтрокаТабличнойЧасти.КодПоставки = "102" Тогда
					ИтогоСуммаБНДСОбл_102      	= ИтогоСуммаБНДСОбл_102 + СтрокаТабличнойЧасти.СтоимостьБезНДС;
					ИтогоСуммаНДСОбл_102      	= ИтогоСуммаНДСОбл_102 + СтрокаТабличнойЧасти.СуммаНДС;
					ИтогоОбщаяСтоимостьОбл_102	= ИтогоОбщаяСтоимостьОбл_102 + СтрокаТабличнойЧасти.СтоимостьБезНДС + СтрокаТабличнойЧасти.СуммаНДС;	
				КонецЕсли;	
				
		ИначеЕсли МассивСтавок.Количество() > 0 И СтрокаТабличнойЧасти.СтавкаНДС <> Справочники.СтавкиНДС.Нулевая Тогда
			ИтогоСуммаБНДСОСВ = ИтогоСуммаБНДСОСВ + СтрокаТабличнойЧасти.СтоимостьБезНДС;	
		КонецЕсли;
		
		Если СтрокаТабличнойЧасти.СтавкаНДС = Справочники.СтавкиНДС.Нулевая Тогда
			ИтогоСуммаБНДСНул 		= ИтогоСуммаБНДСНул + СтрокаТабличнойЧасти.СтоимостьБезНДС;
			
			Если СтрокаТабличнойЧасти.КонтрагентСтранаРезидентстваЕАЭС Тогда
				ИтогоСуммаБНДСОблЕАЭС = ИтогоСуммаБНДСОблЕАЭС + СтрокаТабличнойЧасти.СтоимостьБезНДС;
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;
	
	ИтогоПоРееструБНДС      		= ИтогоСуммаБНДСОбл + ИтогоСуммаБНДСНул + ИтогоСуммаБНДСОСВ;
	ИтогоПоРееструНДС       		= ИтогоСуммаНДСОбл;
	ИтогоПоРееструОбщаяСтоимость	= ИтогоОбщаяСтоимостьОбл + ИтогоСуммаБНДСНул;
	
	НоваяСтрокаИтогов = ОтчетРеестрПоставокИтоги.Добавить();
	НоваяСтрокаИтогов.Содержание 			= НСтр("ru = 'ВСЕГО ПО РЕЕСТРУ в том числе:'");
	НоваяСтрокаИтогов.СтоимостьБезНДС 		= ИтогоПоРееструБНДС;
	НоваяСтрокаИтогов.СуммаНДС 				= ИтогоПоРееструНДС;
	НоваяСтрокаИтогов.ОбщаяСтоимостьСНДС 	= ИтогоПоРееструОбщаяСтоимость;
	
	НоваяСтрокаИтогов = ОтчетРеестрПоставокИтоги.Добавить();
	НоваяСтрокаИтогов.Содержание 			= НСтр("ru = '1) ОБЛАГАЕМЫЕ ПОСТАВКИ'");
	НоваяСтрокаИтогов.СтоимостьБезНДС 		= ИтогоСуммаБНДСОбл;
	НоваяСтрокаИтогов.СуммаНДС 				= ИтогоСуммаНДСОбл;
	НоваяСтрокаИтогов.ОбщаяСтоимостьСНДС 	= ИтогоОбщаяСтоимостьОбл;
		
	НоваяСтрокаИтогов = ОтчетРеестрПоставокИтоги.Добавить();
	НоваяСтрокаИтогов.Содержание 			= НСтр("ru = 'в том числе ПОСТАВКА ТОВАРОВ ПРОМЫШЛЕННОЙ ПЕРЕРАБОТКИ СЕЛЬСКОХОЗЯЙСТВЕННОЙ ПРОДУКЦИИ (с кодом поставки 102)'");
	НоваяСтрокаИтогов.СтоимостьБезНДС 		= ИтогоСуммаБНДСОбл_102;
	НоваяСтрокаИтогов.СуммаНДС 				= ИтогоСуммаНДСОбл_102;
	НоваяСтрокаИтогов.ОбщаяСтоимостьСНДС 	= ИтогоОбщаяСтоимостьОбл_102;		
	
	НоваяСтрокаИтогов = ОтчетРеестрПоставокИтоги.Добавить();
	НоваяСтрокаИтогов.Содержание 			= НСтр("ru = '2) НУЛЕВЫЕ ПОСТАВКИ'");
	НоваяСтрокаИтогов.СтоимостьБезНДС 		= ИтогоСуммаБНДСНул;
	НоваяСтрокаИтогов.СуммаНДС 				= 0;
	НоваяСтрокаИтогов.ОбщаяСтоимостьСНДС 	= ИтогоСуммаБНДСНул;
	
	НоваяСтрокаИтогов = ОтчетРеестрПоставокИтоги.Добавить();
	НоваяСтрокаИтогов.Содержание 			= НСтр("ru = 'в том числе: в государства - члены Евразийского экономического союза'");
	НоваяСтрокаИтогов.СтоимостьБезНДС 		= ИтогоСуммаБНДСОблЕАЭС;
	НоваяСтрокаИтогов.СуммаНДС 				= 0;
	НоваяСтрокаИтогов.ОбщаяСтоимостьСНДС 	= ИтогоСуммаБНДСОблЕАЭС;

	НоваяСтрокаИтогов = ОтчетРеестрПоставокИтоги.Добавить();
	НоваяСтрокаИтогов.Содержание 			= НСтр("ru = '3) ОСВОБОЖДЕННЫЕ И НЕОБЛАГАЕМЫЕ ПОСТАВКИ'");
	НоваяСтрокаИтогов.СтоимостьБезНДС 		= ИтогоСуммаБНДСОСВ;
	НоваяСтрокаИтогов.СуммаНДС 				= 0;
	НоваяСтрокаИтогов.ОбщаяСтоимостьСНДС 	= 0;
		
КонецПроцедуры

// Процедура заполняет табличную часть
//
Процедура ЗаполнитьТабличнуюЧастьОтчетРеестрПриобретенных(НалоговыйКонтракт, НеУчитыватьЗакупкиБезНДС) Экспорт
	
	КоэффициентОблагаемыхПоставок = ПолучитьКоэффициентОблагаемыхПоставок();
		
	Запрос = Новый Запрос;
	Запрос.Текст =  
		"ВЫБРАТЬ
		|	РеестрПриобретенныхМатериальныхРесурсов.КонтрагентНаименование КАК КонтрагентНаименование,
		|	РеестрПриобретенныхМатериальныхРесурсов.ИННКонтрагента КАК ИННКонтрагента,
		|	РеестрПриобретенныхМатериальныхРесурсов.КодГНСКонтрагента КАК КодГНС,
		|	РеестрПриобретенныхМатериальныхРесурсов.СерияБланкаСФ КАК СерияСФ,
		|	РеестрПриобретенныхМатериальныхРесурсов.НомерБланкаСФ КАК НомерСФ,
		|	РеестрПриобретенныхМатериальныхРесурсов.КорСерияБланкаСФ КАК КорСерияСФ,
		|	РеестрПриобретенныхМатериальныхРесурсов.КорНомерБланкаСФ КАК КорНомерСФ,
		|	РеестрПриобретенныхМатериальныхРесурсов.ДатаПоставки КАК ДатаПоставки,
		|	СУММА(РеестрПриобретенныхМатериальныхРесурсов.Сумма) КАК СтоимостьБезНДС,
		|	СУММА(ВЫБОР
		|			КОГДА РеестрПриобретенныхМатериальныхРесурсов.ЗачетНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Себестоимость)
		|				ТОГДА 0
		|			ИНАЧЕ РеестрПриобретенныхМатериальныхРесурсов.СуммаНДС
		|		КОНЕЦ) КАК СуммаНДС,
		|	СУММА(ВЫБОР
		|			КОГДА РеестрПриобретенныхМатериальныхРесурсов.ЗачетНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Зачет)
		|				ТОГДА РеестрПриобретенныхМатериальныхРесурсов.СуммаНДС
		|			КОГДА РеестрПриобретенныхМатериальныхРесурсов.ЗачетНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Себестоимость)
		|				ТОГДА 0
		|			КОГДА РеестрПриобретенныхМатериальныхРесурсов.ЗачетНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Распределение)
		|				ТОГДА РеестрПриобретенныхМатериальныхРесурсов.СуммаНДС * &КоэффициентОблПост
		|		КОНЕЦ) КАК СуммаПодлежащаяКЗачетуНДС
		|ИЗ
		|	РегистрСведений.РеестрПриобретенныхМатериальныхРесурсов КАК РеестрПриобретенныхМатериальныхРесурсов
		|ГДЕ
		|	РеестрПриобретенныхМатериальныхРесурсов.Организация = &Организация
		|	И РеестрПриобретенныхМатериальныхРесурсов.ДатаПоставки МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ВЫБОР
		|		КОГДА &НеУчитыватьЗакупкиБезНДС
		|			ТОГДА РеестрПриобретенныхМатериальныхРесурсов.СуммаНДС <> 0
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	РеестрПриобретенныхМатериальныхРесурсов.КорНомерБланкаСФ,
		|	РеестрПриобретенныхМатериальныхРесурсов.СерияБланкаСФ,
		|	РеестрПриобретенныхМатериальныхРесурсов.ИННКонтрагента,
		|	РеестрПриобретенныхМатериальныхРесурсов.ДатаПоставки,
		|	РеестрПриобретенныхМатериальныхРесурсов.КонтрагентНаименование,
		|	РеестрПриобретенныхМатериальныхРесурсов.КодГНСКонтрагента,
		|	РеестрПриобретенныхМатериальныхРесурсов.НомерБланкаСФ,
		|	РеестрПриобретенныхМатериальныхРесурсов.КорСерияБланкаСФ";
	Запрос.УстановитьПараметр("НачалоПериода", 				НачалоМесяца(Дата));            
	Запрос.УстановитьПараметр("КонецПериода", 				КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Организация", 				Организация);
	Запрос.УстановитьПараметр("КоэффициентОблПост", 		КоэффициентОблагаемыхПоставок);
	Запрос.УстановитьПараметр("НеУчитыватьЗакупкиБезНДС", 	НеУчитыватьЗакупкиБезНДС);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если НалоговыйКонтракт Тогда		
		Пока Выборка.Следующий() Цикл		
			СтрокаТабличнойЧасти = ОтчетРеестрПриобретенныхНаОсновеНалоговогоКонтракта.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, Выборка);		
		КонецЦикла;	
		
		Если ОтчетРеестрПриобретенныхНаОсновеНалоговогоКонтракта.Количество() = 0 Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru = 'В период ""%1"" нет данных для заполнения отчета ""Реестр приобретенных на осн. налогового контракта""!'"), 
											ПредставлениеПериода(НачалоМесяца(Дата), КонецМесяца(Дата)));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);		
		КонецЕсли;
		
	Иначе
		Пока Выборка.Следующий() Цикл		
			СтрокаТабличнойЧасти = ОтчетРеестрПриобретенныхМатРессурсов.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, Выборка);			
		КонецЦикла;
		
		Если ОтчетРеестрПриобретенныхМатРессурсов.Количество() = 0 Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru = 'В период ""%1"" нет данных для заполнения отчета ""Реестр приобретенных материальных рессурсов""!'"), 
											ПредставлениеПериода(НачалоМесяца(Дата), КонецМесяца(Дата)));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);		
		КонецЕсли;
		
	КонецЕсли;	
КонецПроцедуры // ЗаполнитьТабличнуюЧасть()

// УДАЛИТЬ

// Процедура заполняет табличную часть
//
Процедура Старая_ЗаполнитьТабличнуюЧастьОтчетРеестрПриобретенных() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =  
	"ВЫБРАТЬ
	|	ПоступленияОбороты.Контрагент.НаименованиеПолное КАК КонтрагентНаименование,
	|	ПоступленияОбороты.Контрагент.ИНН КАК ИННКонтрагента,
	|	ПоступленияОбороты.ПериодСекунда КАК ДатаПоставки,
	|	ПоступленияОбороты.Контрагент.ГНС.Код КАК КодГНС,
	|	ПоступленияОбороты.СуммаНДСОборот КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ПоступленияОбороты.Договор.СуммаВключаетНалоги
	|			ТОГДА ПоступленияОбороты.СуммаОборот - ПоступленияОбороты.СуммаНДСОборот - ПоступленияОбороты.СуммаНСПОборот
	|		ИНАЧЕ ПоступленияОбороты.СуммаОборот
	|	КОНЕЦ КАК СтоимостьБезНДС,
	|	ВЫБОР
	|		КОГДА ПоступленияОбороты.ЗачетНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Зачет)
	|				ИЛИ ПоступленияОбороты.ЗачетНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.ПустаяСсылка)
	|			ТОГДА ПоступленияОбороты.СуммаНДСОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаПодлежащаяКЗачетуНДС,
	|	ЕСТЬNULL(СчетаФактурыПолученные.СерияБланкаСФ, СведенияОПоступлении.СерияБланкаСФ) КАК СерияСФ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СчетаФактурыПолученные.СерияБланкаСФ, СведенияОПоступлении.СерияБланкаСФ) = ""ДПБУ""
	|			ТОГДА ВЫБОР
	|					КОГДА СведенияОПоступлении.ДокументСсылка ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|						ТОГДА ВЫРАЗИТЬ(СведенияОПоступлении.ДокументСсылка КАК Документ.ПоступлениеТоваровУслуг).Номер
	|					КОГДА СведенияОПоступлении.ДокументСсылка ССЫЛКА Документ.АвансовыйОтчет
	|						ТОГДА ВЫРАЗИТЬ(СведенияОПоступлении.ДокументСсылка КАК Документ.АвансовыйОтчет).Номер
	|					КОГДА СведенияОПоступлении.ДокументСсылка ССЫЛКА Документ.ДополнительныеРасходы
	|						ТОГДА ВЫРАЗИТЬ(СведенияОПоступлении.ДокументСсылка КАК Документ.ДополнительныеРасходы).Номер
	|					КОГДА СведенияОПоступлении.ДокументСсылка ССЫЛКА Документ.ВозвратТоваровПоставщику
	|						ТОГДА ВЫРАЗИТЬ(СведенияОПоступлении.ДокументСсылка КАК Документ.ВозвратТоваровПоставщику).Номер
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ЕСТЬNULL(СчетаФактурыПолученные.НомерБланкаСФ, СведенияОПоступлении.НомерБланкаСФ)
	|	КОНЕЦ КАК НомерСФ,
	|	ВЫБОР
	|		КОГДА СведенияОПоступлении.ДокументСсылка ССЫЛКА Документ.ВозвратТоваровПоставщику
	|			ТОГДА ВЫБОР
	|					КОГДА ВЫРАЗИТЬ(СведенияОПоступлении.ДокументСсылка КАК Документ.ВозвратТоваровПоставщику).СерияБланкаСФ = """"
	|						ТОГДА СчетаФактурыПолученные.СерияБланкаСФ
	|					ИНАЧЕ ВЫРАЗИТЬ(СведенияОПоступлении.ДокументСсылка КАК Документ.ВозвратТоваровПоставщику).СерияБланкаСФ
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КорСерияБланкаСФ,
	|	ВЫБОР
	|		КОГДА СведенияОПоступлении.ДокументСсылка ССЫЛКА Документ.ВозвратТоваровПоставщику
	|			ТОГДА ВЫБОР
	|					КОГДА ВЫРАЗИТЬ(СведенияОПоступлении.ДокументСсылка КАК Документ.ВозвратТоваровПоставщику).НомерБланкаСФ = """"
	|						ТОГДА СчетаФактурыПолученные.НомерБланкаСФ
	|					ИНАЧЕ ВЫРАЗИТЬ(СведенияОПоступлении.ДокументСсылка КАК Документ.ВозвратТоваровПоставщику).НомерБланкаСФ
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КорНомерБланкаСФ
	|ИЗ
	|	РегистрНакопления.ПоступлениеТоваров.Обороты(&НачалоПериода, &КонецПериода, Авто, &Организация = Организация) КАК ПоступленияОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОПоступлении КАК СведенияОПоступлении
	|		ПО ПоступленияОбороты.Регистратор = СведенияОПоступлении.ДокументСсылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаФактурыПолученные КАК СчетаФактурыПолученные
	|		ПО ПоступленияОбороты.Регистратор = СчетаФактурыПолученные.Документ
	|ГДЕ
	|	СведенияОПоступлении.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПоставки";
	
	Запрос.УстановитьПараметр("НачалоПериода", 	НачалоМесяца(Дата));            
	Запрос.УстановитьПараметр("КонецПериода", 	КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Организация", 	Организация); 
	
	ОтчетРеестрПриобретенныхМатРессурсов.Загрузить(Запрос.Выполнить().Выгрузить());
		
	Если ОтчетРеестрПриобретенныхМатРессурсов.Количество() = 0 Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'В период ""%1"" нет данных для заполнения отчета ""Реестр приобретенных материальных рессурсов""!'"), 
										ПредставлениеПериода(НачалоМесяца(Дата), КонецМесяца(Дата)));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);		
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьТабличнуюЧасть()

// КОНЕЦ УДАЛИТЬ

Процедура РассчитатьИтогиОтчетаРеестрПриобретенных() Экспорт
	ИтогоПоРееструБНДС      = 0; 	
	ИтогоПоРееструНДС       = 0; 	
	ИтогоПоРееструНДСЗАчет  = 0;
	
	Для каждого СтрокаТабличнойЧасти Из ОтчетРеестрПриобретенныхМатРессурсов Цикл	
		ИтогоПоРееструБНДС      = ИтогоПоРееструБНДС 	   + СтрокаТабличнойЧасти.СтоимостьБезНДС;
		ИтогоПоРееструНДС       = ИтогоПоРееструНДС  	   + СтрокаТабличнойЧасти.СуммаНДС;
		ИтогоПоРееструНДСЗачет  = ИтогоПоРееструНДСЗачет   + СтрокаТабличнойЧасти.СуммаПодлежащаяКЗачетуНДС;		
	КонецЦикла;
	
	НоваяСтрокаИтогов = ОтчетРеестрПриобретенныхМатРессурсовИтоги.Добавить();
	НоваяСтрокаИтогов.Содержание 				= НСтр("ru = 'ВСЕГО ПО РЕЕСТРУ :'");
	НоваяСтрокаИтогов.СтоимостьБезНДС 			= ИтогоПоРееструБНДС;
	НоваяСтрокаИтогов.СуммаНДС 					= ИтогоПоРееструНДС;
	НоваяСтрокаИтогов.СуммаПодлежащаяКЗачетуНДС = ИтогоПоРееструНДСЗачет;
		
КонецПроцедуры

// Процедура заполняет табличную часть "ОтчетРеестрВвезенных"
//
Процедура ЗаполнитьТабличнуюЧастьОтчетРеестрВвезенных(НеУчитыватьЗакупкиБезНДС) Экспорт

	КоэффициентОблагаемыхПоставок = ПолучитьКоэффициентОблагаемыхПоставок();
	
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА РеестрВвезенныхОбороты.Контрагент.НаименованиеПолное <> """"
		|			ТОГДА РеестрВвезенныхОбороты.Контрагент.НаименованиеПолное
		|		ИНАЧЕ РеестрВвезенныхОбороты.Контрагент.Наименование
		|	КОНЕЦ КАК Контрагент,
		|	РеестрВвезенныхОбороты.Контрагент.СтранаРезидентства.Код КАК КодСтраныКонтрагента,
		|	РеестрВвезенныхОбороты.Номер КАК ГТДНомер,
		|	РеестрВвезенныхОбороты.ПериодДень КАК ГТДДата,
		|	СУММА(РеестрВвезенныхОбороты.СуммаНДСОборот) КАК ГТДСуммаНДС,
		|	СУММА(РеестрВвезенныхОбороты.СуммаОборот) КАК ГТДСуммаБезНДС,
		|	СУММА(ВЫБОР
		|			КОГДА РеестрВвезенныхОбороты.ЗачетНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Зачет)
		|				ТОГДА РеестрВвезенныхОбороты.СуммаНДСОборот
		|			КОГДА РеестрВвезенныхОбороты.ЗачетНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Себестоимость)
		|				ТОГДА 0
		|			КОГДА РеестрВвезенныхОбороты.ЗачетНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Распределение)
		|				ТОГДА РеестрВвезенныхОбороты.СуммаНДСОборот * &КоэффициентОблПост
		|		КОНЕЦ) КАК НДСЗачет,
		|	ВЫБОР
		|		КОГДА РеестрВвезенныхОбороты.Контрагент.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК КонтрагентСтранаРезидентстваЕАЭС
		|ИЗ
		|	РегистрНакопления.ДанныеДляОтчетаРеестрВвезенных.Обороты(&НачалоПериода, &КонецПериода, Авто, Организация = &Организация) КАК РеестрВвезенныхОбороты
		|ГДЕ
		|	ВЫБОР
		|		КОГДА &НеУчитыватьЗакупкиБезНДС
		|			ТОГДА РеестрВвезенныхОбороты.СуммаНДСОборот <> 0
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА РеестрВвезенныхОбороты.Контрагент.НаименованиеПолное <> """"
		|			ТОГДА РеестрВвезенныхОбороты.Контрагент.НаименованиеПолное
		|		ИНАЧЕ РеестрВвезенныхОбороты.Контрагент.Наименование
		|	КОНЕЦ,
		|	РеестрВвезенныхОбороты.Контрагент.СтранаРезидентства.Код,
		|	РеестрВвезенныхОбороты.Номер,
		|	РеестрВвезенныхОбороты.ПериодДень,
		|	ВЫБОР
		|		КОГДА РеестрВвезенныхОбороты.Контрагент.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ";
	Запрос.УстановитьПараметр("НачалоПериода", 				НачалоМесяца(Дата));            
	Запрос.УстановитьПараметр("КонецПериода", 				КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Организация", 				Организация);
	Запрос.УстановитьПараметр("КоэффициентОблПост", 		КоэффициентОблагаемыхПоставок);
	Запрос.УстановитьПараметр("НеУчитыватьЗакупкиБезНДС", 	НеУчитыватьЗакупкиБезНДС);
	
	ОтчетРеестрВвезенныхМатериальныхРесурсовВКР.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Если ОтчетРеестрВвезенныхМатериальныхРесурсовВКР.Количество() = 0 Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'В период ""%1"" нет данных для заполнения отчета ""Реестр ГТД""!'"), 
										ПредставлениеПериода(НачалоМесяца(Дата), КонецМесяца(Дата)));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);		
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьКоэффициентОблагаемыхПоставок()

	ДанныеУчетнойПолитики = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьДанныеУчетнойПолитикиОрганизаций(Дата, Организация);
	
	СтрокаОтчета = ОтчетОсновной.Найти("053", "Строка");
	
	Если СтрокаОтчета <> Неопределено Тогда
		Сумма053 = СтрокаОтчета.Сумма;
	Иначе
		Сумма053 = 0;
	КонецЕсли;
	
	СтрокаОтчета = ОтчетОсновной.Найти("054", "Строка");
	
	Если СтрокаОтчета <> Неопределено Тогда
		Сумма054 = СтрокаОтчета.Сумма;
	Иначе
		Сумма054 = 0;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗакрытиеМесяцаДоотгрузка.Контрагент КАК Контрагент,
		|	ЗакрытиеМесяцаДоотгрузка.Договор КАК Договор,
		|	СУММА(ЗакрытиеМесяцаДоотгрузка.Сумма) КАК Сумма,
		|	СУММА(ЗакрытиеМесяцаДоотгрузка.СуммаНДС) КАК СуммаНДС,
		|	СУММА(ЗакрытиеМесяцаДоотгрузка.СуммаНСП) КАК СуммаНСП
		|ИЗ
		|	Документ.ЗакрытиеМесяца.ДоотгрузкаРасшифровка КАК ЗакрытиеМесяцаДоотгрузка
		|ГДЕ
		|	НЕ ЗакрытиеМесяцаДоотгрузка.Ссылка.ПометкаУдаления
		|	И ЗакрытиеМесяцаДоотгрузка.Ссылка.Дата = &Дата
		|	И ЗакрытиеМесяцаДоотгрузка.Ссылка.Организация = &Организация
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗакрытиеМесяцаДоотгрузка.Контрагент,
		|	ЗакрытиеМесяцаДоотгрузка.Договор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗакрытиеМесяцаАвансы.СтавкаНДС КАК СтавкаНДС,
		|	ЗакрытиеМесяцаАвансы.СуммаДокумента КАК СуммаДокумента,
		|	ЗакрытиеМесяцаАвансы.Сумма КАК Сумма,
		|	ЗакрытиеМесяцаАвансы.СуммаНДС КАК СуммаНДС,
		|	ЗакрытиеМесяцаАвансы.СуммаНСП КАК СуммаНСП
		|ИЗ
		|	Документ.ЗакрытиеМесяца.АвансыРасшифровка КАК ЗакрытиеМесяцаАвансы
		|ГДЕ
		|	НЕ ЗакрытиеМесяцаАвансы.Ссылка.ПометкаУдаления
		|	И ЗакрытиеМесяцаАвансы.Ссылка.Дата = &Дата
		|	И ЗакрытиеМесяцаАвансы.Ссылка.Организация = &Организация";				
	Запрос.УстановитьПараметр("Организация", 	Организация);	
	Запрос.УстановитьПараметр("Дата", 			КонецМесяца(Дата));
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ПараметрыРасчета = Новый Структура;
	
	СуммаДоотгрузки 	= 0;
	СуммаНДСДоотгрузки 	= 0;
	СуммаНСПДоотгрузки 	= 0;
	
	ПараметрыРасчета.Вставить("Таблица", МассивРезультатов[0].Выгрузить());
	СуммаДоотгрузки 	= УчетНДСВызовСервера.РасчетСуммыОтчетаНДС("СуммаДоотгрузки", 	 ПараметрыРасчета).РезультатРасчета;
	СуммаНДСДоотгрузки 	= УчетНДСВызовСервера.РасчетСуммыОтчетаНДС("СуммаНДСДоотгрузки", ПараметрыРасчета).РезультатРасчета;
	СуммаНСПДоотгрузки 	= УчетНДСВызовСервера.РасчетСуммыОтчетаНДС("СуммаНСПДоотгрузки", ПараметрыРасчета).РезультатРасчета;
	
	СуммаАвансы 	= 0;
	СуммаНДСАвансы 	= 0;
	СуммаНСПАвансы 	= 0;
	
	ПараметрыРасчета.Таблица = МассивРезультатов[1].Выгрузить();
	СуммаАвансы 	= УчетНДСВызовСервера.РасчетСуммыОтчетаНДС("СуммаАвансы", 	 ПараметрыРасчета).РезультатРасчета;
	СуммаНДСАвансы 	= УчетНДСВызовСервера.РасчетСуммыОтчетаНДС("СуммаНДСАвансы", ПараметрыРасчета).РезультатРасчета;
	СуммаНСПАвансы 	= УчетНДСВызовСервера.РасчетСуммыОтчетаНДС("СуммаНСПАвансы", ПараметрыРасчета).РезультатРасчета;
	
	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("ПороговыйПроцентОсвобожденныхПоставок", 	ДанныеУчетнойПолитики.ПороговыйПроцентОсвобожденныхПоставок);
	ПараметрыРасчета.Вставить("Сумма053", 								Сумма053);
	ПараметрыРасчета.Вставить("Сумма054", 								Сумма054);
	ПараметрыРасчета.Вставить("СуммаАвансы", 							СуммаАвансы);
	ПараметрыРасчета.Вставить("СуммаНДСАвансы", 						СуммаНДСАвансы);
	ПараметрыРасчета.Вставить("СуммаНСПАвансы", 						СуммаНСПАвансы);
	ПараметрыРасчета.Вставить("СуммаДоотгрузки", 						СуммаДоотгрузки); 
	ПараметрыРасчета.Вставить("СуммаНДСДоотгрузки", 					СуммаНДСДоотгрузки);
	ПараметрыРасчета.Вставить("СуммаНСПДоотгрузки", 					СуммаНСПДоотгрузки);
	КоэффициентОсвобожденныхПоставокРасчетный = УчетНДСВызовСервера.РасчетСуммыОтчетаНДС("КоэффициентОсвобожденныхПоставокРасчетный", ПараметрыРасчета).РезультатРасчета;
	
	Возврат 1 - КоэффициентОсвобожденныхПоставокРасчетный;

КонецФункции // ПолучитьКоэффициентОблагаемыхПоставок()

#КонецОбласти

#КонецЕсли