
#Область ОбработчикиСобытийЭлементовШапкиФормы

// Процедура - обработчик события ПриИзменении поля ввода Банк.
//
&НаКлиенте
Процедура БанкПриИзменении(Элемент)
	УстановитьПредставлениеСчета();
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода НомерСчета.
//
&НаКлиенте
Процедура НомерСчетаПриИзменении(Элемент)
	УстановитьПредставлениеСчета();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьПредставлениеСчета()

	Если ЗначениеЗаполнено(Объект.НомерСчета) И ЗначениеЗаполнено(Объект.НомерСчета) Тогда
		Объект.Наименование = СтрШаблон(НСтр("ru = '%1, в %2'"), Строка(Объект.НомерСчета), Строка(Объект.Банк));
	КонецЕсли;

КонецПроцедуры

#КонецОбласти