#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;		
	КонецЕсли;

	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Справочники.Организации.ДополнитьДанныеЗаполненияПриОднофирменномУчете(ДанныеЗаполнения);

	Если ДанныеЗаполнения = Неопределено Тогда
		ДанныеЗаполнения = Новый Структура;
		ДанныеЗаполнения.Вставить("Период", НачалоМесяца(ТекущаяДатаСеанса()));
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
		И НЕ ДанныеЗаполнения.Свойство("Период") Тогда 
		ДанныеЗаполнения.Вставить("Период", НачалоМесяца(ТекущаяДатаСеанса()));
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если Запись.СтавкаПрофВзнос <> 0 Тогда
			ПроверяемыеРеквизиты.Добавить("СчетУчетаРасчетовПрофВзнос");
		КонецЕсли;
	КонецЦикла
КонецПроцедуры

#КонецОбласти
	
#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли