
// Рассчитывает сумму в строке табличной части документа при поступлении
//
// Параметры:
//  СтрокаТабличнойЧасти - строка табличной части документа
//
Процедура РассчитатьСуммуСтрокиТабличнойЧастиПоступление(
	СтрокаТабличнойЧасти, 
	Период, 
	СтавкаНДС = Неопределено, 
	СтавкаНСП = Неопределено, 
	БезналичныйРасчет = Ложь, 
	СуммаАкциза = 0, 
	Знач КурсДокумента = 1, 
	Знач КратностьДокумента = 1) Экспорт
	
	ЗначениеСтавкиНДС = УчетНДСВызовСервера.ПолучитьСтавкуНДС(Период, СтавкаНДС);
	ЗначениеСтавкиНСП = ?(БезналичныйРасчет, 0 ,УчетНДСВызовСервера.ПолучитьСтавкуНСП(Период, СтавкаНДС, СтавкаНСП));
	
	КратностьДокумента = ?(КратностьДокумента = 0, 1, КратностьДокумента); 
	СтрокаТабличнойЧасти.Сумма = ((СтрокаТабличнойЧасти.Всего * КурсДокумента / КратностьДокумента) + СуммаАкциза) * 100 /	(100 + ЗначениеСтавкиНДС + ЗначениеСтавкиНСП);
	
КонецПроцедуры

// Расчет, исходя из постоянной суммы
//
// Параметры:
//  СтрокаТабличнойЧасти - строка табличной части документа.
//
Процедура РассчитатьСуммуНДССтрокиТабличнойЧастиПоступление(
	СтрокаТабличнойЧасти, 
	Период, 
	СтавкаНДС = Неопределено, 
	СтавкаНСП = Неопределено, 
	БезналичныйРасчет = Ложь, 
	СуммаАкциза = 0,
	Знач КурсДокумента = 1, 
	Знач КратностьДокумента = 1) Экспорт
	
	ЗначениеСтавкиНДС = УчетНДСВызовСервера.ПолучитьСтавкуНДС(Период, СтавкаНДС);
	ЗначениеСтавкиНСП = ?(БезналичныйРасчет, 0 ,УчетНДСВызовСервера.ПолучитьСтавкуНСП(Период, СтавкаНДС, СтавкаНСП));
	
	КратностьДокумента = ?(КратностьДокумента = 0, 1, КратностьДокумента); 
	СтрокаТабличнойЧасти.СуммаНДС = УчетНДСКлиентСервер.РассчитатьСуммуНДСПоступления(
		((СтрокаТабличнойЧасти.Всего * КурсДокумента / КратностьДокумента) + СуммаАкциза),
		ЗначениеСтавкиНДС,
		ЗначениеСтавкиНСП);
		
КонецПроцедуры

// Расчет, исходя из постоянной суммы
//
// Параметры:
//  СтрокаТабличнойЧасти - строка табличной части документа.
//
Процедура РассчитатьСуммуНСПСтрокиТабличнойЧастиПоступление(
	СтрокаТабличнойЧасти, 
	СуммаАкциза = 0,
	Знач КурсДокумента = 1, 
	Знач КратностьДокумента = 1) Экспорт
	
	КратностьДокумента = ?(КратностьДокумента = 0, 1, КратностьДокумента); 
	СтрокаТабличнойЧасти.СуммаНСП = ((СтрокаТабличнойЧасти.Всего * КурсДокумента / КратностьДокумента) + СуммаАкциза) - СтрокаТабличнойЧасти.Сумма - СтрокаТабличнойЧасти.СуммаНДС;
КонецПроцедуры

// Рассчитывает сумму налогов в строке табличной части документа
//
// Параметры:
//  СтрокаТабличнойЧасти 	- Структура или СтрокаТабличнойЧасти - Строка табличной части документа.
//  Период					- Дата - Период расчета
//  СуммаВключаетНалоги	 	- Булево - Признак расчета суммы НДС и НСП
//  СтавкаНДС			 	- СправочникСсылка.СтавкиНДС - Ссылка на справочник ставки НДС для расчета
//  СтавкаНСП			 	- СправочникСсылка.СтавкиНСП - Ссылка на справочник ставки НСП для расчета
//  БезналичныйРасчет	 	- Булево - Признак безналичного расчета
//
Процедура РассчитатьСуммыНалоговСтрокиТабличнойЧастиПоступление(
	СтрокаТабличнойЧасти, 
	Период, 
	СтавкаНДС = Неопределено, 
	СтавкаНСП = Неопределено, 
	БезналичныйРасчет = Ложь, 
	СуммаАкциза = 0,
	Знач КурсДокумента = 1, 
	Знач КратностьДокумента = 1) Экспорт

	ЗначениеСтавкиНДС = УчетНДСВызовСервера.ПолучитьСтавкуНДС(Период, СтавкаНДС);
	ЗначениеСтавкиНСП = ?(БезналичныйРасчет, 0, УчетНДСВызовСервера.ПолучитьСтавкуНСП(Период, СтавкаНДС, СтавкаНСП));
	
	КратностьДокумента = ?(КратностьДокумента = 0, 1, КратностьДокумента); 
	СтрокаТабличнойЧасти.СуммаНДС = УчетНДСКлиентСервер.РассчитатьСуммуНДСПоступления(
		((СтрокаТабличнойЧасти.Всего * КурсДокумента / КратностьДокумента) + СуммаАкциза),
		ЗначениеСтавкиНДС,
		ЗначениеСтавкиНСП);
										
	СтрокаТабличнойЧасти.СуммаНСП = ((СтрокаТабличнойЧасти.Всего * КурсДокумента / КратностьДокумента) + СуммаАкциза) - СтрокаТабличнойЧасти.Сумма - СтрокаТабличнойЧасти.СуммаНДС;
	
КонецПроцедуры

// Выполняем пересчет налогов табличной части документа после изменений в форме
//  "Цены и валюта".
//
// Параметры:
//  Объект					- Объект - Объект пересчета
//  Период					- Дата - Период пересчета
//  ИмяТабличнойЧасти 		- Строка - Имя табличной части, в которой нужно переститать
//  СуммаВключаетНалоги	 	- Булево - Признак расчета суммы НДС и НСП
//  СтавкаНДС			 	- СправочникСсылка.СтавкиНДС - Ссылка на справочник ставки НДС для пересчета
//  СтавкаНСП			 	- СправочникСсылка.СтавкиНСП - Ссылка на справочник ставки НСП для пересчета
//  БезналичныйРасчет	 	- Булево - Признак безналичного расчета
//
Процедура ПересчитатьНалогиТабличнойЧастиПоступление(
	Объект, 
	Период, 
	ИмяТабличнойЧасти, 
	СтавкаНДС = Неопределено, 
	СтавкаНСП = Неопределено, 
	БезналичныйРасчет = Ложь,
	Знач КурсДокумента = 1, 
	Знач КратностьДокумента = 1) Экспорт
	
	ЗначениеСтавкиНДС = УчетНДСВызовСервера.ПолучитьСтавкуНДС(Период, СтавкаНДС);
	ЗначениеСтавкиНСП = ?(БезналичныйРасчет, 0, УчетНДСВызовСервера.ПолучитьСтавкуНСП(Период, СтавкаНДС, СтавкаНСП));
	
	КратностьДокумента = ?(КратностьДокумента = 0, 1, КратностьДокумента); 
	Для Каждого СтрокаТабличнойЧасти Из Объект[ИмяТабличнойЧасти] Цикл
		СуммаАкциза = 0;
		Если СтрокаТабличнойЧасти.Свойство("СуммаАкциза") Тогда
			СуммаАкциза = СтрокаТабличнойЧасти.СуммаАкциза;
		КонецЕсли;	
			
		// СуммаНДС.
		СтрокаТабличнойЧасти.СуммаНДС = УчетНДСКлиентСервер.РассчитатьСуммуНДСПоступления(
			(СтрокаТабличнойЧасти.Всего * КурсДокумента / КратностьДокумента) + СуммаАкциза,
			ЗначениеСтавкиНДС,
			ЗначениеСтавкиНСП);
			
		// Сумма	
		СтрокаТабличнойЧасти.Сумма = ((СтрокаТабличнойЧасти.Всего * КурсДокумента / КратностьДокумента) + СуммаАкциза) * 100 /	(100 + ЗначениеСтавкиНДС + ЗначениеСтавкиНСП);
	
		// СуммаНСП.
		СтрокаТабличнойЧасти.СуммаНСП = ((СтрокаТабличнойЧасти.Всего * КурсДокумента / КратностьДокумента) + СуммаАкциза) - СтрокаТабличнойЧасти.Сумма - СтрокаТабличнойЧасти.СуммаНДС;
	КонецЦикла;		

КонецПроцедуры 

// Рассчитывает количество в строке табличной части документа
//
// Параметры:
//  СтрокаТабличнойЧасти - строка табличной части документа
//
Процедура РассчитатьКоличествоСтрокиТабличнойЧасти(СтрокаТабличнойЧасти) Экспорт

	СтрокаТабличнойЧасти.Количество = Окр(СтрокаТабличнойЧасти.КоличествоМест * СтрокаТабличнойЧасти.Емкость, 3);
	
КонецПроцедуры

// Рассчитывает сумму в строке табличной части документа
//
// Параметры:
//  СтрокаТабличнойЧасти - строка табличной части документа
//
Процедура РассчитатьСуммуСтрокиТабличнойЧасти(СтрокаТабличнойЧасти, ЗначениеПустогоКоличества = 0, СуммаСкидкиПоСтроке = Ложь) Экспорт

	Если СтрокаТабличнойЧасти.Свойство("Цена") Тогда 
		СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Цена * ?(СтрокаТабличнойЧасти.Количество = 0, ЗначениеПустогоКоличества, СтрокаТабличнойЧасти.Количество);
	КонецЕсли;	
	
	Если СуммаСкидкиПоСтроке Тогда 
		СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Сумма - СтрокаТабличнойЧасти.СуммаСкидки;
	ИначеЕсли СтрокаТабличнойЧасти.Свойство("ПроцентСкидкиНаценки") Тогда
		Если СтрокаТабличнойЧасти.ПроцентСкидкиНаценки = 100 Тогда
			СтрокаТабличнойЧасти.СуммаСкидки = СтрокаТабличнойЧасти.Сумма;
			СтрокаТабличнойЧасти.Сумма = 0;
		ИначеЕсли СтрокаТабличнойЧасти.ПроцентСкидкиНаценки <> 0 Тогда
			СтрокаТабличнойЧасти.СуммаСкидки = СтрокаТабличнойЧасти.Сумма * (СтрокаТабличнойЧасти.ПроцентСкидкиНаценки / 100); 
			СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Сумма - СтрокаТабличнойЧасти.СуммаСкидки;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

// Рассчитывает цену в строке табличной части документа
//
// Параметры:
//  СтрокаТабличнойЧасти - строка табличной части документа
//
Процедура РассчитатьЦенуСтрокиТабличнойЧасти(СтрокаТабличнойЧасти, ЗначениеПустогоКоличества = 0) Экспорт

	РасчетноеКоличество = ?(СтрокаТабличнойЧасти.Количество = 0, ЗначениеПустогоКоличества, СтрокаТабличнойЧасти.Количество);
	
	Если РасчетноеКоличество = 0 Тогда
		СтрокаТабличнойЧасти.Цена = 0;
	Иначе
		СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Сумма / РасчетноеКоличество;
	КонецЕсли; 

КонецПроцедуры

// Рассчитывает сумму налогов в строке табличной части документа
//
// Параметры:
//  СтрокаТабличнойЧасти 	- Структура или СтрокаТабличнойЧасти - Строка табличной части документа.
//  Период					- Дата - Период расчета
//  СуммаВключаетНалоги	 	- Булево - Признак расчета суммы НДС и НСП
//  СтавкаНДС			 	- СправочникСсылка.СтавкиНДС - Ссылка на справочник ставки НДС для расчета
//  СтавкаНСП			 	- СправочникСсылка.СтавкиНСП - Ссылка на справочник ставки НСП для расчета
//  БезналичныйРасчет	 	- Булево - Признак безналичного расчета
//
Процедура РассчитатьСуммыНалоговСтрокиТабличнойЧасти(СтрокаТабличнойЧасти, Период, СуммаВключаетНалоги = Ложь, СтавкаНДС = Неопределено, СтавкаНСП = Неопределено, БезналичныйРасчет = Ложь) Экспорт

	Если ТипЗнч(СтрокаТабличнойЧасти) = Тип("Структура") Тогда
		Если СтрокаТабличнойЧасти.Свойство("Сумма") 
			И СтрокаТабличнойЧасти.Свойство("СтавкаНДС")
			И СтрокаТабличнойЧасти.Свойство("СтавкаНСП") Тогда
			
			ЗначениеСтавкиНДС = УчетНДСВызовСервера.ПолучитьСтавкуНДС(Период, СтрокаТабличнойЧасти.СтавкаНДС);
			ЗначениеСтавкиНСП = ?(БезналичныйРасчет, 0, УчетНДСВызовСервера.ПолучитьСтавкуНСП(Период, СтрокаТабличнойЧасти.СтавкаНДС, СтрокаТабличнойЧасти.СтавкаНСП));
			
			СтрокаТабличнойЧасти.СуммаНДС = УчетНДСКлиентСервер.РассчитатьСуммуНДС(
												СтрокаТабличнойЧасти.Сумма,
												СуммаВключаетНалоги,
												ЗначениеСтавкиНДС,
												ЗначениеСтавкиНСП);
												
			СтрокаТабличнойЧасти.СуммаНСП = УчетНДСКлиентСервер.РассчитатьСуммуНСП(
												СтрокаТабличнойЧасти.Сумма,
												СуммаВключаетНалоги,
												ЗначениеСтавкиНДС,
												ЗначениеСтавкиНСП);
		КонецЕсли;
		
	Иначе // Строка табличной части
		
		ЗначениеСтавкиНДС = УчетНДСВызовСервера.ПолучитьСтавкуНДС(Период, СтавкаНДС);
		ЗначениеСтавкиНСП = ?(БезналичныйРасчет, 0, УчетНДСВызовСервера.ПолучитьСтавкуНСП(Период, СтавкаНДС, СтавкаНСП));

		СтрокаТабличнойЧасти.СуммаНДС = УчетНДСКлиентСервер.РассчитатьСуммуНДС(
											СтрокаТабличнойЧасти.Сумма,
											СуммаВключаетНалоги,
											ЗначениеСтавкиНДС,
											ЗначениеСтавкиНСП);
											
		СтрокаТабличнойЧасти.СуммаНСП = УчетНДСКлиентСервер.РассчитатьСуммуНСП(
											СтрокаТабличнойЧасти.Сумма,
											СуммаВключаетНалоги,
											ЗначениеСтавкиНДС,
											ЗначениеСтавкиНСП);
	КонецЕсли;

	Если СтрокаТабличнойЧасти.Свойство("Всего") Тогда
		СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(СуммаВключаетНалоги, 0, СтрокаТабличнойЧасти.СуммаНДС + СтрокаТабличнойЧасти.СуммаНСП);
	КонецЕсли;	
КонецПроцедуры

// Расчет, исходя из постоянной суммы
//
// Параметры:
//  СтрокаТабличнойЧасти - строка табличной части документа.
//
Процедура РассчитатьСуммуНДССтрокиТабличнойЧасти(СтрокаТабличнойЧасти, Период, СуммаВключаетНалоги = Ложь, СтавкаНДС = Неопределено, СтавкаНСП = Неопределено, БезналичныйРасчет = Ложь) Экспорт

	Если ТипЗнч(СтрокаТабличнойЧасти)=Тип("Структура") Тогда
		Если СтрокаТабличнойЧасти.Свойство("Сумма") 
			И СтрокаТабличнойЧасти.Свойство("СтавкаНДС")
			И СтрокаТабличнойЧасти.Свойство("СтавкаНСП") Тогда
			СтрокаТабличнойЧасти.СуммаНДС = УчетНДСКлиентСервер.РассчитатьСуммуНДС(
				СтрокаТабличнойЧасти.Сумма,
				СуммаВключаетНалоги,
				УчетНДСВызовСервера.ПолучитьСтавкуНДС(Период, СтрокаТабличнойЧасти.СтавкаНДС),
				?(БезналичныйРасчет, 0, УчетНДСВызовСервера.ПолучитьСтавкуНСП(Период, СтрокаТабличнойЧасти.СтавкаНДС, СтрокаТабличнойЧасти.СтавкаНСП)));
		КонецЕсли;
	Иначе // Строка табличной части
		СтрокаТабличнойЧасти.СуммаНДС = УчетНДСКлиентСервер.РассчитатьСуммуНДС(
			СтрокаТабличнойЧасти.Сумма,
			СуммаВключаетНалоги,
			УчетНДСВызовСервера.ПолучитьСтавкуНДС(Период, СтавкаНДС),
			?(БезналичныйРасчет, 0, УчетНДСВызовСервера.ПолучитьСтавкуНСП(Период, СтавкаНДС, СтавкаНСП)));
	КонецЕсли;
		
	Если СтрокаТабличнойЧасти.Свойство("Всего") Тогда
		СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(СуммаВключаетНалоги, 0, СтрокаТабличнойЧасти.СуммаНДС + СтрокаТабличнойЧасти.СуммаНСП);
	КонецЕсли;	
КонецПроцедуры

// Расчет, исходя из постоянной суммы
//
// Параметры:
//  СтрокаТабличнойЧасти - строка табличной части документа.
//
Процедура РассчитатьСуммуНСПСтрокиТабличнойЧасти(СтрокаТабличнойЧасти, Период, СуммаВключаетНалоги = Ложь, СтавкаНДС = Неопределено, СтавкаНСП = Неопределено, БезналичныйРасчет = Ложь) Экспорт

	Если ТипЗнч(СтрокаТабличнойЧасти)=Тип("Структура") Тогда
		Если СтрокаТабличнойЧасти.Свойство("Сумма") 
			И СтрокаТабличнойЧасти.Свойство("СтавкаНДС")
			И СтрокаТабличнойЧасти.Свойство("СтавкаНСП") Тогда
			СтрокаТабличнойЧасти.СуммаНСП = УчетНДСКлиентСервер.РассчитатьСуммуНСП(
				СтрокаТабличнойЧасти.Сумма,
				СуммаВключаетНалоги,
				УчетНДСВызовСервера.ПолучитьСтавкуНДС(Период, СтрокаТабличнойЧасти.СтавкаНДС),
				?(БезналичныйРасчет, 0, УчетНДСВызовСервера.ПолучитьСтавкуНСП(Период, СтрокаТабличнойЧасти.СтавкаНДС, СтрокаТабличнойЧасти.СтавкаНСП)));
		КонецЕсли;
	Иначе // Строка табличной части
		СтрокаТабличнойЧасти.СуммаНСП = УчетНДСКлиентСервер.РассчитатьСуммуНСП(
			СтрокаТабличнойЧасти.Сумма,
			СуммаВключаетНалоги,
			УчетНДСВызовСервера.ПолучитьСтавкуНДС(Период, СтавкаНДС),
			?(БезналичныйРасчет, 0, УчетНДСВызовСервера.ПолучитьСтавкуНСП(Период, СтавкаНДС, СтавкаНСП)));
	КонецЕсли;

	Если СтрокаТабличнойЧасти.Свойство("Всего") Тогда
		СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(СуммаВключаетНалоги, 0, СтрокаТабличнойЧасти.СуммаНДС + СтрокаТабличнойЧасти.СуммаНСП);
	КонецЕсли;	
КонецПроцедуры

// Процедура выполняет стандартные действия по расчету плановой суммы
// в строке табличной части документа.
//
// Параметры:
//  СтрокаТабличнойЧасти - строка табличной части документа,
//
Процедура ПересчитатьПлановуюСумму(СтрокаТабличнойЧасти, ЗначениеПустогоКоличества = 0) Экспорт

	СтрокаТабличнойЧасти.СуммаПлановая = 
		?(СтрокаТабличнойЧасти.Количество = 0, ЗначениеПустогоКоличества, СтрокаТабличнойЧасти.Количество)
		* СтрокаТабличнойЧасти.ПлановаяСтоимость;

КонецПроцедуры

// Выполняем пересчет цены по валюте табличной части документа после изменений в форме
//  "Цены и валюта".
//
// Параметры:
//  Объект				- Объект - Объект пересчета
//  Период				- Дата - Период пересчета
//  СтруктураКурсыПред - Структура - Параметры курса.
//       * Курс      - Число - Курс валюты на указанную дату.
//       * Кратность - Число - Кратность валюты на указанную дату.
//       * Валюта    - СправочникСсылка.Валюты - Ссылка валюты.
// 	СтруктураКурсы - Структура - Параметры курса.
//       * Курс      - Число - Курс валюты на указанную дату.
//       * Кратность - Число - Кратность валюты на указанную дату.
//       * Валюта    - СправочникСсылка.Валюты - Ссылка валюты.
//  ИмяТабличнойЧасти 	- Строка - Имя табличной части, в которой нужно переститать
//
Процедура ПересчитатьЦеныТабличнойЧастиПоВалюте(Объект, Период, СтруктураКурсыПред, СтруктураКурсы, ИмяТабличнойЧасти) Экспорт
	
	Для Каждого СтрокаТабличнойЧасти Из Объект[ИмяТабличнойЧасти] Цикл
		// Цена.
		Если СтрокаТабличнойЧасти.Свойство("Цена") Тогда
			СтрокаТабличнойЧасти.Цена = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(СтрокаТабличнойЧасти.Цена, 
				Новый Структура("Валюта, Курс, Кратность", СтруктураКурсыПред.Валюта, СтруктураКурсыПред.Курс, СтруктураКурсыПред.Кратность),
				Новый Структура("Валюта, Курс, Кратность", СтруктураКурсы.Валюта, СтруктураКурсы.Курс, СтруктураКурсы.Кратность));
		КонецЕсли;
			
		РассчитатьСуммуСтрокиТабличнойЧасти(СтрокаТабличнойЧасти);
	КонецЦикла;		

КонецПроцедуры // ПересчитатьЦеныТабличнойЧастиПоВалюте()

// Выполняем пересчет налогов табличной части документа после изменений в форме
//  "Цены и валюта".
//
// Параметры:
//  Объект					- Объект - Объект пересчета
//  Период					- Дата - Период пересчета
//  ИмяТабличнойЧасти 		- Строка - Имя табличной части, в которой нужно переститать
//  СуммаВключаетНалоги	 	- Булево - Признак расчета суммы НДС и НСП
//  СтавкаНДС			 	- СправочникСсылка.СтавкиНДС - Ссылка на справочник ставки НДС для пересчета
//  СтавкаНСП			 	- СправочникСсылка.СтавкиНСП - Ссылка на справочник ставки НСП для пересчета
//  БезналичныйРасчет	 	- Булево - Признак безналичного расчета
//
Процедура ПересчитатьНалогиТабличнойЧасти(Объект, Период, ИмяТабличнойЧасти, СуммаВключаетНалоги = Ложь, СтавкаНДС = Неопределено, СтавкаНСП = Неопределено, БезналичныйРасчет = Ложь) Экспорт
	
	ЗначениеСтавкиНДС = УчетНДСВызовСервера.ПолучитьСтавкуНДС(Период, СтавкаНДС);
	ЗначениеСтавкиНСП = ?(БезналичныйРасчет, 0, УчетНДСВызовСервера.ПолучитьСтавкуНСП(Период, СтавкаНДС, СтавкаНСП));

	Для Каждого СтрокаТабличнойЧасти Из Объект[ИмяТабличнойЧасти] Цикл
		// СуммаНДС.
		СтрокаТабличнойЧасти.СуммаНДС = УчетНДСКлиентСервер.РассчитатьСуммуНДС(
			СтрокаТабличнойЧасти.Сумма,
			СуммаВключаетНалоги,
			ЗначениеСтавкиНДС,
			ЗначениеСтавкиНСП);
			
		// СуммаНСП.
		СтрокаТабличнойЧасти.СуммаНСП = УчетНДСКлиентСервер.РассчитатьСуммуНСП(
			СтрокаТабличнойЧасти.Сумма,
			СуммаВключаетНалоги,
			ЗначениеСтавкиНДС,
			ЗначениеСтавкиНСП);
			
		Если СтрокаТабличнойЧасти.Свойство("Всего") Тогда
			СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(СуммаВключаетНалоги, 0, СтрокаТабличнойЧасти.СуммаНДС + СтрокаТабличнойЧасти.СуммаНСП);
		КонецЕсли;	
	КонецЦикла;		

КонецПроцедуры // ПересчитатьЦеныТабличнойЧастиПоВалюте()

// Функция выполняет поиск первой, удовлетворяющей условию поиска, строки табличной части.
//
// Параметры:
//  ИмяТабличнойЧасти - Строка - Имя табличной части документа, в которой осуществляется поиск,
//  СтруктураОтбора - Структура - задает условие поиска.
//
// Возвращаемое значение: 
//  Строка табличной части - найденная строка табличной части,
//  Неопределено           - строка табличной части не найдена.
//
Функция НайтиСтрокуТабличнойЧасти(Объект, ИмяТабличнойЧасти, СтруктураОтбора) Экспорт

	СтрокаТабличнойЧасти = Неопределено;
	МассивНайденныхСтрок = Объект[ИмяТабличнойЧасти].НайтиСтроки(СтруктураОтбора);
	Если МассивНайденныхСтрок.Количество() > 0 Тогда

		// Нашли. Вернем первую найденную строку.
		СтрокаТабличнойЧасти = МассивНайденныхСтрок[0];
	КонецЕсли;

	Возврат СтрокаТабличнойЧасти;

КонецФункции
