#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает описание блокируемых реквизитов.
//
// Возвращаемое значение:
//  Массив - содержит строки в формате ИмяРеквизита[;ИмяЭлементаФормы,...]
//           где ИмяРеквизита - имя реквизита объекта, ИмяЭлементаФормы - имя элемента формы,
//           связанного с реквизитом.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	БлокируемыеРеквизиты = Новый Массив;
	
	БлокируемыеРеквизиты.Добавить("Организация");
	БлокируемыеРеквизиты.Добавить("Владелец");
	БлокируемыеРеквизиты.Добавить("ВалютаРасчетов");
	БлокируемыеРеквизиты.Добавить("ВидДоговора");
	БлокируемыеРеквизиты.Добавить("СтавкаНДС");
	БлокируемыеРеквизиты.Добавить("СуммаВключаетНалоги");
	
	Возврат БлокируемыеРеквизиты;
	
КонецФункции 

// Устарела 
// Получает договор контрагента по умолчанию с учетом условий отбора. Возвращается основной договор или единственный или
// пустую ссылку.
//
// Параметры
//  Контрагент	-	<СправочникСсылка.Контрагенты> 
//							Контрагент, договор которого нужно получить
//  Организация	-	<СправочникСсылка.Организации> 
//							Организация, договор которой нужно получить
//  СписокВидовДоговора	-	<Массив> или <СписокЗначений>, состоящий из значений типа <ПеречислениеСсылка.ВидыДоговоров> 
//							Нужные виды договора
//
// Возвращаемое значение:
//   <СправочникСсылка.ДоговорыКонтрагентов> - найденный договор или пустая ссылка
//
Функция УстарелаПолучитьДоговорПоУмолчаниюПоОрганизацииВидуДоговора(Контрагент, Организация, СписокВидовДоговора = Неопределено) Экспорт
	
	ОсновнойДоговорКонтрагента = Контрагент.ОсновнойДоговорКонтрагента;
	
	Если СписокВидовДоговора = Неопределено
		ИЛИ (СписокВидовДоговора.НайтиПоЗначению(ОсновнойДоговорКонтрагента.ВидДоговора) <> Неопределено
		И ОсновнойДоговорКонтрагента.Организация = Организация) Тогда
		
		Возврат ОсновнойДоговорКонтрагента;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДоговорыКонтрагентов.Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Владелец = &Контрагент
	|	И ДоговорыКонтрагентов.Организация = &Организация
	|	И ДоговорыКонтрагентов.ПометкаУдаления = ЛОЖЬ"
	+?(СписокВидовДоговора <> Неопределено,"
	|	И ДоговорыКонтрагентов.ВидДоговора В (&СписокВидовДоговора)","");
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СписокВидовДоговора", СписокВидовДоговора);
	
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Выборка.Следующий();
	Возврат Выборка.Ссылка;

КонецФункции // ПолучитьДоговорПоУмолчаниюПоОрганизацииВидуДоговора()

// Получает договор контрагента по умолчанию с учетом условий отбора. Возвращается основной договор или единственный или
// пустую ссылку.
//
// Параметры
//  Контрагент	-	<СправочникСсылка.Контрагенты> 
//							Контрагент, договор которого нужно получить
//  Организация	-	<СправочникСсылка.Организации> 
//							Организация, договор которой нужно получить
//  СписокВидовДоговора	-	<Массив> или <СписокЗначений>, состоящий из значений типа <ПеречислениеСсылка.ВидыДоговоров> 
//							Нужные виды договора
//
// Возвращаемое значение:
//   <СправочникСсылка.ДоговорыКонтрагентов> - найденный договор или пустая ссылка
//
Функция ПолучитьДоговорПоУмолчаниюПоОрганизацииВидуДоговора(Контрагент, Организация, СписокВидовДоговора = Неопределено) Экспорт
	
	ОсновнойДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОсновныеДоговорыКонтрагента.Договор КАК Договор
		|ИЗ
		|	РегистрСведений.ОсновныеДоговорыКонтрагента КАК ОсновныеДоговорыКонтрагента
		|ГДЕ
		|	ОсновныеДоговорыКонтрагента.Организация = &Организация
		|	И ОсновныеДоговорыКонтрагента.Контрагент = &Контрагент
		|	И ОсновныеДоговорыКонтрагента.ВидДоговора В(&СписокВидовДоговора)";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("СписокВидовДоговора", СписокВидовДоговора);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		
		ОсновнойДоговорКонтрагента = ВыборкаДетальныеЗаписи.Договор;
	КонецЕсли;
	
	Возврат ОсновнойДоговорКонтрагента;

КонецФункции // ПолучитьДоговорПоУмолчаниюПоОрганизацииВидуДоговора()

// Проверяет договор контрагента на соответствие переданным параметрам.
//
// Параметры
//	ТекстСообщения - <Строка> - текст сообщения об ошибках
//	Договор	-	<СправочникСсылка.ДоговорыКонтрагентов> - проверяемый договор
//	Организация	-	<СправочникСсылка.Организации> - организация документа
//	Контрагент	-	<СправочникСсылка.Контрагенты> - контрагент документа
//	СписокВидовДоговора	-	<СписокЗначений>, состоящий из значений типа <ПеречислениеСсылка.ВидыДоговоров>. 
//							Нужные виды договора.
//
// Возвращаемое значение:
//	<Булево> - Истина, если проверка пройдена успешно.
//
Функция ДоговорСоответствуетУсловиямДокумента(ТекстСообщения, Договор, Организация, Контрагент, СписокВидовДоговора) Экспорт
	
	ТекстСообщения = "";
	
	Если Не Контрагент.ВестиРасчетыПоДоговорам Тогда
		Возврат Истина;
	КонецЕсли;
	
	НеСоответствуетОрганизация = Ложь;
	НеСоответствуетВидДоговора = Ложь;
	
	Если Договор.Организация <> Организация Тогда
		НеСоответствуетОрганизация = Истина;
	КонецЕсли;
		
	Если СписокВидовДоговора.НайтиПоЗначению(Договор.ВидДоговора) = Неопределено Тогда
		НеСоответствуетВидДоговора = Истина;
	КонецЕсли;
	
	Если (НеСоответствуетОрганизация ИЛИ НеСоответствуетВидДоговора) = Ложь Тогда
		Возврат Истина;
	КонецЕсли;
	
	ТекстСообщения = НСтр("ru = 'Реквизиты договора не соответствуют условиям документа:'");
	
	Если НеСоответствуетОрганизация Тогда
		ТекстСообщения = ТекстСообщения + НСтр("ru = '
		| - Не совпадает организация'");
	КонецЕсли;
	
	Если НеСоответствуетВидДоговора Тогда
		ТекстСообщения = ТекстСообщения + НСтр("ru = '
		| - Не совпадает вид договора'");
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции // ДоговорСоответствуетУсловиямДокумента()

// Возвращает список доступных видов договора для документа.
//
// Параметры
//	Документ  - любой документ, предусматривающий договор контрагента
//	ВидОперации  - вид операции документа.
//
// Возвращаемое значение:
//	<СписокЗначений>   - список видов договора, доступных для документа.
//
Функция ВидыДоговораДляДокумента(Документ, ВидОперации = Неопределено, ИмяТабличнойЧасти = "") Экспорт
	
	СписокВидовДоговора = Новый СписокЗначений;
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ВводНачальныхОстатков") Тогда
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя")
		ИЛИ ТипЗнч(Документ) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
		ИЛИ ТипЗнч(Документ) = Тип("ДокументСсылка.СчетНаОплатуПокупателю")
		ИЛИ ТипЗнч(Документ) = Тип("ДокументСсылка.СчетФактураВыписанный")
		ИЛИ ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаказНаПроизводство") Тогда
		
		СписокВидовДоговора.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ДополнительныеРасходы") 
		ИЛИ ТипЗнч(Документ) = Тип("ДокументСсылка.АвансовыйОтчет")
		ИЛИ ТипЗнч(Документ) = Тип("ДокументСсылка.Доверенность")
		ИЛИ ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаявлениеОВвозеТоваров") Тогда
		
		СписокВидовДоговора.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") 
		ИЛИ ТипЗнч(Документ) = Тип("ДокументСсылка.ПлатежноеПоручениеВходящее") Тогда
		
		Если ВидОперации = Перечисления.ВидыОперацийПКО.ВозвратОтПоставщика
			ИЛИ ВидОперации = Перечисления.ВидыОперацийППВ.ВозвратОтПоставщика Тогда
			СписокВидовДоговора.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
		ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПКО.РасчетыПоЗаймам
			Или ВидОперации = Перечисления.ВидыОперацийППВ.РасчетыПоЗаймам Тогда  
			СписокВидовДоговора.Добавить(Перечисления.ВидыДоговоровКонтрагентов.Прочее);
		Иначе 	
			СписокВидовДоговора.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг")
		ИЛИ ТипЗнч(Документ) = Тип("ДокументСсылка.ДополнительныеРасходы")
		ИЛИ ТипЗнч(Документ) = Тип("ДокументСсылка.ВозвратТоваровПоставщику")Тогда
		
		СписокВидовДоговора.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.РасходныйКассовыйОрдер") 
		ИЛИ ТипЗнч(Документ) = Тип("ДокументСсылка.ПлатежноеПоручениеИсходящее") Тогда
		
		Если ВидОперации = Перечисления.ВидыОперацийРКО.ОплатаПоставщику 
			ИЛИ ВидОперации = Перечисления.ВидыОперацийППИ.ОплатаПоставщику Тогда
			СписокВидовДоговора.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
		ИначеЕсли ВидОперации = Перечисления.ВидыОперацийППИ.РасчетыПоЗаймам
			Или ВидОперации = Перечисления.ВидыОперацийРКО.РасчетыПоЗаймам 
			ИЛИ ВидОперации = Перечисления.ВидыОперацийППИ.ПрочийРасход Тогда
			СписокВидовДоговора.Добавить(Перечисления.ВидыДоговоровКонтрагентов.Прочее);
		ИначеЕсли ВидОперации = Перечисления.ВидыОперацийППИ.ОплатаНалогов Тогда 
			СписокВидовДоговора.Добавить(Перечисления.ВидыДоговоровКонтрагентов.ПустаяСсылка());
		Иначе
			СписокВидовДоговора.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
		КонецЕсли;
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ГТДПоИмпорту") Тогда 
		СписокВидовДоговора.Добавить(Перечисления.ВидыДоговоровКонтрагентов.Прочее);
	КонецЕсли;
	
	Возврат СписокВидовДоговора;
	
КонецФункции // ВидыДоговораДляДокумента()

// Устанавливает договор в качестве основного в регистре сведений "Основные договора контрагента"
// 
// Параметры:
//   Договор - Договор, который необходимо установить как основной
//
Процедура УстановитьОсновнойДоговорКонтрагента(Договор) Экспорт
	
	ПараметрыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор, "Организация, Владелец, ВидДоговора");
	
	НоваяЗапись = РегистрыСведений.ОсновныеДоговорыКонтрагента.СоздатьМенеджерЗаписи();
	НоваяЗапись.Организация = ПараметрыДоговора.Организация;
	НоваяЗапись.Контрагент  = ПараметрыДоговора.Владелец;
	НоваяЗапись.ВидДоговора = ПараметрыДоговора.ВидДоговора;
	НоваяЗапись.Договор     = Договор;
	НоваяЗапись.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция составляет наименование договора.
//
Функция НаименованиеДоговора(ВалютаРасчетов, Знач НомерДоговора = "", Знач ДатаДоговора = Неопределено) Экспорт 
	
	Если НомерДоговора = "" Тогда 
		НомерДоговора = НаименованиеПоУмолчаниюБезРеквизитов();
	КонецЕсли;	
	
	Слова = Новый Массив;
	Если ЗначениеЗаполнено(НомерДоговора) Тогда
		Слова.Добавить(СокрЛП(НомерДоговора));
	КонецЕсли;
	Если ЗначениеЗаполнено(ДатаДоговора) Тогда
		Слова.Добавить(СтрШаблон(НСтр("ru = 'от %1'"), Формат(ДатаДоговора, "ДЛФ=D")));
	КонецЕсли;
	Если ЗначениеЗаполнено(ВалютаРасчетов) Тогда
		Слова.Добавить("(" + СокрЛП(ВалютаРасчетов) + ")");
	КонецЕсли;
	
	Возврат СтрСоединить(Слова, " ");
	
КонецФункции // НаименованиеДоговора()

Функция НаименованиеПоУмолчаниюБезРеквизитов() Экспорт
	
	// Такое наименование по умолчанию используется только тогда, когда договор нужно сохранить, но дата и номер договора неизвестны.
	// При интерактивном вводе договора наименование по умолчанию устанавливается исходя из номера и даты - см. РеквизитыДоговораСтрокой().
	
	Возврат НСтр("ru='Основной договор'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
	
КонецФункции

#КонецОбласти

#КонецЕсли