#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура - Заполнить по умолчанию
// Выполняет первоночальное заполнение
Процедура ЗаполнитьПоУмолчанию(ТабличнаяЧасть) Экспорт 
	СправочникМенеджер = Справочники.КодыСтрокНалоговойДекларации;
	
	КлассификаторXML = СправочникМенеджер.ПолучитьМакет("МакетЗаполнения").ПолучитьТекст();
	КлассификаторТаблица  = ОбщегоНазначения.ПрочитатьXMLВТаблицу(КлассификаторXML).Данные;
	             
	Для Каждого СтрокаТаблицыЗначений Из КлассификаторТаблица Цикл
		СтрокаТабличнойЧасти = ТабличнаяЧасть.Добавить();
		
		СтрокаТабличнойЧасти.Строка = СтрокаТаблицыЗначений.Строка;
		СтрокаТабличнойЧасти.Счет = ПланыСчетов.Хозрасчетный.НайтиПоКоду(СокрЛП(СтрокаТаблицыЗначений.Счет));
		
		Если СтрокаТаблицыЗначений.Знак = "Минус" Тогда
			СтрокаТабличнойЧасти.Знак = Перечисления.ПлюсМинус.Минус;
		ИначеЕсли СтрокаТаблицыЗначений.Знак = "Плюс" Тогда
			СтрокаТабличнойЧасти.Знак = Перечисления.ПлюсМинус.Плюс;
		КонецЕсли;
			
		Если СтрокаТаблицыЗначений.ПоложительноеЗначение = "Истина" Тогда
			СтрокаТабличнойЧасти.ПоложительноеЗначение = Истина;			
		КонецЕсли;

		СтрокаТабличнойЧасти.Формула = СтрокаТаблицыЗначений.Формула;	
		
		Если ЗначениеЗаполнено(СтрокаТаблицыЗначений.УровеньИтога) Тогда
			СтрокаТабличнойЧасти.УровеньИтога = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(СтрокаТаблицыЗначений.УровеньИтога); 	
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры // ЗаполнитьПоУмолчанию()	

#КонецОбласти

#КонецЕсли
