#Область ОбработчикиСобытийФормы

// Процедура - обработчик события ПриСозданииНаСервере.
// В процедуре осуществляется
// - инициализация реквизитов формы,
// - установка параметров функциональных опций формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Установка реквизитов формы.
	ДатаДокумента = Объект.Дата;
	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(ЭтаФорма, "Объект.Дата", "МесяцСтрокой");
	
	// РаботаСФормами
	РаботаСФормамиСервер.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец РаботаСФормами
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ГруппаВажныеКоманды;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

// Процедура - обработчик события ПриЧтенииНаСервере.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(ЭтаФорма, "Объект.Дата", "МесяцСтрокой");
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменений
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменений
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом 
	
КонецПроцедуры

// Процедура - обработчик события ПриОткрытии.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьДоступностьЭлементов();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

// Процедура - обработчик события ПослеЗаписиНаСервере.
//
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)	
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Процедура - обработчик события ПриИзменении поля ввода Организация.
//
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	// Обработка события изменения организации.
	Объект.Номер = "";
	БухгалтерскийУчетВызовСервераПовтИсп.УчетнаяПолитикаСуществует(Объект.Организация, ДатаДокумента, Истина, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ВидСубъектаПриИзменении(Элемент)
	
	УстановитьВидимостьДоступностьЭлементов();	
	
	Если (Объект.ВидСубъекта = 0 ИЛИ Объект.ВидСубъекта = 2) Тогда	
		Объект.ПриложениеПервыйМесяцКвартала.Очистить();
		Объект.ПриложениеВторойМесяцКвартала.Очистить();
		Объект.ПриложениеТретийМесяцКвартала.Очистить();
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьОсновнойОтчет(Команда)
	Если Объект.ОтчетОсновной.Количество() > 0 Тогда 
		ОписаниеОповещения = Новый ОписаниеОповещения("ОтветНаВопросЗаполнитьТабличнуюЧастьОтчетПоНСП", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Табличная часть документа будет очищена и перезаполнена. Продолжить выполнение операции?'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60);
	Иначе
		ЗаполнитьТабличнуюЧастьОтчетПоНСПНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПриложение(Команда)
	Если Объект.ПриложениеПервыйМесяцКвартала.Количество() > 0 Или Объект.ПриложениеВторойМесяцКвартала.Количество() > 0  
		ИЛИ Объект.ПриложениеТретийМесяцКвартала.Количество() > 0 Тогда 
		ОписаниеОповещения = Новый ОписаниеОповещения("ОтветНаВопросЗаполнитьТабличныеЧастиПриложениеКОтчетуПоНСП", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Табличные части документа будет очищены и перезаполнены. Продолжить выполнение операции?'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60);
	Иначе
		ЗаполнитьТабличныеЧастиПриложениеКОтчетуПоНСПНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СохранитьВЭлектроннойФорме_Достек(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка)
		Или Модифицированность Тогда 
		ТекстСообщения = НСтр("ru='Для формирования отчета по НСП в электронной форме необходимо записать документ.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;	
	
	Если ТребуетсяНастройкаАвторизацияИнтернетПоддержки() Тогда
		ТекстВопроса = НСтр("ru='Для формирования отчета по НСП в электронной форме
			|необходимо подключиться к Интернет-поддержке пользователей.
			|Подключиться сейчас?'");
		ОписаниеОповещения = Новый ОписаниеОповещения("ПриПодключенииИнтернетПоддержки", ЭтотОбъект, Новый Структура("НаправлениеВыгрузки", "СохранитьВЭлектроннойФорме_Достек"));
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Подключиться'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена);
		
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, Кнопки);
	Иначе
		ПродолжитьСохранение("СохранитьВЭлектроннойФорме_Достек");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиРезультатовИнтерактивныхДействий

&НаКлиенте
Процедура ОтветНаВопросЗаполнитьТабличнуюЧастьОтчетПоНСП(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Объект.ОтчетОсновной.Очистить();
		ЗаполнитьТабличнуюЧастьОтчетПоНСПНаСервере();
	КонецЕсли; 
КонецПроцедуры	

&НаКлиенте
Процедура ОтветНаВопросЗаполнитьТабличныеЧастиПриложениеКОтчетуПоНСП(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Объект.ПриложениеПервыйМесяцКвартала.Очистить();
		Объект.ПриложениеВторойМесяцКвартала.Очистить();
		Объект.ПриложениеТретийМесяцКвартала.Очистить();
		ЗаполнитьТабличныеЧастиПриложениеКОтчетуПоНСПНаСервере();
	КонецЕсли; 
КонецПроцедуры	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура устанавливает видимость и доступность элементов.
//
&НаКлиенте
Процедура УстановитьВидимостьДоступностьЭлементов()

	Если Объект.ВидСубъекта = 0 ИЛИ Объект.ВидСубъекта = 2 Тогда		
		Элементы.СтраницаПриложение.Видимость = Ложь;
	Иначе			
		Элементы.СтраницаПриложение.Видимость = Истина;		
	КонецЕсли;	

КонецПроцедуры

// Процедура - Заполнить табличную часть на сервере
//
&НаСервере
Процедура ЗаполнитьТабличнуюЧастьОтчетПоНСПНаСервере()
	Документ = РеквизитФормыВЗначение("Объект");
	Документ.ЗаполнитьТабличнуюЧастьОтчетПоНСП();
	ЗначениеВРеквизитФормы(Документ, "Объект");
КонецПроцедуры

// Процедура - Заполнить табличную часть на сервере
//
&НаСервере
Процедура ЗаполнитьТабличныеЧастиПриложениеКОтчетуПоНСПНаСервере()
	Документ = РеквизитФормыВЗначение("Объект");
	Документ.ЗаполнитьТабличныеЧастиПриложениеКОтчетуПоНСП();
	ЗначениеВРеквизитФормы(Документ, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ПриПодключенииИнтернетПоддержки(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ИнтернетПоддержкаПользователей") Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПодключенияИнтернетПоддержки", ЭтотОбъект, ДополнительныеПараметры);
		МодульИнтернетПоддержкаПользователейКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтернетПоддержкаПользователейКлиент");
		МодульИнтернетПоддержкаПользователейКлиент.ПодключитьИнтернетПоддержкуПользователей(ОписаниеОповещения, ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодключенияИнтернетПоддержки(Результат, ДополнительныеПараметры) Экспорт
	Если Не (ТипЗнч(Результат) = Тип("Структура")
		И ЗначениеЗаполнено(Результат.Логин)
		И ЗначениеЗаполнено(Результат.Пароль)) Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.НаправлениеВыгрузки = "СохранитьВЭлектроннойФорме_Достек" Тогда
		ПродолжитьСохранение("СохранитьВЭлектроннойФорме_Достек");	
	ИначеЕсли ДополнительныеПараметры.НаправлениеВыгрузки = "СохранитьВЭлектроннойФорме_UBR" Тогда
		ПродолжитьСохранение("СохранитьВЭлектроннойФорме_UBR");	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ТребуетсяНастройкаАвторизацияИнтернетПоддержки()
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей") Тогда
		МодульИнтернетПоддержкаПользователей = ОбщегоНазначения.ОбщийМодуль("ИнтернетПоддержкаПользователей");
		Возврат Не МодульИнтернетПоддержкаПользователей.ЗаполненыДанныеАутентификацииПользователяИнтернетПоддержки();
	КонецЕсли;
	Возврат Ложь;
КонецФункции

#КонецОбласти

#Область ФормированиеЗаявленияВЭлектронномФормате

&НаКлиенте
Процедура ПродолжитьСохранение(НаправлениеВыгрузки)
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.Заголовок = НСтр("ru = 'Укажите путь для сохранения файла'");
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("ВидДиалога", НаправлениеВыгрузки);
	
	Оповещение = Новый ОписаниеОповещения("ДиалогОткрытияФайлаЗавершение", ЭтотОбъект, СтруктураПараметров);
	ДиалогОткрытияФайла.Показать(Оповещение);

КонецПроцедуры // ПродолжитьСохранение()

&НаКлиенте
Процедура ДиалогОткрытияФайлаЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено И ВыбранныеФайлы.Количество() > 0 Тогда
		Попытка
			Ошибки = Неопределено;
			
			Если ДополнительныеПараметры.ВидДиалога = "СохранитьВЭлектроннойФорме_Достек" Тогда
				СтруктураДанных = ФормированиеФайлаXML_Достек(ДополнительныеПараметры, Ошибки);
				
				Если СтруктураДанных = Неопределено Тогда
					Возврат;	
				КонецЕсли;	
				
			//Иначе	
			//	СтруктураДанных = ФормированиеФайлаXML(ДополнительныеПараметры, Ошибки);
			КонецЕсли;
			
		Исключение
			ТекстСообщения = НСтр("ru='Не удалось завершить формирование файла.
				|Техническая информация об ошибке: %1'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));	
			
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецПопытки;
		
		Если НЕ Ошибки = Неопределено Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);	
			Возврат;
		КонецЕсли;		
		
		// Формирование имени файла.
		КаталогФайла = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ВыбранныеФайлы[0]);
		ИмяФайла = СтруктураДанных.ИмяФайла;
		ПолноеИмяФайла = КаталогФайла + ИмяФайла;
		
		// Сохранение файла.
		Двоичное = ПолучитьИзВременногоХранилища(СтруктураДанных.АдресВременногоХранилища);
		Двоичное.Записать(ПолноеИмяФайла);	
		
		ТекстСообщения = НСтр("ru='Файл успешно сохранен.
			|Имя файла: %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ПолноеИмяФайла);	
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;	
КонецПроцедуры

// Процедура создания XML файла
//
&НаСервере
Функция ФормированиеФайлаXML_Достек(ДополнительныеПараметры, Ошибки)
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ИмяФайла", "");
	СтруктураДанных.Вставить("АдресВременногоХранилища", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетПоНСП.Дата КАК Дата,
		|	ОтчетПоНСП.Организация.ГНС.Код КАК КодГНС,
		|	ОтчетПоНСП.ВидСубъекта КАК ВидСубъекта,
		|	ОтчетПоНСП.ВидОтчета КАК ВидОтчета,
		|	ОтчетПоНСП.ОтчетОсновной.(
		|		Строка КАК Строка,
		|		Выручка КАК Выручка,
		|		Ставка КАК Ставка,
		|		СуммаНСП КАК СуммаНСП
		|	) КАК ОтчетОсновной,
		|	ОтчетПоНСП.ПриложениеПервыйМесяцКвартала.(
		|		Строка КАК Строка,
		|		Выручка КАК Выручка,
		|		Ставка КАК Ставка,
		|		СуммаНСП КАК СуммаНСП
		|	) КАК ПриложениеПервыйМесяцКвартала,
		|	ОтчетПоНСП.ПриложениеВторойМесяцКвартала.(
		|		Строка КАК Строка,
		|		Выручка КАК Выручка,
		|		Ставка КАК Ставка,
		|		СуммаНСП КАК СуммаНСП
		|	) КАК ПриложениеВторойМесяцКвартала,
		|	ОтчетПоНСП.ПриложениеТретийМесяцКвартала.(
		|		Строка КАК Строка,
		|		Выручка КАК Выручка,
		|		Ставка КАК Ставка,
		|		СуммаНСП КАК СуммаНСП
		|	) КАК ПриложениеТретийМесяцКвартала
		|ИЗ
		|	Документ.ОтчетПоНСП КАК ОтчетПоНСП
		|ГДЕ
		|	ОтчетПоНСП.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ВызватьИсключение НСтр("ru = 'Нет данных в отчете.'");
	КонецЕсли;	
	
	ВыборкаШапка = РезультатЗапроса.Выбрать();
	ВыборкаШапка.Следующий();
	
	Дата = Формат(ВыборкаШапка.Дата, "ДФ=yyyy-MM-dd");

	Если Объект.ВидСубъекта = 0 Тогда 
		НомерФормы = "129";
		
	ИначеЕсли Объект.ВидСубъекта = 1 Тогда 
		НомерФормы = "130";
		
	ИначеЕсли Объект.ВидСубъекта = 2 Тогда 
		НомерФормы = "131";
	КонецЕсли;
	
	ШаблонИмениФайла = СтрШаблон(НСтр("ru = 'Form%1_%2.'"), НомерФормы, Дата);
	ИмяФайла = ШаблонИмениФайла + ".xml";
	
	// Массив для описания ошибок и если ошибки есть то отмена создания XML файла.
	МассивОшибок = Новый Массив();

	// FORM
	Если НомерФормы = "129" Тогда 		
		ОбъектXDTO = СоздатьОбъектXDTO("FORMDOSTEKSTI129", НомерФормы);
		IDFORM = "129_2";
		VERSFORM = "1.02";
		
	ИначеЕсли НомерФормы = "130" Тогда 
		ОбъектXDTO = СоздатьОбъектXDTO("FORMDOSTEKSTI130", НомерФормы);
		IDFORM = "130";
		VERSFORM = "1.01";
		
	ИначеЕсли НомерФормы = "131" Тогда 
		ОбъектXDTO = СоздатьОбъектXDTO("FORMDOSTEKSTI131", НомерФормы);
		IDFORM = "131_2";
		VERSFORM = "1.02";
	КонецЕсли;

	ОбъектXDTO.IDFORM = IDFORM;
	ОбъектXDTO.NOMDOC = "1";
	ОбъектXDTO.VERSFORM = VERSFORM;
	ОбъектXDTO.DATEREPORT = Формат(ТекущаяДатаСеанса(), "ДЛФ=D");
	
	// PART1 - НАЧАЛО
	ОбъектXDTOPART1 = СоздатьОбъектXDTO("PART1", НомерФормы);
	
	Если Объект.ВидОтчета = Перечисления.ВидыОтчетаПоНалогам.Первоначальный Тогда 
		FTYPE = 0;
	ИначеЕсли Объект.ВидОтчета = Перечисления.ВидыОтчетаПоНалогам.Уточненный Тогда 
		FTYPE = 1;
	ИначеЕсли Объект.ВидОтчета = Перечисления.ВидыОтчетаПоНалогам.Ликвидационный Тогда 
		FTYPE = 3;
	Иначе
		FTYPE = 0;
		МассивОшибок.Добавить(НСтр("ru = 'Не указан вид отчета.'"));
	КонецЕсли;
	
	ОбъектXDTOFTYPE = СоздатьОбъектXDTO("FTYPE", НомерФормы);
	ОбъектXDTOFTYPE.Text = FTYPE;
	
	Если Объект.ВидСубъекта = 0 Тогда 
		ОбъектXDTOQUARTER = СоздатьОбъектXDTO("QUARTER", НомерФормы);      
		ОбъектXDTOQUARTER.Text = Месяц(КонецКвартала(ДатаДокумента)) / 3;
		
		ОбъектXDTOYEAR = СоздатьОбъектXDTO("YEAR", НомерФормы);
		ОбъектXDTOYEAR.Text = Формат(Год(ДатаДокумента), "ЧГ=0");	
		
		ОбъектXDTOPART1.FTYPE.Добавить(ОбъектXDTOFTYPE);
		ОбъектXDTOPART1.QUARTER.Добавить(ОбъектXDTOQUARTER);
		ОбъектXDTOPART1.YEAR.Добавить(ОбъектXDTOYEAR);
		
	ИначеЕсли Объект.ВидСубъекта = 1 Тогда 
		ОбъектXDTOQUARTER = СоздатьОбъектXDTO("QUARTER", НомерФормы);      
		ОбъектXDTOQUARTER.Text = Месяц(КонецКвартала(ДатаДокумента)) / 3;
		
		ОбъектXDTOYEAR = СоздатьОбъектXDTO("YEAR", НомерФормы);
		ОбъектXDTOYEAR.Text = Формат(Год(ДатаДокумента), "ЧГ=0");
		
		ОбъектXDTOCODENO = СоздатьОбъектXDTO("CODENO", НомерФормы);
		ОбъектXDTOCODENO.Text = ВыборкаШапка.КодГНС;
		
		ОбъектXDTOPART1.FTYPE.Добавить(ОбъектXDTOFTYPE);
		ОбъектXDTOPART1.QUARTER.Добавить(ОбъектXDTOQUARTER);
		ОбъектXDTOPART1.YEAR.Добавить(ОбъектXDTOYEAR);
		ОбъектXDTOPART1.CODENO.Добавить(ОбъектXDTOCODENO);
		
	ИначеЕсли Объект.ВидСубъекта = 2 Тогда 
		ОбъектXDTOSTARTDATE = СоздатьОбъектXDTO("STARTDATE", НомерФормы);      
		ОбъектXDTOSTARTDATE.Text = Формат(НачалоМесяца(ДатаДокумента), "ДФ=dd.MM.yyyy; ДЛФ=D");
		
		ОбъектXDTOENDDATE = СоздатьОбъектXDTO("ENDDATE", НомерФормы);      
		ОбъектXDTOENDDATE.Text = Формат(КонецМесяца(ДатаДокумента), "ДФ=dd.MM.yyyy; ДЛФ=D");	
		
		ОбъектXDTOPART1.FTYPE.Добавить(ОбъектXDTOFTYPE);
		ОбъектXDTOPART1.STARTDATE.Добавить(ОбъектXDTOSTARTDATE);
		ОбъектXDTOPART1.ENDDATE.Добавить(ОбъектXDTOENDDATE);
	КонецЕсли;
	
	ОбъектXDTO.PART1.Добавить(ОбъектXDTOPART1);
	// PART1 - КОНЕЦ 
	
	// PART2 - НАЧАЛО
	ОбъектXDTOPART2 = СоздатьОбъектXDTO("PART2", НомерФормы);
	
	ТаблицаОсновная = ВыборкаШапка.ОтчетОсновной.Выгрузить();
	
	// Раздел "А" НАЧАЛО
	СуммаНСПРазделаА = 0;
	
	СтрокаТаблицы = ТаблицаОсновная.Найти("050", "Строка");
	ОбъектXDTODTG_2X50 = СоздатьОбъектXDTO("DTG" + НомерФормы + "_2X50", НомерФормы);
	ОбъектXDTODTG_2X50.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Выручка);
	
	ОбъектXDTODTG_2X51 = СоздатьОбъектXDTO("DTG" + НомерФормы + "_2X51", НомерФормы);
	ОбъектXDTODTG_2X51.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Ставка);
	
	ОбъектXDTODTG_2X52 = СоздатьОбъектXDTO("DTG" + НомерФормы + "_2X52", НомерФормы);
	ОбъектXDTODTG_2X52.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СуммаНСПРазделаА = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СтрокаТаблицы = ТаблицаОсновная.Найти("053", "Строка");
	ОбъектXDTODTG_2X53 = СоздатьОбъектXDTO("DTG" + НомерФормы + "_2X53", НомерФормы);
	ОбъектXDTODTG_2X53.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Выручка);
	
	ОбъектXDTODTG_2X54 = СоздатьОбъектXDTO("DTG" + НомерФормы + "_2X54", НомерФормы);
	ОбъектXDTODTG_2X54.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Ставка);
	
	ОбъектXDTODTG_2X55 = СоздатьОбъектXDTO("DTG" + НомерФормы + "_2X55", НомерФормы);
	ОбъектXDTODTG_2X55.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СуммаНСПРазделаА = СуммаНСПРазделаА + ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СтрокаТаблицы = ТаблицаОсновная.Найти("056", "Строка");
	ОбъектXDTODTG_2X56 = СоздатьОбъектXDTO("DTG" + НомерФормы + "_2X56", НомерФормы);
	ОбъектXDTODTG_2X56.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Выручка);
	
	ОбъектXDTODTG_2X57 = СоздатьОбъектXDTO("DTG" + НомерФормы + "_2X57", НомерФормы);
	ОбъектXDTODTG_2X57.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Ставка);

	ОбъектXDTODTG_2X58 = СоздатьОбъектXDTO("DTG" + НомерФормы + "_2X58", НомерФормы);
	ОбъектXDTODTG_2X58.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СуммаНСПРазделаА = СуммаНСПРазделаА + ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СтрокаТаблицы = ТаблицаОсновная.Найти("059", "Строка");
	ОбъектXDTODTG_2X59 = СоздатьОбъектXDTO("DTG" + НомерФормы + "_2X59", НомерФормы);
	ОбъектXDTODTG_2X59.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Выручка);

	ОбъектXDTODTG_2X60 = СоздатьОбъектXDTO("DTG" + НомерФормы + "_2X60", НомерФормы);
	ОбъектXDTODTG_2X60.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Ставка);

	ОбъектXDTODTG_2X61 = СоздатьОбъектXDTO("DTG" + НомерФормы + "_2X61", НомерФормы);
	ОбъектXDTODTG_2X61.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СуммаНСПРазделаА = СуммаНСПРазделаА + ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	ОбъектXDTODTG_2X62 = СоздатьОбъектXDTO("DTG" + НомерФормы + "_2X62", НомерФормы);
	ОбъектXDTODTG_2X62.Text = ?(СтрокаТаблицы = Неопределено, 0, СуммаНСПРазделаА);
	// Раздел "А" КОНЕЦ
	
	// Раздел "Б" НАЧАЛО
	СуммаНСПРазделаБ = 0;
	
	СтрокаТаблицы = ТаблицаОсновная.Найти("063", "Строка");
	ОбъектXDTODTG_2X63 = СоздатьОбъектXDTO("DTG" + НомерФормы + "_2X63", НомерФормы);
	ОбъектXDTODTG_2X63.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Выручка);
	
	ОбъектXDTODTG_2X64 = СоздатьОбъектXDTO("DTG" + НомерФормы + "_2X64", НомерФормы);
	ОбъектXDTODTG_2X64.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Ставка);

	ОбъектXDTODTG_2X65 = СоздатьОбъектXDTO("DTG" + НомерФормы + "_2X65", НомерФормы);
	ОбъектXDTODTG_2X65.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СуммаНСПРазделаБ = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СтрокаТаблицы = ТаблицаОсновная.Найти("066", "Строка");
	ОбъектXDTODTG_2X66 = СоздатьОбъектXDTO("DTG" + НомерФормы + "_2X66", НомерФормы);
	ОбъектXDTODTG_2X66.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Выручка);

	ОбъектXDTODTG_2X67 = СоздатьОбъектXDTO("DTG" + НомерФормы + "_2X67", НомерФормы);
	ОбъектXDTODTG_2X67.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Ставка);

	ОбъектXDTODTG_2X68 = СоздатьОбъектXDTO("DTG" + НомерФормы + "_2X68", НомерФормы);
	ОбъектXDTODTG_2X68.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СуммаНСПРазделаБ = СуммаНСПРазделаБ + ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СтрокаТаблицы = ТаблицаОсновная.Найти("069", "Строка");
	ОбъектXDTODTG_2X69 = СоздатьОбъектXDTO("DTG" + НомерФормы + "_2X69", НомерФормы);
	ОбъектXDTODTG_2X69.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Выручка);
	
	ОбъектXDTODTG_2X70 = СоздатьОбъектXDTO("DTG" + НомерФормы + "_2X70", НомерФормы);
	ОбъектXDTODTG_2X70.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Ставка);

	ОбъектXDTODTG_2X71 = СоздатьОбъектXDTO("DTG" + НомерФормы + "_2X71", НомерФормы);
	ОбъектXDTODTG_2X71.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СуммаНСПРазделаБ = СуммаНСПРазделаБ + ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СтрокаТаблицы = ТаблицаОсновная.Найти("072", "Строка");
	ОбъектXDTODTG_2X72 = СоздатьОбъектXDTO("DTG" + НомерФормы + "_2X72", НомерФормы);
	ОбъектXDTODTG_2X72.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Выручка);
	
	ОбъектXDTODTG_2X73 = СоздатьОбъектXDTO("DTG" + НомерФормы + "_2X73", НомерФормы);
	ОбъектXDTODTG_2X73.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Ставка);

	ОбъектXDTODTG_2X74 = СоздатьОбъектXDTO("DTG" + НомерФормы + "_2X74", НомерФормы);
	ОбъектXDTODTG_2X74.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СуммаНСПРазделаБ = СуммаНСПРазделаБ + ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	ОбъектXDTODTG_2X75 = СоздатьОбъектXDTO("DTG" + НомерФормы + "_2X75", НомерФормы);
	ОбъектXDTODTG_2X75.Text = ?(СтрокаТаблицы = Неопределено, 0, СуммаНСПРазделаБ);
	// Раздел "Б" КОНЕЦ
	
	// Раздел "В" НАЧАЛО
	СуммаНСПРазделаВ = 0;
	
	СтрокаТаблицы = ТаблицаОсновная.Найти("076", "Строка");
	ОбъектXDTODTG_2X76 = СоздатьОбъектXDTO("DTG" + НомерФормы + "_2X76", НомерФормы);
	ОбъектXDTODTG_2X76.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Выручка);
	
	ОбъектXDTODTG_2X77 = СоздатьОбъектXDTO("DTG" + НомерФормы + "_2X77", НомерФормы);
	ОбъектXDTODTG_2X77.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Ставка);
	
	ОбъектXDTODTG_2X78 = СоздатьОбъектXDTO("DTG" + НомерФормы + "_2X78", НомерФормы);
	ОбъектXDTODTG_2X78.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СуммаНСПРазделаВ = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СтрокаТаблицы = ТаблицаОсновная.Найти("079", "Строка");
	ОбъектXDTODTG_2X79 = СоздатьОбъектXDTO("DTG" + НомерФормы + "_2X79", НомерФормы);
	ОбъектXDTODTG_2X79.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Выручка);
	
	ОбъектXDTODTG_2X80 = СоздатьОбъектXDTO("DTG" + НомерФормы + "_2X80", НомерФормы);
	ОбъектXDTODTG_2X80.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Ставка);
	
	ОбъектXDTODTG_2X81 = СоздатьОбъектXDTO("DTG" + НомерФормы + "_2X81", НомерФормы);
	ОбъектXDTODTG_2X81.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СуммаНСПРазделаВ = СуммаНСПРазделаВ + ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	ОбъектXDTODTG_2X82 = СоздатьОбъектXDTO("DTG" + НомерФормы + "_2X82", НомерФормы);
	ОбъектXDTODTG_2X82.Text = ?(СтрокаТаблицы = Неопределено, 0, СуммаНСПРазделаВ);
	
	ОбъектXDTODTG_TOTALSUM = СоздатьОбъектXDTO("DTG" + НомерФормы + "_TOTALSUM", НомерФормы);
	ОбъектXDTODTG_TOTALSUM.Text = СуммаНСПРазделаА + СуммаНСПРазделаБ + СуммаНСПРазделаВ;
	
	СтрокаТаблицы = ТаблицаОсновная.Найти("084", "Строка");
	ОбъектXDTODTG_2X84 = СоздатьОбъектXDTO("DTG" + НомерФормы + "_2X84", НомерФормы);
	ОбъектXDTODTG_2X84.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Выручка);
	
	СтрокаТаблицы = ТаблицаОсновная.Найти("085", "Строка");
	ОбъектXDTODTG_2X85 = СоздатьОбъектXDTO("DTG" + НомерФормы + "_2X85", НомерФормы);
	ОбъектXDTODTG_2X85.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Выручка);
	
	ОбъектXDTOPART2["DTG" + НомерФормы + "_2X50"].Добавить(ОбъектXDTODTG_2X50);
	ОбъектXDTOPART2["DTG" + НомерФормы + "_2X51"].Добавить(ОбъектXDTODTG_2X51);
	ОбъектXDTOPART2["DTG" + НомерФормы + "_2X52"].Добавить(ОбъектXDTODTG_2X52);
	ОбъектXDTOPART2["DTG" + НомерФормы + "_2X53"].Добавить(ОбъектXDTODTG_2X53);
	ОбъектXDTOPART2["DTG" + НомерФормы + "_2X54"].Добавить(ОбъектXDTODTG_2X54);
	ОбъектXDTOPART2["DTG" + НомерФормы + "_2X55"].Добавить(ОбъектXDTODTG_2X55);
	ОбъектXDTOPART2["DTG" + НомерФормы + "_2X56"].Добавить(ОбъектXDTODTG_2X56);
	ОбъектXDTOPART2["DTG" + НомерФормы + "_2X57"].Добавить(ОбъектXDTODTG_2X57);
	ОбъектXDTOPART2["DTG" + НомерФормы + "_2X58"].Добавить(ОбъектXDTODTG_2X58);
	ОбъектXDTOPART2["DTG" + НомерФормы + "_2X59"].Добавить(ОбъектXDTODTG_2X59);
	ОбъектXDTOPART2["DTG" + НомерФормы + "_2X60"].Добавить(ОбъектXDTODTG_2X60);
	ОбъектXDTOPART2["DTG" + НомерФормы + "_2X61"].Добавить(ОбъектXDTODTG_2X61);
	ОбъектXDTOPART2["DTG" + НомерФормы + "_2X62"].Добавить(ОбъектXDTODTG_2X62);
	ОбъектXDTOPART2["DTG" + НомерФормы + "_2X63"].Добавить(ОбъектXDTODTG_2X63);
	ОбъектXDTOPART2["DTG" + НомерФормы + "_2X64"].Добавить(ОбъектXDTODTG_2X64);
	ОбъектXDTOPART2["DTG" + НомерФормы + "_2X65"].Добавить(ОбъектXDTODTG_2X65);
	ОбъектXDTOPART2["DTG" + НомерФормы + "_2X66"].Добавить(ОбъектXDTODTG_2X66);
	ОбъектXDTOPART2["DTG" + НомерФормы + "_2X67"].Добавить(ОбъектXDTODTG_2X67);
	ОбъектXDTOPART2["DTG" + НомерФормы + "_2X68"].Добавить(ОбъектXDTODTG_2X68);
	ОбъектXDTOPART2["DTG" + НомерФормы + "_2X69"].Добавить(ОбъектXDTODTG_2X69);
	ОбъектXDTOPART2["DTG" + НомерФормы + "_2X70"].Добавить(ОбъектXDTODTG_2X70);
	ОбъектXDTOPART2["DTG" + НомерФормы + "_2X71"].Добавить(ОбъектXDTODTG_2X71);
	ОбъектXDTOPART2["DTG" + НомерФормы + "_2X72"].Добавить(ОбъектXDTODTG_2X72);
	ОбъектXDTOPART2["DTG" + НомерФормы + "_2X73"].Добавить(ОбъектXDTODTG_2X73);
	ОбъектXDTOPART2["DTG" + НомерФормы + "_2X74"].Добавить(ОбъектXDTODTG_2X74);
	ОбъектXDTOPART2["DTG" + НомерФормы + "_2X75"].Добавить(ОбъектXDTODTG_2X75);
	ОбъектXDTOPART2["DTG" + НомерФормы + "_2X76"].Добавить(ОбъектXDTODTG_2X76);
	ОбъектXDTOPART2["DTG" + НомерФормы + "_2X77"].Добавить(ОбъектXDTODTG_2X77);
	ОбъектXDTOPART2["DTG" + НомерФормы + "_2X78"].Добавить(ОбъектXDTODTG_2X78);
	ОбъектXDTOPART2["DTG" + НомерФормы + "_2X79"].Добавить(ОбъектXDTODTG_2X79);
	ОбъектXDTOPART2["DTG" + НомерФормы + "_2X80"].Добавить(ОбъектXDTODTG_2X80);
	ОбъектXDTOPART2["DTG" + НомерФормы + "_2X81"].Добавить(ОбъектXDTODTG_2X81);
	ОбъектXDTOPART2["DTG" + НомерФормы + "_2X82"].Добавить(ОбъектXDTODTG_2X82);
	ОбъектXDTOPART2["DTG" + НомерФормы + "_TOTALSUM"].Добавить(ОбъектXDTODTG_TOTALSUM);
	ОбъектXDTOPART2["DTG" + НомерФормы + "_2X84"].Добавить(ОбъектXDTODTG_2X84);
	ОбъектXDTOPART2["DTG" + НомерФормы + "_2X85"].Добавить(ОбъектXDTODTG_2X85);
	
	Если Объект.ВидСубъекта = 1 Тогда
		ТаблицаПервыйМесяц = ВыборкаШапка.ПриложениеПервыйМесяцКвартала.Выгрузить();
		ТаблицаВторойМесяц = ВыборкаШапка.ПриложениеВторойМесяцКвартала.Выгрузить();
		ТаблицаТретийМесяц = ВыборкаШапка.ПриложениеТретийМесяцКвартала.Выгрузить();
		
		ОбъектXDTODTG130_2_DECLARATIONDETAIL1 = СоздатьОбъектXDTO("DTG130_2_DECLARATIONDETAIL1", НомерФормы);
		
		СтруктураИтогов = Новый Структура();
		СтруктураИтогов.Вставить("ИтогСуммаНСПЗаПервыйМесяц", 0);
		СтруктураИтогов.Вставить("ИтогСуммаНСПЗаВторойМесяц", 0);
		СтруктураИтогов.Вставить("ИтогСуммаНСПЗаТретийМесяц", 0);
		
		DTG130_2_DECLARATIONDETAIL1_ПервыйМесяц(ОбъектXDTODTG130_2_DECLARATIONDETAIL1, ТаблицаПервыйМесяц, СтруктураИтогов);
		DTG130_2_DECLARATIONDETAIL1_ВторойМесяц(ОбъектXDTODTG130_2_DECLARATIONDETAIL1, ТаблицаВторойМесяц, СтруктураИтогов);
		DTG130_2_DECLARATIONDETAIL1_ТретийМесяц(ОбъектXDTODTG130_2_DECLARATIONDETAIL1, ТаблицаТретийМесяц, СтруктураИтогов);
		
		ОбъектXDTODTG130_2XTOTALM1 = СоздатьОбъектXDTO("DTG130_2XTOTALM1", НомерФормы);
		ОбъектXDTODTG130_2XTOTALM1.Text = СтруктураИтогов.ИтогСуммаНСПЗаПервыйМесяц;
		
		ОбъектXDTODTG130_2XTOTALM2 = СоздатьОбъектXDTO("DTG130_2XTOTALM2", НомерФормы);
		ОбъектXDTODTG130_2XTOTALM2.Text = СтруктураИтогов.ИтогСуммаНСПЗаВторойМесяц;
		
		ОбъектXDTODTG130_2XTOTALM3 = СоздатьОбъектXDTO("DTG130_2XTOTALM3", НомерФормы);
		ОбъектXDTODTG130_2XTOTALM3.Text = СтруктураИтогов.ИтогСуммаНСПЗаТретийМесяц;
		
		ОбъектXDTOPART2.DTG130_2XTOTALM1.Добавить(ОбъектXDTODTG130_2XTOTALM1);
		ОбъектXDTOPART2.DTG130_2XTOTALM2.Добавить(ОбъектXDTODTG130_2XTOTALM2);
		ОбъектXDTOPART2.DTG130_2XTOTALM3.Добавить(ОбъектXDTODTG130_2XTOTALM3);
		
		ОбъектXDTOPART2.DTG130_2_DECLARATIONDETAIL1.Добавить(ОбъектXDTODTG130_2_DECLARATIONDETAIL1);
	КонецЕсли;	
	
	ОбъектXDTO.PART2.Добавить(ОбъектXDTOPART2);
	// PART2 - КОНЕЦ
	
	// Если есть ошибки файл не создается.
	Если МассивОшибок.Количество() > 0 Тогда
		
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Файл XML не сформирован по следующим причинам:'"));
		
		Для Каждого СтрокаМассива Из МассивОшибок Цикл
			ОбщегоНазначения.СообщитьПользователю(СтрокаМассива);			
		КонецЦикла;	
		
		Возврат Неопределено;
		
	Иначе
		// Создание файла.
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
		ЗаписьXML = Новый ЗаписьXML;
		ПараметрыЗаписиXML = Новый ПараметрыЗаписиXML("UTF-8", "1.0", Ложь);	
		ЗаписьXML.ОткрытьФайл(ИмяВременногоФайла, ПараметрыЗаписиXML);
		ЗаписьXML.ЗаписатьОбъявлениеXML();
		ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектXDTO);
		ЗаписьXML.Закрыть();
		
		//// Удаление лишнего текста из xml файла
		//ТекстДокумент = Новый ТекстовыйДокумент;
		//ТекстДокумент.Прочитать(ИмяВременногоФайла);
		//ТекстФайла = ТекстДокумент.ПолучитьТекст();
		//ТекстФайла = СтрЗаменить(
		//	ТекстФайла,
		//	"http://www.dostek.kg/FORMDOSTEKSTI",
		//	"http://www.dostek.kg/FORMDOSTEKSTI" + НомерФормы);
		//ТекстДокумент.УстановитьТекст(ТекстФайла);	
		//ТекстДокумент.Записать(ИмяВременногоФайла);	
		
		Двоичное = Новый ДвоичныеДанные(ИмяВременногоФайла);
		АдресВременногоХранилища = ПоместитьВоВременноеХранилище(Двоичное, УникальныйИдентификатор);
		
		СтруктураДанных.ИмяФайла = ИмяФайла;
		СтруктураДанных.АдресВременногоХранилища = АдресВременногоХранилища;
		
		Возврат СтруктураДанных;
	КонецЕсли;
КонецФункции // ФормированиеФайла()

// Процедура для заполнения первого месяца квартала в xml файле
//
&НаСервере
Процедура DTG130_2_DECLARATIONDETAIL1_ПервыйМесяц(ОбъектXDTODTG130_2_DECLARATIONDETAIL1, Таблица, СтруктураИтогов)
	
	ОбъектXDTOMONTH1 = СоздатьОбъектXDTO("MONTH1", "130");
	ОбъектXDTOMONTH1.Text = Месяц(НачалоКвартала(ДатаДокумента));
	
	ОбъектXDTOYEAR1 = СоздатьОбъектXDTO("YEAR1", "130");
	ОбъектXDTOYEAR1.Text = Формат(Год(ДатаДокумента), "ЧГ=0");
	
	// Раздел "А" НАЧАЛО
	СуммаНСПРазделаА = 0;
	
	СтрокаТаблицы = Таблица.Найти("150", "Строка");
	ОбъектXDTODTG130_2X150 = СоздатьОбъектXDTO("DTG130_2X150", "130");
	ОбъектXDTODTG130_2X150.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Выручка);
	
	ОбъектXDTODTG130_2X151 = СоздатьОбъектXDTO("DTG130_2X151", "130");
	ОбъектXDTODTG130_2X151.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Ставка);
	
	ОбъектXDTODTG130_2X152 = СоздатьОбъектXDTO("DTG130_2X152", "130");
	ОбъектXDTODTG130_2X152.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СуммаНСПРазделаА = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СтрокаТаблицы = Таблица.Найти("153", "Строка");
	ОбъектXDTODTG130_2X153 = СоздатьОбъектXDTO("DTG130_2X153", "130");
	ОбъектXDTODTG130_2X153.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Выручка);
	
	ОбъектXDTODTG130_2X154 = СоздатьОбъектXDTO("DTG130_2X154", "130");
	ОбъектXDTODTG130_2X154.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Ставка);
	
	ОбъектXDTODTG130_2X155 = СоздатьОбъектXDTO("DTG130_2X155", "130");
	ОбъектXDTODTG130_2X155.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СуммаНСПРазделаА = СуммаНСПРазделаА + ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СтрокаТаблицы = Таблица.Найти("156", "Строка");
	ОбъектXDTODTG130_2X156 = СоздатьОбъектXDTO("DTG130_2X156", "130");
	ОбъектXDTODTG130_2X156.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Выручка);

	ОбъектXDTODTG130_2X157 = СоздатьОбъектXDTO("DTG130_2X157", "130");
	ОбъектXDTODTG130_2X157.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Ставка);

	ОбъектXDTODTG130_2X158 = СоздатьОбъектXDTO("DTG130_2X158", "130");
	ОбъектXDTODTG130_2X158.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СуммаНСПРазделаА = СуммаНСПРазделаА + ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СтрокаТаблицы = Таблица.Найти("159", "Строка");
	ОбъектXDTODTG130_2X159 = СоздатьОбъектXDTO("DTG130_2X159", "130");
	ОбъектXDTODTG130_2X159.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Выручка);
	
	ОбъектXDTODTG130_2X160 = СоздатьОбъектXDTO("DTG130_2X160", "130");
	ОбъектXDTODTG130_2X160.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Ставка);

	ОбъектXDTODTG130_2X161 = СоздатьОбъектXDTO("DTG130_2X161", "130");
	ОбъектXDTODTG130_2X161.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СуммаНСПРазделаА = СуммаНСПРазделаА + ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	ОбъектXDTODTG130_2X162 = СоздатьОбъектXDTO("DTG130_2X162", "130");
	ОбъектXDTODTG130_2X162.Text = ?(СтрокаТаблицы = Неопределено, 0, СуммаНСПРазделаА);
	// Раздел "А" КОНЕЦ
	
	// Раздел "Б" НАЧАЛО
	СуммаНСПРазделаБ = 0;
	
	СтрокаТаблицы = Таблица.Найти("163", "Строка");
	ОбъектXDTODTG130_2X163 = СоздатьОбъектXDTO("DTG130_2X163", "130");
	ОбъектXDTODTG130_2X163.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Выручка);
	
	ОбъектXDTODTG130_2X164 = СоздатьОбъектXDTO("DTG130_2X164", "130");
	ОбъектXDTODTG130_2X164.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Ставка);
	
	ОбъектXDTODTG130_2X165 = СоздатьОбъектXDTO("DTG130_2X165", "130");
	ОбъектXDTODTG130_2X165.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СуммаНСПРазделаБ = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СтрокаТаблицы = Таблица.Найти("166", "Строка");
	ОбъектXDTODTG130_2X166 = СоздатьОбъектXDTO("DTG130_2X166", "130");
	ОбъектXDTODTG130_2X166.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Выручка);
	
	ОбъектXDTODTG130_2X167 = СоздатьОбъектXDTO("DTG130_2X167", "130");
	ОбъектXDTODTG130_2X167.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Ставка);
	
	ОбъектXDTODTG130_2X168 = СоздатьОбъектXDTO("DTG130_2X168", "130");
	ОбъектXDTODTG130_2X168.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СуммаНСПРазделаБ = СуммаНСПРазделаБ + ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СтрокаТаблицы = Таблица.Найти("169", "Строка");
	ОбъектXDTODTG130_2X169 = СоздатьОбъектXDTO("DTG130_2X169", "130");
	ОбъектXDTODTG130_2X169.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Выручка);
	
	ОбъектXDTODTG130_2X170 = СоздатьОбъектXDTO("DTG130_2X170", "130");
	ОбъектXDTODTG130_2X170.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Ставка);

	ОбъектXDTODTG130_2X171 = СоздатьОбъектXDTO("DTG130_2X171", "130");
	ОбъектXDTODTG130_2X171.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СуммаНСПРазделаБ = СуммаНСПРазделаБ + ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СтрокаТаблицы = Таблица.Найти("172", "Строка");
	ОбъектXDTODTG130_2X172 = СоздатьОбъектXDTO("DTG130_2X172", "130");
	ОбъектXDTODTG130_2X172.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Выручка);

	ОбъектXDTODTG130_2X173 = СоздатьОбъектXDTO("DTG130_2X173", "130");
	ОбъектXDTODTG130_2X173.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Ставка);

	ОбъектXDTODTG130_2X174 = СоздатьОбъектXDTO("DTG130_2X174", "130");
	ОбъектXDTODTG130_2X174.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СуммаНСПРазделаБ = СуммаНСПРазделаБ + ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	ОбъектXDTODTG130_2X175 = СоздатьОбъектXDTO("DTG130_2X175", "130");
	ОбъектXDTODTG130_2X175.Text = ?(СтрокаТаблицы = Неопределено, 0, СуммаНСПРазделаБ);
	// Раздел "Б" КОНЕЦ	
	
	// Раздел "В" НАЧАЛО
	СуммаНСПРазделаВ = 0;
	
	СтрокаТаблицы = Таблица.Найти("176", "Строка");
	ОбъектXDTODTG130_2X176 = СоздатьОбъектXDTO("DTG130_2X176", "130");
	ОбъектXDTODTG130_2X176.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Выручка);
	
	ОбъектXDTODTG130_2X177 = СоздатьОбъектXDTO("DTG130_2X177", "130");
	ОбъектXDTODTG130_2X177.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Ставка);
	
	ОбъектXDTODTG130_2X178 = СоздатьОбъектXDTO("DTG130_2X178", "130");
	ОбъектXDTODTG130_2X178.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СуммаНСПРазделаВ = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СтрокаТаблицы = Таблица.Найти("179", "Строка");
	ОбъектXDTODTG130_2X179 = СоздатьОбъектXDTO("DTG130_2X179", "130");
	ОбъектXDTODTG130_2X179.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Выручка);
	
	ОбъектXDTODTG130_2X180 = СоздатьОбъектXDTO("DTG130_2X180", "130");
	ОбъектXDTODTG130_2X180.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Ставка);
	
	ОбъектXDTODTG130_2X181 = СоздатьОбъектXDTO("DTG130_2X181", "130");
	ОбъектXDTODTG130_2X181.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СуммаНСПРазделаВ = СуммаНСПРазделаВ + ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	ОбъектXDTODTG130_2X182 = СоздатьОбъектXDTO("DTG130_2X182", "130");
	ОбъектXDTODTG130_2X182.Text = ?(СтрокаТаблицы = Неопределено, 0, СуммаНСПРазделаВ);
	// Раздел "В" КОНЕЦ
	
	СтрокаТаблицы = Таблица.Найти("184", "Строка");
	ОбъектXDTODTG130_2X184 = СоздатьОбъектXDTO("DTG130_2X184", "130");
	ОбъектXDTODTG130_2X184.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Выручка);
	
	СтрокаТаблицы = Таблица.Найти("185", "Строка");
	ОбъектXDTODTG130_2X185 = СоздатьОбъектXDTO("DTG130_2X185", "130");
	ОбъектXDTODTG130_2X185.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Выручка);
	
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.MONTH1.Добавить(ОбъектXDTOMONTH1);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.YEAR1.Добавить(ОбъектXDTOYEAR1);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X150.Добавить(ОбъектXDTODTG130_2X150);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X151.Добавить(ОбъектXDTODTG130_2X151);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X152.Добавить(ОбъектXDTODTG130_2X152);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X153.Добавить(ОбъектXDTODTG130_2X153);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X154.Добавить(ОбъектXDTODTG130_2X154);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X155.Добавить(ОбъектXDTODTG130_2X155);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X156.Добавить(ОбъектXDTODTG130_2X156);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X157.Добавить(ОбъектXDTODTG130_2X157);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X158.Добавить(ОбъектXDTODTG130_2X158);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X159.Добавить(ОбъектXDTODTG130_2X159);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X160.Добавить(ОбъектXDTODTG130_2X160);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X161.Добавить(ОбъектXDTODTG130_2X161);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X162.Добавить(ОбъектXDTODTG130_2X162);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X163.Добавить(ОбъектXDTODTG130_2X163);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X164.Добавить(ОбъектXDTODTG130_2X164);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X165.Добавить(ОбъектXDTODTG130_2X165);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X166.Добавить(ОбъектXDTODTG130_2X166);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X167.Добавить(ОбъектXDTODTG130_2X167);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X168.Добавить(ОбъектXDTODTG130_2X168);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X169.Добавить(ОбъектXDTODTG130_2X169);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X170.Добавить(ОбъектXDTODTG130_2X170);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X171.Добавить(ОбъектXDTODTG130_2X171);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X172.Добавить(ОбъектXDTODTG130_2X172);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X173.Добавить(ОбъектXDTODTG130_2X173);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X174.Добавить(ОбъектXDTODTG130_2X174);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X175.Добавить(ОбъектXDTODTG130_2X175);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X176.Добавить(ОбъектXDTODTG130_2X176);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X177.Добавить(ОбъектXDTODTG130_2X177);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X178.Добавить(ОбъектXDTODTG130_2X178);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X179.Добавить(ОбъектXDTODTG130_2X179);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X180.Добавить(ОбъектXDTODTG130_2X180);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X181.Добавить(ОбъектXDTODTG130_2X181);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X182.Добавить(ОбъектXDTODTG130_2X182);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X184.Добавить(ОбъектXDTODTG130_2X184);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X185.Добавить(ОбъектXDTODTG130_2X185);
	
	СтруктураИтогов.ИтогСуммаНСПЗаПервыйМесяц = СуммаНСПРазделаА + СуммаНСПРазделаБ + СуммаНСПРазделаВ;
КонецПроцедуры

// Процедура для заполнения второго месяца квартала в xml файле
//
&НаСервере
Процедура DTG130_2_DECLARATIONDETAIL1_ВторойМесяц(ОбъектXDTODTG130_2_DECLARATIONDETAIL1, Таблица, СтруктураИтогов)
	
	ОбъектXDTOMONTH2 = СоздатьОбъектXDTO("MONTH2", "130");
	ОбъектXDTOMONTH2.Text = Месяц(НачалоКвартала(ДатаДокумента)) + 1;
	
	ОбъектXDTOYEAR2 = СоздатьОбъектXDTO("YEAR2", "130");
	ОбъектXDTOYEAR2.Text = Формат(Год(ДатаДокумента), "ЧГ=0");
	
	// Раздел "А" НАЧАЛО
	СуммаНСПРазделаА = 0;
	
	СтрокаТаблицы = Таблица.Найти("200", "Строка");
	ОбъектXDTODTG130_2X200 = СоздатьОбъектXDTO("DTG130_2X200", "130");
	ОбъектXDTODTG130_2X200.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Выручка);
	
	ОбъектXDTODTG130_2X201 = СоздатьОбъектXDTO("DTG130_2X201", "130");
	ОбъектXDTODTG130_2X201.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Ставка);
	
	ОбъектXDTODTG130_2X202 = СоздатьОбъектXDTO("DTG130_2X202", "130");
	ОбъектXDTODTG130_2X202.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СуммаНСПРазделаА = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СтрокаТаблицы = Таблица.Найти("203", "Строка");
	ОбъектXDTODTG130_2X203 = СоздатьОбъектXDTO("DTG130_2X203", "130");
	ОбъектXDTODTG130_2X203.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Выручка);
	
	ОбъектXDTODTG130_2X204 = СоздатьОбъектXDTO("DTG130_2X204", "130");
	ОбъектXDTODTG130_2X204.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Ставка);
	
	ОбъектXDTODTG130_2X205 = СоздатьОбъектXDTO("DTG130_2X205", "130");
	ОбъектXDTODTG130_2X205.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СуммаНСПРазделаА = СуммаНСПРазделаА + ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СтрокаТаблицы = Таблица.Найти("206", "Строка");
	ОбъектXDTODTG130_2X206 = СоздатьОбъектXDTO("DTG130_2X206", "130");
	ОбъектXDTODTG130_2X206.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Выручка);
	
	ОбъектXDTODTG130_2X207 = СоздатьОбъектXDTO("DTG130_2X207", "130");
	ОбъектXDTODTG130_2X207.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Ставка);
	
	ОбъектXDTODTG130_2X208 = СоздатьОбъектXDTO("DTG130_2X208", "130");
	ОбъектXDTODTG130_2X208.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СуммаНСПРазделаА = СуммаНСПРазделаА + ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СтрокаТаблицы = Таблица.Найти("209", "Строка");
	ОбъектXDTODTG130_2X209 = СоздатьОбъектXDTO("DTG130_2X209", "130");
	ОбъектXDTODTG130_2X209.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Выручка);
	
	ОбъектXDTODTG130_2X210 = СоздатьОбъектXDTO("DTG130_2X210", "130");
	ОбъектXDTODTG130_2X210.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Ставка);
	
	ОбъектXDTODTG130_2X211 = СоздатьОбъектXDTO("DTG130_2X211", "130");
	ОбъектXDTODTG130_2X211.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СуммаНСПРазделаА = СуммаНСПРазделаА + ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	ОбъектXDTODTG130_2X212 = СоздатьОбъектXDTO("DTG130_2X212", "130");
	ОбъектXDTODTG130_2X212.Text = ?(СтрокаТаблицы = Неопределено, 0, СуммаНСПРазделаА);
	// Раздел "А" КОНЕЦ
	
	// Раздел "Б" НАЧАЛО
	СуммаНСПРазделаБ = 0;
	
	СтрокаТаблицы = Таблица.Найти("213", "Строка");
	ОбъектXDTODTG130_2X213 = СоздатьОбъектXDTO("DTG130_2X213", "130");
	ОбъектXDTODTG130_2X213.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Выручка);
	
	ОбъектXDTODTG130_2X214 = СоздатьОбъектXDTO("DTG130_2X214", "130");
	ОбъектXDTODTG130_2X214.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Ставка);
	
	ОбъектXDTODTG130_2X215 = СоздатьОбъектXDTO("DTG130_2X215", "130");
	ОбъектXDTODTG130_2X215.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СуммаНСПРазделаБ = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СтрокаТаблицы = Таблица.Найти("216", "Строка");
	ОбъектXDTODTG130_2X216 = СоздатьОбъектXDTO("DTG130_2X216", "130");
	ОбъектXDTODTG130_2X216.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Выручка);
	
	ОбъектXDTODTG130_2X217 = СоздатьОбъектXDTO("DTG130_2X217", "130");
	ОбъектXDTODTG130_2X217.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Ставка);
	
	ОбъектXDTODTG130_2X218 = СоздатьОбъектXDTO("DTG130_2X218", "130");
	ОбъектXDTODTG130_2X218.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СуммаНСПРазделаБ = СуммаНСПРазделаБ + ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СтрокаТаблицы = Таблица.Найти("219", "Строка");
	ОбъектXDTODTG130_2X219 = СоздатьОбъектXDTO("DTG130_2X219", "130");
	ОбъектXDTODTG130_2X219.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Выручка);
	
	ОбъектXDTODTG130_2X220 = СоздатьОбъектXDTO("DTG130_2X220", "130");
	ОбъектXDTODTG130_2X220.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Ставка);
	
	ОбъектXDTODTG130_2X221 = СоздатьОбъектXDTO("DTG130_2X221", "130");
	ОбъектXDTODTG130_2X221.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СуммаНСПРазделаБ = СуммаНСПРазделаБ + ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СтрокаТаблицы = Таблица.Найти("222", "Строка");
	ОбъектXDTODTG130_2X222 = СоздатьОбъектXDTO("DTG130_2X222", "130");
	ОбъектXDTODTG130_2X222.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Выручка);
	
	ОбъектXDTODTG130_2X223 = СоздатьОбъектXDTO("DTG130_2X223", "130");
	ОбъектXDTODTG130_2X223.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Ставка);

	ОбъектXDTODTG130_2X224 = СоздатьОбъектXDTO("DTG130_2X224", "130");
	ОбъектXDTODTG130_2X224.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СуммаНСПРазделаБ = СуммаНСПРазделаБ + ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	ОбъектXDTODTG130_2X225 = СоздатьОбъектXDTO("DTG130_2X225", "130");
	ОбъектXDTODTG130_2X225.Text = ?(СтрокаТаблицы = Неопределено, 0, СуммаНСПРазделаБ);
	// Раздел "Б" КОНЕЦ
	
	// Раздел "В" НАЧАЛО
	СуммаНСПРазделаВ = 0;	
	
	СтрокаТаблицы = Таблица.Найти("226", "Строка");
	ОбъектXDTODTG130_2X226 = СоздатьОбъектXDTO("DTG130_2X226", "130");
	ОбъектXDTODTG130_2X226.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Выручка);
	
	ОбъектXDTODTG130_2X227 = СоздатьОбъектXDTO("DTG130_2X227", "130");
	ОбъектXDTODTG130_2X227.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Ставка);
	
	ОбъектXDTODTG130_2X228 = СоздатьОбъектXDTO("DTG130_2X228", "130");
	ОбъектXDTODTG130_2X228.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СуммаНСПРазделаВ = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СтрокаТаблицы = Таблица.Найти("229", "Строка");
	ОбъектXDTODTG130_2X229 = СоздатьОбъектXDTO("DTG130_2X229", "130");
	ОбъектXDTODTG130_2X229.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Выручка);
	
	ОбъектXDTODTG130_2X230 = СоздатьОбъектXDTO("DTG130_2X230", "130");
	ОбъектXDTODTG130_2X230.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Ставка);
	
	ОбъектXDTODTG130_2X231 = СоздатьОбъектXDTO("DTG130_2X231", "130");
	ОбъектXDTODTG130_2X231.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СуммаНСПРазделаВ = СуммаНСПРазделаВ + ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	ОбъектXDTODTG130_2X232 = СоздатьОбъектXDTO("DTG130_2X232", "130");
	ОбъектXDTODTG130_2X232.Text = ?(СтрокаТаблицы = Неопределено, 0, СуммаНСПРазделаВ);
	// Раздел "В" КОНЕЦ
	
	СтрокаТаблицы = Таблица.Найти("234", "Строка");
	ОбъектXDTODTG130_2X234 = СоздатьОбъектXDTO("DTG130_2X234", "130");
	ОбъектXDTODTG130_2X234.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Выручка);
	
	СтрокаТаблицы = Таблица.Найти("235", "Строка");
	ОбъектXDTODTG130_2X235 = СоздатьОбъектXDTO("DTG130_2X235", "130");
	ОбъектXDTODTG130_2X235.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Выручка);
	
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.MONTH2.Добавить(ОбъектXDTOMONTH2);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.YEAR2.Добавить(ОбъектXDTOYEAR2);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X200.Добавить(ОбъектXDTODTG130_2X200);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X201.Добавить(ОбъектXDTODTG130_2X201);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X202.Добавить(ОбъектXDTODTG130_2X202);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X203.Добавить(ОбъектXDTODTG130_2X203);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X204.Добавить(ОбъектXDTODTG130_2X204);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X205.Добавить(ОбъектXDTODTG130_2X205);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X206.Добавить(ОбъектXDTODTG130_2X206);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X207.Добавить(ОбъектXDTODTG130_2X207);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X208.Добавить(ОбъектXDTODTG130_2X208);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X209.Добавить(ОбъектXDTODTG130_2X209);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X210.Добавить(ОбъектXDTODTG130_2X210);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X211.Добавить(ОбъектXDTODTG130_2X211);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X212.Добавить(ОбъектXDTODTG130_2X212);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X213.Добавить(ОбъектXDTODTG130_2X213);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X214.Добавить(ОбъектXDTODTG130_2X214);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X215.Добавить(ОбъектXDTODTG130_2X215);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X216.Добавить(ОбъектXDTODTG130_2X216);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X217.Добавить(ОбъектXDTODTG130_2X217);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X218.Добавить(ОбъектXDTODTG130_2X218);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X219.Добавить(ОбъектXDTODTG130_2X219);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X220.Добавить(ОбъектXDTODTG130_2X220);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X221.Добавить(ОбъектXDTODTG130_2X221);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X222.Добавить(ОбъектXDTODTG130_2X222);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X223.Добавить(ОбъектXDTODTG130_2X223);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X224.Добавить(ОбъектXDTODTG130_2X224);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X225.Добавить(ОбъектXDTODTG130_2X225);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X226.Добавить(ОбъектXDTODTG130_2X226);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X227.Добавить(ОбъектXDTODTG130_2X227);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X228.Добавить(ОбъектXDTODTG130_2X228);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X229.Добавить(ОбъектXDTODTG130_2X229);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X230.Добавить(ОбъектXDTODTG130_2X230);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X231.Добавить(ОбъектXDTODTG130_2X231);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X232.Добавить(ОбъектXDTODTG130_2X232);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X234.Добавить(ОбъектXDTODTG130_2X234);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X235.Добавить(ОбъектXDTODTG130_2X235);
	
	СтруктураИтогов.ИтогСуммаНСПЗаВторойМесяц = СуммаНСПРазделаА + СуммаНСПРазделаБ + СуммаНСПРазделаВ;
КонецПроцедуры

// Процедура для заполнения третьего месяца квартала в xml файле
//
&НаСервере
Процедура DTG130_2_DECLARATIONDETAIL1_ТретийМесяц(ОбъектXDTODTG130_2_DECLARATIONDETAIL1, Таблица, СтруктураИтогов)
	
	ОбъектXDTOMONTH3 = СоздатьОбъектXDTO("MONTH3", "130");
	ОбъектXDTOMONTH3.Text = Месяц(НачалоКвартала(ДатаДокумента)) + 2;
	
	ОбъектXDTOYEAR3 = СоздатьОбъектXDTO("YEAR3", "130");
	ОбъектXDTOYEAR3.Text = Формат(Год(ДатаДокумента), "ЧГ=0");
	
	// Раздел "А" НАЧАЛО
	СуммаНСПРазделаА = 0;
	
	СтрокаТаблицы = Таблица.Найти("250", "Строка");
	ОбъектXDTODTG130_2X250 = СоздатьОбъектXDTO("DTG130_2X250", "130");
	ОбъектXDTODTG130_2X250.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Выручка);
	
	ОбъектXDTODTG130_2X251 = СоздатьОбъектXDTO("DTG130_2X251", "130");
	ОбъектXDTODTG130_2X251.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Ставка);
	
	ОбъектXDTODTG130_2X252 = СоздатьОбъектXDTO("DTG130_2X252", "130");
	ОбъектXDTODTG130_2X252.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СуммаНСПРазделаА = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СтрокаТаблицы = Таблица.Найти("253", "Строка");
	ОбъектXDTODTG130_2X253 = СоздатьОбъектXDTO("DTG130_2X253", "130");
	ОбъектXDTODTG130_2X253.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Выручка);
	
	ОбъектXDTODTG130_2X254 = СоздатьОбъектXDTO("DTG130_2X254", "130");
	ОбъектXDTODTG130_2X254.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Ставка);

	ОбъектXDTODTG130_2X255 = СоздатьОбъектXDTO("DTG130_2X255", "130");
	ОбъектXDTODTG130_2X255.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СуммаНСПРазделаА = СуммаНСПРазделаА + ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СтрокаТаблицы = Таблица.Найти("256", "Строка");
	ОбъектXDTODTG130_2X256 = СоздатьОбъектXDTO("DTG130_2X256", "130");
	ОбъектXDTODTG130_2X256.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Выручка);
	
	ОбъектXDTODTG130_2X257 = СоздатьОбъектXDTO("DTG130_2X257", "130");
	ОбъектXDTODTG130_2X257.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Ставка);

	ОбъектXDTODTG130_2X258 = СоздатьОбъектXDTO("DTG130_2X258", "130");
	ОбъектXDTODTG130_2X258.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СуммаНСПРазделаА = СуммаНСПРазделаА + ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СтрокаТаблицы = Таблица.Найти("259", "Строка");
	ОбъектXDTODTG130_2X259 = СоздатьОбъектXDTO("DTG130_2X259", "130");
	ОбъектXDTODTG130_2X259.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Выручка);
	
	ОбъектXDTODTG130_2X260 = СоздатьОбъектXDTO("DTG130_2X260", "130");
	ОбъектXDTODTG130_2X260.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Ставка);
	
	ОбъектXDTODTG130_2X261 = СоздатьОбъектXDTO("DTG130_2X261", "130");
	ОбъектXDTODTG130_2X261.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СуммаНСПРазделаА = СуммаНСПРазделаА + ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	ОбъектXDTODTG130_2X262 = СоздатьОбъектXDTO("DTG130_2X262", "130");
	ОбъектXDTODTG130_2X262.Text = ?(СтрокаТаблицы = Неопределено, 0, СуммаНСПРазделаА);
	// Раздел "А" КОНЕЦ
	
	// Раздел "Б" НАЧАЛО
	СуммаНСПРазделаБ = 0;
	
	СтрокаТаблицы = Таблица.Найти("263", "Строка");
	ОбъектXDTODTG130_2X263 = СоздатьОбъектXDTO("DTG130_2X263", "130");
	ОбъектXDTODTG130_2X263.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Выручка);
	
	ОбъектXDTODTG130_2X264 = СоздатьОбъектXDTO("DTG130_2X264", "130");
	ОбъектXDTODTG130_2X264.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Ставка);
	
	ОбъектXDTODTG130_2X265 = СоздатьОбъектXDTO("DTG130_2X265", "130");
	ОбъектXDTODTG130_2X265.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СуммаНСПРазделаБ = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СтрокаТаблицы = Таблица.Найти("266", "Строка");
	ОбъектXDTODTG130_2X266 = СоздатьОбъектXDTO("DTG130_2X266", "130");
	ОбъектXDTODTG130_2X266.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Выручка);
	
	ОбъектXDTODTG130_2X267 = СоздатьОбъектXDTO("DTG130_2X267", "130");
	ОбъектXDTODTG130_2X267.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Ставка);
	
	ОбъектXDTODTG130_2X268 = СоздатьОбъектXDTO("DTG130_2X268", "130");
	ОбъектXDTODTG130_2X268.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СуммаНСПРазделаБ = СуммаНСПРазделаБ + ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СтрокаТаблицы = Таблица.Найти("269", "Строка");
	ОбъектXDTODTG130_2X269 = СоздатьОбъектXDTO("DTG130_2X269", "130");
	ОбъектXDTODTG130_2X269.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Выручка);
	
	ОбъектXDTODTG130_2X270 = СоздатьОбъектXDTO("DTG130_2X270", "130");
	ОбъектXDTODTG130_2X270.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Ставка);
	
	ОбъектXDTODTG130_2X271 = СоздатьОбъектXDTO("DTG130_2X271", "130");
	ОбъектXDTODTG130_2X271.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СуммаНСПРазделаБ = СуммаНСПРазделаБ + ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СтрокаТаблицы = Таблица.Найти("272", "Строка");
	ОбъектXDTODTG130_2X272 = СоздатьОбъектXDTO("DTG130_2X272", "130");
	ОбъектXDTODTG130_2X272.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Выручка);
	
	ОбъектXDTODTG130_2X273 = СоздатьОбъектXDTO("DTG130_2X273", "130");
	ОбъектXDTODTG130_2X273.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Ставка);
	
	ОбъектXDTODTG130_2X274 = СоздатьОбъектXDTO("DTG130_2X274", "130");
	ОбъектXDTODTG130_2X274.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СуммаНСПРазделаБ = СуммаНСПРазделаБ + ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
		
	ОбъектXDTODTG130_2X275 = СоздатьОбъектXDTO("DTG130_2X275", "130");
	ОбъектXDTODTG130_2X275.Text = ?(СтрокаТаблицы = Неопределено, 0, СуммаНСПРазделаБ);
	// Раздел "Б" КОНЕЦ
	
	// Раздел "В" НАЧАЛО
	СуммаНСПРазделаВ = 0;	
	
	СтрокаТаблицы = Таблица.Найти("276", "Строка");
	ОбъектXDTODTG130_2X276 = СоздатьОбъектXDTO("DTG130_2X276", "130");
	ОбъектXDTODTG130_2X276.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Выручка);
	
	ОбъектXDTODTG130_2X277 = СоздатьОбъектXDTO("DTG130_2X277", "130");
	ОбъектXDTODTG130_2X277.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Ставка);
	
	ОбъектXDTODTG130_2X278 = СоздатьОбъектXDTO("DTG130_2X278", "130");
	ОбъектXDTODTG130_2X278.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СуммаНСПРазделаВ = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СтрокаТаблицы = Таблица.Найти("279", "Строка");
	ОбъектXDTODTG130_2X279 = СоздатьОбъектXDTO("DTG130_2X279", "130");
	ОбъектXDTODTG130_2X279.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Выручка);

	ОбъектXDTODTG130_2X280 = СоздатьОбъектXDTO("DTG130_2X280", "130");
	ОбъектXDTODTG130_2X280.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Ставка);

	ОбъектXDTODTG130_2X281 = СоздатьОбъектXDTO("DTG130_2X281", "130");
	ОбъектXDTODTG130_2X281.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	СуммаНСПРазделаВ = СуммаНСПРазделаВ + ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.СуммаНСП);
	
	ОбъектXDTODTG130_2X282 = СоздатьОбъектXDTO("DTG130_2X282", "130");
	ОбъектXDTODTG130_2X282.Text = ?(СтрокаТаблицы = Неопределено, 0, СуммаНСПРазделаВ);
	// Раздел "В" КОНЕЦ	
	
	СтрокаТаблицы = Таблица.Найти("284", "Строка");
	ОбъектXDTODTG130_2X284 = СоздатьОбъектXDTO("DTG130_2X284", "130");
	ОбъектXDTODTG130_2X284.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Выручка);
	
	СтрокаТаблицы = Таблица.Найти("285", "Строка");
	ОбъектXDTODTG130_2X285 = СоздатьОбъектXDTO("DTG130_2X285", "130");
	ОбъектXDTODTG130_2X285.Text = ?(СтрокаТаблицы = Неопределено, 0, СтрокаТаблицы.Выручка);
	
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.MONTH3.Добавить(ОбъектXDTOMONTH3);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.YEAR3.Добавить(ОбъектXDTOYEAR3);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X250.Добавить(ОбъектXDTODTG130_2X250);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X251.Добавить(ОбъектXDTODTG130_2X251);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X252.Добавить(ОбъектXDTODTG130_2X252);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X253.Добавить(ОбъектXDTODTG130_2X253);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X254.Добавить(ОбъектXDTODTG130_2X254);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X255.Добавить(ОбъектXDTODTG130_2X255);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X256.Добавить(ОбъектXDTODTG130_2X256);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X257.Добавить(ОбъектXDTODTG130_2X257);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X258.Добавить(ОбъектXDTODTG130_2X258);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X259.Добавить(ОбъектXDTODTG130_2X259);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X260.Добавить(ОбъектXDTODTG130_2X260);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X261.Добавить(ОбъектXDTODTG130_2X261);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X262.Добавить(ОбъектXDTODTG130_2X262);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X263.Добавить(ОбъектXDTODTG130_2X263);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X264.Добавить(ОбъектXDTODTG130_2X264);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X265.Добавить(ОбъектXDTODTG130_2X265);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X266.Добавить(ОбъектXDTODTG130_2X266);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X267.Добавить(ОбъектXDTODTG130_2X267);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X268.Добавить(ОбъектXDTODTG130_2X268);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X269.Добавить(ОбъектXDTODTG130_2X269);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X270.Добавить(ОбъектXDTODTG130_2X270);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X271.Добавить(ОбъектXDTODTG130_2X271);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X272.Добавить(ОбъектXDTODTG130_2X272);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X273.Добавить(ОбъектXDTODTG130_2X273);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X274.Добавить(ОбъектXDTODTG130_2X274);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X275.Добавить(ОбъектXDTODTG130_2X275);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X276.Добавить(ОбъектXDTODTG130_2X276);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X277.Добавить(ОбъектXDTODTG130_2X277);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X278.Добавить(ОбъектXDTODTG130_2X278);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X279.Добавить(ОбъектXDTODTG130_2X279);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X280.Добавить(ОбъектXDTODTG130_2X280);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X281.Добавить(ОбъектXDTODTG130_2X281);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X282.Добавить(ОбъектXDTODTG130_2X282);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X284.Добавить(ОбъектXDTODTG130_2X284);
	ОбъектXDTODTG130_2_DECLARATIONDETAIL1.DTG130_2X285.Добавить(ОбъектXDTODTG130_2X285);
	
	СтруктураИтогов.ИтогСуммаНСПЗаТретийМесяц = СуммаНСПРазделаА + СуммаНСПРазделаБ + СуммаНСПРазделаВ;
КонецПроцедуры

&НаСервере
Функция СоздатьОбъектXDTO(ТипОбъекта, НомерФормы = "", UBR = Ложь)
	УстановитьПривилегированныйРежим(Истина);
	
	//Если UBR Тогда
	//	Возврат ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.sample-package1.org", ТипОбъекта));
	//Иначе	
		Возврат ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.dostek.kg/FORMDOSTEKSTI" + НомерФормы, ТипОбъекта));
	//КонецЕсли;
	
КонецФункции // СоздатьОбъектXDTO()

#КонецОбласти

#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
     ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
     ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры
 
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
     ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
     ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область РедактированиеМесяцаСтрокой

&НаКлиенте
Процедура ПериодОтчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(ЭтаФорма, ЭтаФорма, "Объект.Дата", "МесяцСтрокой");
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода ПериодОтчета.
//
&НаКлиенте
Процедура ПериодОтчетаПриИзменении(Элемент)
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(ЭтаФорма, "Объект.Дата", "МесяцСтрокой", Модифицированность);
КонецПроцедуры

&НаКлиенте
Процедура ПериодОтчетаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(ЭтаФорма, "Объект.Дата", "МесяцСтрокой", Направление, Модифицированность);
КонецПроцедуры

&НаКлиенте
Процедура ПериодОтчетаАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ПериодОтчетаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти
