
#Область ПрограммныйИнтерфейс

// Получает представление ЭСФ для документа
//
// Параметры:
//  Ссылка	 - ДокументСсылка.РеализацияТоваровУслуг	 - ссылка на документ, для котрого нужно получить представление
// 
// Возвращаемое значение:
//  ПредставлениеЭСФ - Строка
//
Функция ПолучитьПредставлениеЭСФ(Ссылка) Экспорт
	
	ПредставлениеЭСФ = НСтр("ru = 'Создать ЭСФ'");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЭлектронныйСчетФактураТовары.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЭлектронныйСчетФактура.Товары КАК ЭлектронныйСчетФактураТовары
		|ГДЕ
		|	ЭлектронныйСчетФактураТовары.ДокументОснование = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		ПредставлениеЭСФ = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;;
	
	Возврат ПредставлениеЭСФ;	
	
КонецФункции

#КонецОбласти


