#Область ОбработчикиСобытийФормы

// Процедура - обработчик события ПриСозданииНаСервере.
// В процедуре осуществляется
// - инициализация реквизитов формы,
// - установка параметров функциональных опций формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ПоляОбъекта = Новый Структура("Субконто1, Субконто2, Субконто3",
								 "Субконто1", "Субконто2", "Субконто3");
	
	БухгалтерскийУчетКлиентСервер.НастроитьСвязьСчетаИСубконтоВШапке(ЭтаФорма, "", "СчетУчета", Объект, ПоляОбъекта);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Процедура - обработчик события ПриИзменении поля ввода Себестоимость.
//
&НаКлиенте
Процедура СебестоимостьПриИзменении(Элемент)
	Объект.Сумма = Объект.Себестоимость + Объект.СуммаНДС
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода ДатаНачалаСписания.
//
&НаКлиенте
Процедура ДатаНачалаСписанияПриИзменении(Элемент)
	Объект.ДатаНачалаСписания = НачалоМесяца(Объект.ДатаНачалаСписания);
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода ДатаОкончанияСписания.
//
&НаКлиенте
Процедура ДатаОкончанияСписанияПриИзменении(Элемент)
	Объект.ДатаОкончанияСписания = КонецМесяца(Объект.ДатаОкончанияСписания);
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода СуммаНДС.
//
&НаКлиенте
Процедура СуммаНДСПриИзменении(Элемент)
	Объект.Сумма = Объект.Себестоимость + Объект.СуммаНДС
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода СчетУчета.
//
&НаКлиенте
Процедура СчетУчетаПриИзменении(Элемент)	
	ПоляОбъекта = Новый Структура("Субконто1, Субконто2, Субконто3",
								 "Субконто1", "Субконто2", "Субконто3");
	
	БухгалтерскийУчетКлиентСервер.НастроитьСвязьСчетаИСубконтоВШапке(ЭтаФорма, "", "СчетУчета", Объект, ПоляОбъекта);
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода Субконто1.
//
&НаКлиенте
Процедура Субконто1ПриИзменении(Элемент)
	
	БухгалтерскийУчетКлиентСервер.НастроитьСвязьСчетаИСубконтоВШапке(ЭтаФорма, "", "СчетУчета", Объект);
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода Субконто2.
//
&НаКлиенте
Процедура Субконто2ПриИзменении(Элемент)
	
	БухгалтерскийУчетКлиентСервер.НастроитьСвязьСчетаИСубконтоВШапке(ЭтаФорма, "", "СчетУчета", Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура Субконто3ПриИзменении(Элемент)
	
	БухгалтерскийУчетКлиентСервер.НастроитьСвязьСчетаИСубконтоВШапке(ЭтаФорма, "", "СчетУчета", Объект);
	
КонецПроцедуры

#КонецОбласти
