#Область ОбработчикиСобытийФормы

// Процедура - обработчик события ПриСозданииНаСервере.
// В процедуре осуществляется
// - инициализация реквизитов формы,
// - установка параметров функциональных опций формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПоляОбъекта = Новый Структура("Субконто1, Субконто2, Субконто3",
								 "Субконто1", "Субконто2", "Субконто3");
	
	БухгалтерскийУчетКлиентСервер.НастроитьСвязьСчетаИСубконтоВШапке(ЭтаФорма, "", "СчетУчета", Объект, ПоляОбъекта);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СебестоимостьПриИзменении(Элемент)
	Объект.Сумма = Объект.Себестоимость + Объект.СуммаНДС
КонецПроцедуры

&НаКлиенте
Процедура СуммаНДСПриИзменении(Элемент)
	Объект.Сумма = Объект.Себестоимость + Объект.СуммаНДС
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаПриИзменении(Элемент)	
	ПоляОбъекта = Новый Структура("Субконто1, Субконто2, Субконто3",
								 "Субконто1", "Субконто2", "Субконто3");
	
	БухгалтерскийУчетКлиентСервер.НастроитьСвязьСчетаИСубконтоВШапке(ЭтаФорма, "", "СчетУчета", Объект, ПоляОбъекта);
КонецПроцедуры

&НаКлиенте
Процедура Субконто1ПриИзменении(Элемент)
	
	БухгалтерскийУчетКлиентСервер.НастроитьСвязьСчетаИСубконтоВШапке(ЭтаФорма, "", "СчетУчета", Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура Субконто2ПриИзменении(Элемент)
	
	БухгалтерскийУчетКлиентСервер.НастроитьСвязьСчетаИСубконтоВШапке(ЭтаФорма, "", "СчетУчета", Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура Субконто3ПриИзменении(Элемент)
	
	БухгалтерскийУчетКлиентСервер.НастроитьСвязьСчетаИСубконтоВШапке(ЭтаФорма, "", "СчетУчета", Объект);
	
КонецПроцедуры

#КонецОбласти
