#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыПроведенияДокумента

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаБланкиСчетовФактур(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаШапка.СерияБланкаСФ,
		|	ВременнаяТаблицаШапка.НомерБланкаСФ,
		|	1 КАК Количество,		
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|ГДЕ
		|	НЕ ВременнаяТаблицаШапка.СерияБланкаСФ = """"
		|			И НЕ ВременнаяТаблицаШапка.НомерБланкаСФ = """"";		
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаБланкиСчетовФактур", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры 

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаСчетаФактурыВыписанные(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаТовары.ДокументРеализации КАК ДокументРеализации,
		|	ВременнаяТаблицаТовары.ДокументРеализации.Контрагент КАК Контрагент,
		|	ВременнаяТаблицаТовары.ДокументРеализации.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ВЫРАЗИТЬ(ВременнаяТаблицаТовары.ДокументРеализации.Контрагент КАК Справочник.Контрагенты).СтранаРезидентства КАК СтранаРезидентства,
		|	ВЫБОР
		|   	КОГДА ВЫРАЗИТЬ(ВременнаяТаблицаТовары.ДокументРеализации.Контрагент КАК Справочник.Контрагенты).ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|       	ТОГДА ИСТИНА
		|       ИНАЧЕ
		|			ЛОЖЬ
		|   КОНЕЦ КАК ЕАЭС,
		|	ВременнаяТаблицаТовары.Сумма КАК Сумма,
		|	ВременнаяТаблицаТовары.СуммаНДС КАК СуммаНДС,
		|	ВременнаяТаблицаТовары.СуммаНСП КАК СуммаНСП
		|ПОМЕСТИТЬ ВременнаяТаблицаТоварыКонтрагенты
		|ИЗ
		|	ВременнаяТаблицаТовары КАК ВременнаяТаблицаТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	ВременнаяТаблицаТоварыКонтрагенты.ДокументРеализации КАК Документ,
		|	ВременнаяТаблицаШапка.СерияБланкаСФ КАК СерияБланкаСФ,
		|	ВременнаяТаблицаШапка.НомерБланкаСФ КАК НомерБланкаСФ,
		|	ВременнаяТаблицаШапка.ВозвратТоваров,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаТоварыКонтрагенты.СтранаРезидентства = ЗНАЧЕНИЕ(Справочник.СтраныМира.Киргизия)
		|				ИЛИ ВременнаяТаблицаТоварыКонтрагенты.СтранаРезидентства = ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|		КОГДА ВременнаяТаблицаТоварыКонтрагенты.ЕАЭС
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|		КОГДА ВременнаяТаблицаШапка.ЭкспортнаяПоставка
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ИмпортЭкспорт)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ПустаяСсылка)
		|	КОНЕЦ КАК ПризнакСтраны,
		|	ВременнаяТаблицаТоварыКонтрагенты.Контрагент КАК Контрагент,
		|	ВременнаяТаблицаТоварыКонтрагенты.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ВременнаяТаблицаШапка.СтавкаНДС КАК СтавкаНДС,
		|	ВременнаяТаблицаШапка.ДатаСФ КАК ДатаСФ,
		|	ВременнаяТаблицаШапка.ДатаСФ КАК ДатаПоставки,
		|	ВременнаяТаблицаШапка.ВидПоставкиНДС КАК ВидПоставкиНДС,
		|	ВременнаяТаблицаТоварыКонтрагенты.Сумма КАК СуммаБезНДС,
		|	ВременнаяТаблицаТоварыКонтрагенты.СуммаНДС КАК СуммаНДС,
		|	ВременнаяТаблицаТоварыКонтрагенты.СуммаНСП КАК СуммаНеоблагаемая
		|ПОМЕСТИТЬ ВременнаяТаблицаОбщая
		|ИЗ
		|	ВременнаяТаблицаТоварыКонтрагенты КАК ВременнаяТаблицаТоварыКонтрагенты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаОбщая.Организация,
		|	ВременнаяТаблицаОбщая.Период,
		|	ВременнаяТаблицаОбщая.Документ,
		|	ВременнаяТаблицаОбщая.СерияБланкаСФ,
		|	ВременнаяТаблицаОбщая.НомерБланкаСФ,
		|	ВременнаяТаблицаОбщая.ВозвратТоваров,
		|	ВременнаяТаблицаОбщая.ПризнакСтраны,
		|	ВременнаяТаблицаОбщая.Контрагент,
		|	ВременнаяТаблицаОбщая.ДоговорКонтрагента,
		|	ВременнаяТаблицаОбщая.СтавкаНДС,
		|	ВременнаяТаблицаОбщая.ДатаСФ,
		|	ВременнаяТаблицаОбщая.ДатаПоставки,
		|	СУММА(ВременнаяТаблицаОбщая.СуммаБезНДС) КАК СуммаБезНДС,
		|	СУММА(ВременнаяТаблицаОбщая.СуммаНДС) КАК СуммаНДС,
		|	СУММА(ВременнаяТаблицаОбщая.СуммаНеоблагаемая) КАК СуммаНеоблагаемая,
		|	ВременнаяТаблицаОбщая.ВидПоставкиНДС
		|ИЗ
		|	ВременнаяТаблицаОбщая КАК ВременнаяТаблицаОбщая
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаОбщая.СтавкаНДС,
		|	ВременнаяТаблицаОбщая.ДоговорКонтрагента,
		|	ВременнаяТаблицаОбщая.Контрагент,
		|	ВременнаяТаблицаОбщая.ДатаСФ,
		|	ВременнаяТаблицаОбщая.ДатаПоставки,
		|	ВременнаяТаблицаОбщая.ВозвратТоваров,
		|	ВременнаяТаблицаОбщая.НомерБланкаСФ,
		|	ВременнаяТаблицаОбщая.Документ,
		|	ВременнаяТаблицаОбщая.СерияБланкаСФ,
		|	ВременнаяТаблицаОбщая.ПризнакСтраны,
		|	ВременнаяТаблицаОбщая.Организация,
		|	ВременнаяТаблицаОбщая.Период,
		|	ВременнаяТаблицаОбщая.ВидПоставкиНДС";
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСчетаФактурыВыписанные", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаДокумента.Ссылка,
		|	ТаблицаДокумента.Дата,
		|	ТаблицаДокумента.Организация,
		|	ТаблицаДокумента.СерияБланкаСФ,
		|	ТаблицаДокумента.НомерБланкаСФ,
		|	ТаблицаДокумента.ДатаСФ,
		|	ТаблицаДокумента.Контрагент,
		|	ТаблицаДокумента.СтавкаНДС,
		|	ТаблицаДокумента.СтавкаНСП,
		|	ТаблицаДокумента.ДоговорКонтрагента,
		|	ТаблицаДокумента.ВидПоставкиНДС КАК ВидПоставкиНДС,
		|	ТаблицаДокумента.ЭкспортнаяПоставка,
		|	ТаблицаДокумента.ВозвратТоваров
		|ПОМЕСТИТЬ ВременнаяТаблицаШапка
		|ИЗ
		|	Документ.СчетФактураВыписанный КАК ТаблицаДокумента
		|ГДЕ
		|	ТаблицаДокумента.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДокумента.ДокументОснование КАК ДокументОснование
		|ПОМЕСТИТЬ ВременнаяТаблицаДокументыОснования
		|ИЗ
		|	Документ.СчетФактураВыписанный.ДокументыОснования КАК ТаблицаДокумента
		|ГДЕ
		|	ТаблицаДокумента.Ссылка = &Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДокументОснование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровУслугТовары.Ссылка КАК ДокументРеализации,
		|	РеализацияТоваровУслугТовары.Сумма,
		|	РеализацияТоваровУслугТовары.СуммаНДС,
		|	РеализацияТоваровУслугТовары.СуммаНСП,
		|	РеализацияТоваровУслугТовары.Всего
		|ПОМЕСТИТЬ ВременнаяТаблицаТовары
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаДокументыОснования КАК ВременнаяТаблицаДокументыОснования
		|		ПО РеализацияТоваровУслугТовары.Ссылка = ВременнаяТаблицаДокументыОснования.ДокументОснование
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВозвратТоваровОтПокупателяТовары.Ссылка,
		|	ВозвратТоваровОтПокупателяТовары.Сумма,
		|	ВозвратТоваровОтПокупателяТовары.СуммаНДС,
		|	ВозвратТоваровОтПокупателяТовары.СуммаНСП,
		|	ВозвратТоваровОтПокупателяТовары.Всего
		|ИЗ
		|	Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаДокументыОснования КАК ВременнаяТаблицаДокументыОснования
		|		ПО ВозвратТоваровОтПокупателяТовары.Ссылка = ВременнаяТаблицаДокументыОснования.ДокументОснование
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СчетНаОплатуПокупателюТовары.Ссылка,
		|	СчетНаОплатуПокупателюТовары.Сумма,
		|	СчетНаОплатуПокупателюТовары.СуммаНДС,
		|	СчетНаОплатуПокупателюТовары.СуммаНСП,
		|	СчетНаОплатуПокупателюТовары.Всего
		|ИЗ
		|	Документ.СчетНаОплатуПокупателю.Товары КАК СчетНаОплатуПокупателюТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаДокументыОснования КАК ВременнаяТаблицаДокументыОснования
		|		ПО СчетНаОплатуПокупателюТовары.Ссылка = ВременнаяТаблицаДокументыОснования.ДокументОснование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровУслугУслуги.Ссылка КАК ДокументРеализации,
		|	РеализацияТоваровУслугУслуги.Сумма,
		|	РеализацияТоваровУслугУслуги.СуммаНДС,
		|	РеализацияТоваровУслугУслуги.СуммаНСП,
		|	РеализацияТоваровУслугУслуги.Всего
		|ПОМЕСТИТЬ ВременнаяТаблицаУслуги
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаДокументыОснования КАК ВременнаяТаблицаДокументыОснования
		|		ПО РеализацияТоваровУслугУслуги.Ссылка = ВременнаяТаблицаДокументыОснования.ДокументОснование
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СчетНаОплатуПокупателюУслуги.Ссылка,
		|	СчетНаОплатуПокупателюУслуги.Сумма,
		|	СчетНаОплатуПокупателюУслуги.СуммаНДС,
		|	СчетНаОплатуПокупателюУслуги.СуммаНСП,
		|	СчетНаОплатуПокупателюУслуги.Всего
		|ИЗ
		|	Документ.СчетНаОплатуПокупателю.Услуги КАК СчетНаОплатуПокупателюУслуги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаДокументыОснования КАК ВременнаяТаблицаДокументыОснования
		|		ПО СчетНаОплатуПокупателюУслуги.Ссылка = ВременнаяТаблицаДокументыОснования.ДокументОснование";
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Выполнить();
	
	СформироватьТаблицаБланкиСчетовФактур(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицаСчетаФактурыВыписанные(ДокументСсылка, СтруктураДополнительныеСвойства);
		
КонецПроцедуры // ИнициализироватьДанныеДокумента()

#КонецОбласти

#Область ВерсионированиеОбъектов

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область ИнтерфейсПечати

// Функция формирует табличный документ с печатной формой Счет-фактура
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьСчетФактура(МассивОбъектов, ОбъектыПечати, КоличествоСтрокСчетаФактуры)
	Перем Ошибки, ПервыйДокумент, НомерСтрокиНачало;

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "СчетФактураВыписанный_СчетФактура";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщиеМакеты.СчетФактура");

	ТекстЗапроса = ПолучитьТекстЗапросаДокументовОснования();
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СписокДокументов", МассивОбъектов);
	МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
	
	// Таблицы
	ТаблицаИсходныхСумм = МассивРезультатовЗапроса[8].Выгрузить();                                      
	ТаблицаПересчитанныхСумм = МассивРезультатовЗапроса[9].Выгрузить();   
	ТаблицаИсходныхСумм.Индексы.Добавить("ДокументСФ");
	ТаблицаПересчитанныхСумм.Индексы.Добавить("ДокументСФ");
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	ТаблицаДокумента.Ссылка,
		|	ТаблицаДокумента.Номер,
		|	ТаблицаДокумента.Дата,
		|	ТаблицаДокумента.Организация,
		|	ТаблицаДокумента.ВалютаДокумента,
		// Сведения об организации
		|	ТаблицаДокумента.Организация.НаименованиеПолное КАК ОрганизацияПредставление,
		|	ТаблицаДокумента.Организация.ИНН КАК ИННОрганизации,
		|	ТаблицаДокумента.Организация.ГНС КАК ГНСОрганизации,
		|	ТаблицаДокумента.Организация.ГНС.Код КАК КодГНСОрганизации,
		|	ТаблицаДокумента.Организация.ФайлЛоготип КАК ФайлЛоготип,
		|	ТаблицаДокумента.Организация.ФайлФаксимильнаяПечать КАК ФайлФаксимильнаяПечать,
		// Сведения о банковском счете организации
		|	ТаблицаДокумента.ЭкспортнаяПоставка КАК ЭкспортнаяПоставка,
		|	ТаблицаДокумента.БанковскийСчет.НомерСчета КАК НомерБанковскогоСчетаОрганизации,
		|	ТаблицаДокумента.БанковскийСчет.Банк.Код КАК БикБанкаОрганизации,
		|	ТаблицаДокумента.БанковскийСчет.Банк.Наименование КАК НаименованиеБанкаОрганизации,
		// Сведения о контрегенте
		|	ВЫБОР
		|		КОГДА &ПечататьСчетаФактурыСГоловнымКонтрагентом
		|				И НЕ ТаблицаДокумента.Контрагент.ГоловнойКонтрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|			ТОГДА ТаблицаДокумента.Контрагент.ГоловнойКонтрагент
		|		ИНАЧЕ ТаблицаДокумента.Контрагент
		|	КОНЕЦ КАК Контрагент,
		// Сведения о счете-фактуре
		|	ТаблицаДокумента.ВидПлатежа,
		|	ТаблицаДокумента.НомерБланкаСФ,
		|	ТаблицаДокумента.СерияБланкаСФ,
		|	ТаблицаДокумента.ДатаСФ,
		// Ставки
		|	ТаблицаДокумента.БезналичныйРасчет,
		|	ТаблицаДокумента.СтавкаНДС,
		|	ТаблицаДокумента.СтавкаНСП,
		// Настройки печати
		|	ТаблицаДокумента.ПечатьВРегламентированнойВалюте,
		|	ТаблицаДокумента.ПечататьКурсИСуммуВРегламентированнойВалюте,
		|	ТаблицаДокумента.НеГруппироватьПоНоменклатуре
		|ИЗ
		|	Документ.СчетФактураВыписанный КАК ТаблицаДокумента
		|ГДЕ
		|	ТаблицаДокумента.Ссылка В(&СписокДокументов)";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ПечататьСчетаФактурыСГоловнымКонтрагентом", ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("ПечататьСчетаФактурыСГоловнымКонтрагентом"));
	Запрос.УстановитьПараметр("СписокДокументов", МассивОбъектов);
	
	Шапка = Запрос.Выполнить().Выбрать();
	Пока Шапка.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Подготовка данных
		ДанныеПечати = Новый Структура;
		ДанныеПечати.Вставить("НомерОтчета", ?(КоличествоСтрокСчетаФактуры = 20,"001","002"));
		ДанныеПечати.Вставить("НомерПриложения", ?(КоличествоСтрокСчетаФактуры = 20,"2","3"));
		ДанныеПечати.Вставить("НомерБланкаСФ", Шапка.НомерБланкаСФ);
		ДанныеПечати.Вставить("СерияБланкаСФ", Шапка.СерияБланкаСФ);
		ДанныеПечати.Вставить("ТипПоставки", ?(Шапка.ЭкспортнаяПоставка, "Экспорт", "Внутренняя"));
		ДанныеПечати.Вставить("ВидПлатежа", ?(Шапка.БезналичныйРасчет, "Безналичный", "Наличный"));
		
		ДанныеПечати.Вставить("ТекстЗаголовка", НСтр("ru = 'СЧЕТ-ФАКТУРА НДС'"));

		ДанныеПечати.Вставить("ДатаПоставки", Формат(Шапка.Дата,"ДЛФ=DD"));
		ДанныеПечати.Вставить("БанкПоставщика", Шапка.НаименованиеБанкаОрганизации);		
		
		ДанныеПечати.Вставить("ФайлЛоготип", Шапка.ФайлЛоготип);
		ДанныеПечати.Вставить("ФайлФаксимильнаяПечать", Шапка.ФайлФаксимильнаяПечать);
	
		ПредставлениеПоставщика = "";
		Организация = Шапка.Организация;
		ИНН = Шапка.ИННОрганизации;
	    ГНС = Шапка.ГНСОрганизации;
	    КодГНС = Шапка.КодГНСОрганизации;
		
		ПредставлениеПоставщика = Шапка.ОрганизацияПредставление;
		
		ДатаСФ = Формат(Шапка.ДатаСФ, "ДЛФ=D");
		ДанныеПечати.Вставить("Дата1", Сред(ДатаСФ,1,1));
		ДанныеПечати.Вставить("Дата2", Сред(ДатаСФ,2,1));
		ДанныеПечати.Вставить("Дата3", Сред(ДатаСФ,4,1));
		ДанныеПечати.Вставить("Дата4", Сред(ДатаСФ,5,1));
		ДанныеПечати.Вставить("Дата5", Сред(ДатаСФ,7,1));
		ДанныеПечати.Вставить("Дата6", Сред(ДатаСФ,8,1));
		ДанныеПечати.Вставить("Дата7", Сред(ДатаСФ,9,1));
		ДанныеПечати.Вставить("Дата8", Сред(ДатаСФ,10,1));
		
		ДанныеПечати.Вставить("ИННПост1", Сред(ИНН,1,1));
		ДанныеПечати.Вставить("ИННПост2", Сред(ИНН,2,1));
		ДанныеПечати.Вставить("ИННПост3", Сред(ИНН,3,1));
		ДанныеПечати.Вставить("ИННПост4", Сред(ИНН,4,1));
		ДанныеПечати.Вставить("ИННПост5", Сред(ИНН,5,1));
		ДанныеПечати.Вставить("ИННПост6", Сред(ИНН,6,1));
		ДанныеПечати.Вставить("ИННПост7", Сред(ИНН,7,1));
		ДанныеПечати.Вставить("ИННПост8", Сред(ИНН,8,1));
		ДанныеПечати.Вставить("ИННПост9", Сред(ИНН,9,1));
		ДанныеПечати.Вставить("ИННПост10", Сред(ИНН,10,1));
		ДанныеПечати.Вставить("ИННПост11", Сред(ИНН,11,1));
		ДанныеПечати.Вставить("ИННПост12", Сред(ИНН,12,1));
		ДанныеПечати.Вставить("ИННПост13", Сред(ИНН,13,1));
		ДанныеПечати.Вставить("ИННПост14", Сред(ИНН,14,1));

        БИК = Шапка.БикБанкаОрганизации;
		ДанныеПечати.Вставить("КодБанкаПоставщика1", Сред(БИК,1,1));
		ДанныеПечати.Вставить("КодБанкаПоставщика2", Сред(БИК,2,1));
		ДанныеПечати.Вставить("КодБанкаПоставщика3", Сред(БИК,3,1));
		ДанныеПечати.Вставить("КодБанкаПоставщика4", Сред(БИК,4,1));
		ДанныеПечати.Вставить("КодБанкаПоставщика5", Сред(БИК,5,1));
		ДанныеПечати.Вставить("КодБанкаПоставщика6", Сред(БИК,6,1));
		ДанныеПечати.Вставить("КодБанкаПоставщика7", Сред(БИК,7,1));
		ДанныеПечати.Вставить("КодБанкаПоставщика8", Сред(БИК,8,1));
		ДанныеПечати.Вставить("КодБанкаПоставщика9", Сред(БИК,9,1));		
		
		НомерСчета = Шапка.НомерБанковскогоСчетаОрганизации;
		ДанныеПечати.Вставить("СчетПоставщика1", Сред(НомерСчета,1,1));		
		ДанныеПечати.Вставить("СчетПоставщика2", Сред(НомерСчета,2,1));		
		ДанныеПечати.Вставить("СчетПоставщика3", Сред(НомерСчета,3,1));		
		ДанныеПечати.Вставить("СчетПоставщика4", Сред(НомерСчета,4,1));		
		ДанныеПечати.Вставить("СчетПоставщика5", Сред(НомерСчета,5,1));		
		ДанныеПечати.Вставить("СчетПоставщика6", Сред(НомерСчета,6,1));		
		ДанныеПечати.Вставить("СчетПоставщика7", Сред(НомерСчета,7,1));		
		ДанныеПечати.Вставить("СчетПоставщика8", Сред(НомерСчета,8,1));		
		ДанныеПечати.Вставить("СчетПоставщика9", Сред(НомерСчета,9,1));		
		ДанныеПечати.Вставить("СчетПоставщика10", Сред(НомерСчета,10,1));		
		ДанныеПечати.Вставить("СчетПоставщика11", Сред(НомерСчета,11,1));		
		ДанныеПечати.Вставить("СчетПоставщика12", Сред(НомерСчета,12,1));		
		ДанныеПечати.Вставить("СчетПоставщика13", Сред(НомерСчета,13,1));		
		ДанныеПечати.Вставить("СчетПоставщика14", Сред(НомерСчета,14,1));		
		ДанныеПечати.Вставить("СчетПоставщика15", Сред(НомерСчета,15,1));		
		ДанныеПечати.Вставить("СчетПоставщика16", Сред(НомерСчета,16,1));		
		
		ДанныеПечати.Вставить("ГНСПоставщика1", Сред(КодГНС,1,1));		
		ДанныеПечати.Вставить("ГНСПоставщика2", Сред(КодГНС,2,1));		
		ДанныеПечати.Вставить("ГНСПоставщика3", Сред(КодГНС,3,1));		

		ДанныеПечати.Вставить("НаименованиеГНСПоставщика", ГНС);		
		ДанныеПечати.Вставить("ПредставлениеПоставщика", ПредставлениеПоставщика);		
		 
		КонтактныеДанные = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСведенияОбОрганизации(Организация, Шапка.Дата);
		ДанныеПечати.Вставить("АдресПоставщика", КонтактныеДанные.АдрЮР);

		// Данные по контрагенту
		СведенияОКонтрагенте = БухгалтерскийУчетСервер.ПолучитьСведенияОКонтрагенте(Шапка.Контрагент);
		
		ДанныеПечати.Вставить("НаименованиеГНСПокупателя", СведенияОКонтрагенте.ГНСНаименование);		
		ДанныеПечати.Вставить("ПредставлениеПокупателя", СведенияОКонтрагенте.НаименованиеПолное);
		ДанныеПечати.Вставить("АдресПокупателя", СведенияОКонтрагенте.АдрЮР);		
		
		ИННКонтрагента = СведенияОКонтрагенте.ИНН;
		ДанныеПечати.Вставить("ИННПок1", Сред(ИННКонтрагента,1,1));		
		ДанныеПечати.Вставить("ИННПок2", Сред(ИННКонтрагента,2,1));		
		ДанныеПечати.Вставить("ИННПок3", Сред(ИННКонтрагента,3,1));		
		ДанныеПечати.Вставить("ИННПок4", Сред(ИННКонтрагента,4,1));		
		ДанныеПечати.Вставить("ИННПок5", Сред(ИННКонтрагента,5,1));		
		ДанныеПечати.Вставить("ИННПок6", Сред(ИННКонтрагента,6,1));		
		ДанныеПечати.Вставить("ИННПок7", Сред(ИННКонтрагента,7,1));		
		ДанныеПечати.Вставить("ИННПок8", Сред(ИННКонтрагента,8,1));		
		ДанныеПечати.Вставить("ИННПок9", Сред(ИННКонтрагента,9,1));		
		ДанныеПечати.Вставить("ИННПок10", Сред(ИННКонтрагента,10,1));		
		ДанныеПечати.Вставить("ИННПок11", Сред(ИННКонтрагента,11,1));		
		ДанныеПечати.Вставить("ИННПок12", Сред(ИННКонтрагента,12,1));		
		ДанныеПечати.Вставить("ИННПок13", Сред(ИННКонтрагента,13,1));		
		ДанныеПечати.Вставить("ИННПок14", Сред(ИННКонтрагента,14,1));		
		
		КодГНСКонтрагента = СведенияОКонтрагенте.ГНСКод;
		ДанныеПечати.Вставить("ГНСПокупателя1", Сред(КодГНСКонтрагента,1,1));		
		ДанныеПечати.Вставить("ГНСПокупателя2", Сред(КодГНСКонтрагента,2,1));		
		ДанныеПечати.Вставить("ГНСПокупателя3", Сред(КодГНСКонтрагента,3,1));		
		
		Если ЗначениеЗаполнено(СведенияОКонтрагенте.НомерСчета) Тогда 
			НомерСчетаКонтрагента = СведенияОКонтрагенте.НомерСчета;
			ДанныеПечати.Вставить("СчетПокупателя1", Сред(НомерСчетаКонтрагента,1,1));		
			ДанныеПечати.Вставить("СчетПокупателя2", Сред(НомерСчетаКонтрагента,2,1));		
			ДанныеПечати.Вставить("СчетПокупателя3", Сред(НомерСчетаКонтрагента,3,1));		
			ДанныеПечати.Вставить("СчетПокупателя4", Сред(НомерСчетаКонтрагента,4,1));		
			ДанныеПечати.Вставить("СчетПокупателя5", Сред(НомерСчетаКонтрагента,5,1));		
			ДанныеПечати.Вставить("СчетПокупателя6", Сред(НомерСчетаКонтрагента,6,1));		
			ДанныеПечати.Вставить("СчетПокупателя7", Сред(НомерСчетаКонтрагента,7,1));		
			ДанныеПечати.Вставить("СчетПокупателя8", Сред(НомерСчетаКонтрагента,8,1));		
			ДанныеПечати.Вставить("СчетПокупателя9", Сред(НомерСчетаКонтрагента,9,1));		
			ДанныеПечати.Вставить("СчетПокупателя10", Сред(НомерСчетаКонтрагента,10,1));		
			ДанныеПечати.Вставить("СчетПокупателя11", Сред(НомерСчетаКонтрагента,11,1));		
			ДанныеПечати.Вставить("СчетПокупателя12", Сред(НомерСчетаКонтрагента,12,1));		
			ДанныеПечати.Вставить("СчетПокупателя13", Сред(НомерСчетаКонтрагента,13,1));		
			ДанныеПечати.Вставить("СчетПокупателя14", Сред(НомерСчетаКонтрагента,14,1));
			ДанныеПечати.Вставить("СчетПокупателя15", Сред(НомерСчетаКонтрагента,15,1));		
			ДанныеПечати.Вставить("СчетПокупателя16", Сред(НомерСчетаКонтрагента,16,1));
			
			БикБанкаКонтрагента = СведенияОКонтрагенте.БИКБанка;
			ДанныеПечати.Вставить("КодБанкаПокупателя1", Сред(БикБанкаКонтрагента,1,1));		
			ДанныеПечати.Вставить("КодБанкаПокупателя2", Сред(БикБанкаКонтрагента,2,1));		
			ДанныеПечати.Вставить("КодБанкаПокупателя3", Сред(БикБанкаКонтрагента,3,1));		
			ДанныеПечати.Вставить("КодБанкаПокупателя4", Сред(БикБанкаКонтрагента,4,1));		
			ДанныеПечати.Вставить("КодБанкаПокупателя5", Сред(БикБанкаКонтрагента,5,1));		
			ДанныеПечати.Вставить("КодБанкаПокупателя6", Сред(БикБанкаКонтрагента,6,1));		
			ДанныеПечати.Вставить("КодБанкаПокупателя7", Сред(БикБанкаКонтрагента,7,1));		
			ДанныеПечати.Вставить("КодБанкаПокупателя8", Сред(БикБанкаКонтрагента,8,1));		
			ДанныеПечати.Вставить("КодБанкаПокупателя9", Сред(БикБанкаКонтрагента,9,1));		
			
			ДанныеПечати.Вставить("БанкПокупателя", СведенияОКонтрагенте.Банк);
		Иначе 	
			// Отсутствует
			ДанныеПечати.Вставить("СчетПокупателя1","о");
			ДанныеПечати.Вставить("СчетПокупателя2","т");
			ДанныеПечати.Вставить("СчетПокупателя3","с");
			ДанныеПечати.Вставить("СчетПокупателя4","у");
			ДанныеПечати.Вставить("СчетПокупателя5","т");
			ДанныеПечати.Вставить("СчетПокупателя6","с");
			ДанныеПечати.Вставить("СчетПокупателя7","т");
			ДанныеПечати.Вставить("СчетПокупателя8","в");
			ДанныеПечати.Вставить("СчетПокупателя9","у");
			ДанныеПечати.Вставить("СчетПокупателя10","е");
			ДанныеПечати.Вставить("СчетПокупателя11","т");	

			ДанныеПечати.Вставить("БанкПокупателя", "отсутствует");
		КонецЕсли;	
		
		// Таблицы
		ПараметрыОтбора = Новый Структура("ДокументСФ", Шапка.Ссылка);
		
		ПересчитаннаяТаблица = Неопределено;
		ИсходнаяТаблица = Неопределено;
		
		Если Шапка.ПечатьВРегламентированнойВалюте ИЛИ Шапка.ПечататьКурсИСуммуВРегламентированнойВалюте Тогда
			ПересчитаннаяТаблица = ТаблицаПересчитанныхСумм.Скопировать(ПараметрыОтбора);
			ВалютаРегламентированногоУчета = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
		КонецЕсли;	
		
		Если НЕ Шапка.ПечатьВРегламентированнойВалюте Тогда
			ИсходнаяТаблица = ТаблицаИсходныхСумм.Скопировать(ПараметрыОтбора);	
		КонецЕсли;	   
		
		// Ставки
		Если Шапка.БезналичныйРасчет Тогда 
			ЗначениеСтавкиНСП = "0";
		Иначе 
			ЗначениеСтавкиНСП = УчетНДСВызовСервера.ПолучитьСтавкуНСП(Шапка.Дата, Шапка.Организация, Шапка.СтавкаНСП);
		КонецЕсли;
		
		ЗначениеСтавкиНДС = УчетНДСВызовСервера.ПолучитьСтавкуНДС(Шапка.Дата, Шапка.СтавкаНДС);
		ДанныеПечати.Вставить("СтавкаНДС", ?(ЗначениеЗаполнено(ЗначениеСтавкиНДС), Строка(ЗначениеСтавкиНДС) + "%",""));
		ДанныеПечати.Вставить("СтавкаНСП", ?(ЗначениеЗаполнено(ЗначениеСтавкиНСП), Строка(ЗначениеСтавкиНСП) + "%",""));
		
		КоличествоСтрок = 0;
		
		ВсегоСуммаСкидкиИсходная = 0;
		ВсегоСуммаСкидкиПересчитанная = 0;
		
		// Итоги по исходным суммам
		Если ИсходнаяТаблица <> Неопределено Тогда
			ВсегоСтоимостьИсходная = ИсходнаяТаблица.Итог("Стоимость");
			ВсегоИсходная = ИсходнаяТаблица.Итог("Всего");
			ВсегоНДСИсходная = ИсходнаяТаблица.Итог("СуммаНДС");
			ВсегоНСПИсходная = ИсходнаяТаблица.Итог("СуммаНСП");
			ВсегоСуммаСкидкиИсходная = ИсходнаяТаблица.Итог("СуммаСкидки");
			КоличествоСтрок = КоличествоСтрок + ИсходнаяТаблица.Количество();
			
			// Если пересчитанных сумм нет, то итоговая строка будет одна,
			// поэтому используется строка итогов, которая находится в области "Подвал" и 
			// названия параметров задаются соответственно этой области. 
			// Если пересчитанные суммы есть, то итоговых строки будет две 
			// (с исходными суммами и с пересчитанными), поэтому будет задействована область
			// "ИсходныйИтог" и параметры соответственно именуем как они указаны в данной области.
			Если ПересчитаннаяТаблица = Неопределено Тогда
				ДанныеПечати.Вставить("ВсегоСтоимость", ВсегоСтоимостьИсходная);
				ДанныеПечати.Вставить("Всего", ВсегоИсходная);
				ДанныеПечати.Вставить("ВсегоНДС", ВсегоНДСИсходная);
				ДанныеПечати.Вставить("ВсегоНСП", ВсегоНСПИсходная);
				
				Если Шапка.ПечатьВРегламентированнойВалюте Тогда 
					ДанныеПечати.Вставить("Валюта", " (" + ВалютаРегламентированногоУчета + ")");
				Иначе
					ДанныеПечати.Вставить("Валюта", " (" + Шапка.ВалютаДокумента + ")");
				КонецЕсли;
			Иначе
				ДанныеПечати.Вставить("ВсегоСтоимостьИсходная", ВсегоСтоимостьИсходная);
				ДанныеПечати.Вставить("ВсегоИсходная", ВсегоИсходная);
				ДанныеПечати.Вставить("ВсегоНДСИсходная", ВсегоНДСИсходная);
				ДанныеПечати.Вставить("ВсегоНСПИсходная", ВсегоНСПИсходная);
				
				ДанныеПечати.Вставить("ВалютаИсходная", " (" + Шапка.ВалютаДокумента + ")");
			КонецЕсли;
		КонецЕсли;
		
		// Итоги по пересчитанным суммам
		Если ПересчитаннаяТаблица <> Неопределено Тогда
			ВсегоСтоимостьПересчитанная = ПересчитаннаяТаблица.Итог("Стоимость");
			ВсегоПересчитанная = ПересчитаннаяТаблица.Итог("Всего");
			ВсегоНДСПересчитанная = ПересчитаннаяТаблица.Итог("СуммаНДС");
			ВсегоНСППересчитанная = ПересчитаннаяТаблица.Итог("СуммаНСП");
			ВсегоСуммаСкидкиПересчитанная = ПересчитаннаяТаблица.Итог("СуммаСкидки");
			КоличествоСтрок = КоличествоСтрок + ПересчитаннаяТаблица.Количество();
			
			ДанныеПечати.Вставить("ВсегоСтоимость", ВсегоСтоимостьПересчитанная);
			ДанныеПечати.Вставить("Всего", ВсегоПересчитанная);
			ДанныеПечати.Вставить("ВсегоНДС", ВсегоНДСПересчитанная);
			ДанныеПечати.Вставить("ВсегоНСП", ВсегоНСППересчитанная);
			
			ДанныеПечати.Вставить("Валюта", " (" + ВалютаРегламентированногоУчета + ")");
		КонецЕсли;
		
		// Скидка
		ЕстьСкидка = Ложь;
		Если ВсегоСуммаСкидкиИсходная > 0 Тогда								
			ЕстьСкидка = Истина;
			ВсегоИсходная = ВсегоИсходная - ВсегоСуммаСкидкиИсходная;
			ДанныеПечати.Вставить("СтоимостьСкидка", -ВсегоИсходная);
			ДанныеПечати.Вставить("СуммаНДССкидка", -ВсегоНДСИсходная);
			ДанныеПечати.Вставить("ВсегоСкидка", -ВсегоИсходная -ВсегоНДСИсходная);
		КонецЕсли;
		
		// Скидка
		ЕстьПересчитаннаяСкидка = Ложь;
		Если ВсегоСуммаСкидкиПересчитанная > 0 Тогда								
			ЕстьПересчитаннаяСкидка = Истина;
			ВсегоПересчитанная = ВсегоПересчитанная - ВсегоСуммаСкидкиПересчитанная;
			ДанныеПечати.Вставить("СтоимостьСкидкаПересчитанная", -ВсегоПересчитанная);
			ДанныеПечати.Вставить("СуммаНДССкидкаПересчитанная", -ВсегоНДСПересчитанная);
			ДанныеПечати.Вставить("ВсегоСкидкаПересчитанная", -ВсегоПересчитанная -ВсегоНДСПересчитанная);
		КонецЕсли;
		
		// Информация подвала
		ТекстОКоличестве = СтрШаблон("%1 (%2)", КоличествоСтрокСчетаФактуры, ?(КоличествоСтрокСчетаФактуры = 20,"(двадцати)","(семи)"));
		ДанныеПечати.Вставить("КоличествоСтрокСчетаФактуры", ТекстОКоличестве);
		ДанныеПечати.Вставить("НомерОтчета", ?(КоличествоСтрокСчетаФактуры = 20,"001","002"));
		
		ОтветственныеЛица = БухгалтерскийУчетСервер.ОтветственныеЛицаОрганизаций(Шапка.Организация, Шапка.Дата);
		ДанныеПечати.Вставить("ФаксимилеРуководителя", ОтветственныеЛица.ФаксимилеРуководителя);
		ДанныеПечати.Вставить("ФаксимилеГлавногоБухгалтера", ОтветственныеЛица.ФаксимилеГлавногоБухгалтера);

		// Области
		МассивОбластейМакета = Новый Массив;
		МассивОбластейМакета.Добавить("Шапка");
		МассивОбластейМакета.Добавить("Строка");	
		
		Если ЕстьСкидка Тогда 
			МассивОбластейМакета.Добавить("СтрокаСоСкидкой");
		КонецЕсли;
		
		Если ЕстьПересчитаннаяСкидка Тогда 
			МассивОбластейМакета.Добавить("ВалютнаяСтрокаСоСкидкой");
		КонецЕсли;
		
		Если ДанныеПечати.Свойство("ВалютаИсходная") Тогда
			МассивОбластейМакета.Добавить("ИсходныйИтог");
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(Шапка.ФайлФаксимильнаяПечать) Тогда 
			МассивОбластейМакета.Добавить("ПодвалСФаксимиле");
		Иначе 
			МассивОбластейМакета.Добавить("Подвал");
		КонецЕсли;	
	
		ДанныеПечатиСтроки = Новый Структура("КодТовара1, КодТовара2, КодТовара3, КодТовара4","0","0","0","0");
		
		ДанныеПечатиПустаяСтрока = Новый Структура();
		ДанныеПечатиПустаяСтрока.Вставить("КодТовара1", 		"");
		ДанныеПечатиПустаяСтрока.Вставить("КодТовара2", 		"");
		ДанныеПечатиПустаяСтрока.Вставить("КодТовара3", 		"");
		ДанныеПечатиПустаяСтрока.Вставить("КодТовара4", 		"");
		ДанныеПечатиПустаяСтрока.Вставить("Количество", 		"Х");
		ДанныеПечатиПустаяСтрока.Вставить("СтавкаНДС", 			"Х");
		ДанныеПечатиПустаяСтрока.Вставить("СтавкаНСП", 			"Х");
		ДанныеПечатиПустаяСтрока.Вставить("Стоимость", 			"Х");
		ДанныеПечатиПустаяСтрока.Вставить("СуммаНДС", 			"Х");
		ДанныеПечатиПустаяСтрока.Вставить("СуммаНСП", 			"Х");
		ДанныеПечатиПустаяСтрока.Вставить("Номенклатура", 		"Х");
		ДанныеПечатиПустаяСтрока.Вставить("ЕдиницаИзмерения", 	"Х");
		ДанныеПечатиПустаяСтрока.Вставить("Цена", 				"Х");
		ДанныеПечатиПустаяСтрока.Вставить("Всего", 				"Х");
				
		Для Каждого ИмяОбласти Из МассивОбластейМакета Цикл
			ОбластьМакета = Макет.ПолучитьОбласть(ИмяОбласти);
			
			Если ИмяОбласти = "ПодвалСФаксимиле" Тогда 
				ПодписиИФаксимиле = Новый Соответствие; // Ключ - имя каринки в области, Значение - имя реквизита
				ПодписиИФаксимиле.Вставить("ПодписьРуководителя", "ФаксимилеРуководителя");
				ПодписиИФаксимиле.Вставить("ПодписьГлавногоБухгалтера", "ФаксимилеГлавногоБухгалтера");
				ПодписиИФаксимиле.Вставить("ПечатьОрганизации", "ФайлФаксимильнаяПечать");
				ЗаполнитьЛоготипФаксимилеВОбластиМакета(ОбластьМакета, ДанныеПечати, ПодписиИФаксимиле, Ошибки);
			КонецЕсли;
			
			Если ИмяОбласти <> "Строка" Тогда
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			ИначеЕсли ИмяОбласти = "Строка" Тогда
				
				Если (ИсходнаяТаблица <> Неопределено И ПересчитаннаяТаблица <> Неопределено)
					ИЛИ ИсходнаяТаблица <> Неопределено Тогда
					
					ОбластьМакетаДопСтрока = Неопределено;
					
					// Заготовка необходимых структур
					Если ПересчитаннаяТаблица <> Неопределено Тогда
						ОбластьМакетаДопСтрока = Макет.ПолучитьОбласть("ПересчитаннаяСтрока");
						СтруктураОтбора = Новый Структура();
						СтруктураОтбора.Вставить("ДокументСФ", );
						СтруктураОтбора.Вставить("Ссылка", );
						СтруктураОтбора.Вставить("Номенклатура", );
						
						СтруктураНоменклатура = Новый Структура();
						СтруктураНоменклатура.Вставить("Номенклатура", );
					КонецЕсли;
						
					Для Каждого СтрокаТаблицы Из ИсходнаяТаблица Цикл
						КодТНВЭД = ?(ЗначениеЗаполнено(СтрокаТаблицы.КодТНВЭД), СтрокаТаблицы.КодТНВЭД, "0000");
						ДанныеПечатиСтроки.КодТовара1 = Сред(КодТНВЭД,1,1);
						ДанныеПечатиСтроки.КодТовара2 = Сред(КодТНВЭД,2,1);
						ДанныеПечатиСтроки.КодТовара3 = Сред(КодТНВЭД,3,1);
						ДанныеПечатиСтроки.КодТовара4 = Сред(КодТНВЭД,4,1);
						
						Если ОбластьМакетаДопСтрока = Неопределено Тогда
							ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
							ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
							ОбластьМакета.Параметры.Заполнить(ДанныеПечатиСтроки);
							ТабличныйДокумент.Вывести(ОбластьМакета);
							
						// Вывод основной строки с исходной суммой (к номенклатуре добавляется курс),
						// а затем вывод дополнительной строки с пересчитанными суммами.
						Иначе
							СтруктураНоменклатура.Номенклатура = СтрШаблон(НСтр("ru = '%1 курс %2'"),
								СтрокаТаблицы.Номенклатура,
								СтрокаТаблицы.Курс); 
							
							ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
							ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
							ОбластьМакета.Параметры.Заполнить(ДанныеПечатиСтроки);
							ОбластьМакета.Параметры.Заполнить(СтруктураНоменклатура);
							ТабличныйДокумент.Вывести(ОбластьМакета);
							
							ЗаполнитьЗначенияСвойств(СтруктураОтбора, СтрокаТаблицы);
							
							Строки = ПересчитаннаяТаблица.НайтиСтроки(СтруктураОтбора);
							Если Строки.Количество() > 0 Тогда
								Данные = Строки[0];
								
								КодТНВЭД = ?(ЗначениеЗаполнено(Данные.КодТНВЭД), Данные.КодТНВЭД, "0000");
								ДанныеПечатиСтроки.КодТовара1 = Сред(КодТНВЭД,1,1);
								ДанныеПечатиСтроки.КодТовара2 = Сред(КодТНВЭД,2,1);
								ДанныеПечатиСтроки.КодТовара3 = Сред(КодТНВЭД,3,1);
								ДанныеПечатиСтроки.КодТовара4 = Сред(КодТНВЭД,4,1);
								
								ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
								ОбластьМакета.Параметры.Заполнить(Данные);
								ОбластьМакета.Параметры.Заполнить(ДанныеПечатиСтроки);
								ТабличныйДокумент.Вывести(ОбластьМакета);
							КонецЕсли;
						КонецЕсли;	
					КонецЦикла;
					
				Иначе
					Для Каждого СтрокаТаблицы Из ПересчитаннаяТаблица Цикл 
						КодТНВЭД = ?(ЗначениеЗаполнено(СтрокаТаблицы.КодТНВЭД), СтрокаТаблицы.КодТНВЭД, "0000");
						ДанныеПечатиСтроки.КодТовара1 = Сред(КодТНВЭД,1,1);
						ДанныеПечатиСтроки.КодТовара2 = Сред(КодТНВЭД,2,1);
						ДанныеПечатиСтроки.КодТовара3 = Сред(КодТНВЭД,3,1);
						ДанныеПечатиСтроки.КодТовара4 = Сред(КодТНВЭД,4,1);
						
						ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
						ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
						ОбластьМакета.Параметры.Заполнить(ДанныеПечатиСтроки);
						ТабличныйДокумент.Вывести(ОбластьМакета);
					КонецЦикла;
				КонецЕсли;
						
				// Добавление пустых строк
				Если КоличествоСтрокСчетаФактуры > КоличествоСтрок Тогда 
					Для Счетчик = 1 По КоличествоСтрокСчетаФактуры - КоличествоСтрок Цикл
						ОбластьМакета.Параметры.Заполнить(ДанныеПечатиПустаяСтрока);
						ТабличныйДокумент.Вывести(ОбластьМакета);		
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;	
		КонецЦикла;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции
	
// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
		
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СчетФактура001") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
		"СчетФактура001", НСтр("ru = 'Счет-фактура (001)'"), ПечатьСчетФактура(МассивОбъектов, ОбъектыПечати, 20));
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СчетФактура002") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
		"СчетФактура002", НСтр("ru = 'Счет-фактура (002)'"), ПечатьСчетФактура(МассивОбъектов, ОбъектыПечати, 7));
	КонецЕсли;	
		
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "СчетФактура001";
	КомандаПечати.Представление = НСтр("ru = 'Счет-фактура (001)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 1;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "СчетФактура002";
	КомандаПечати.Представление = НСтр("ru = 'Счет-фактура (002)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 2;
	
	// Реестр документов
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор  = "РеестрСчетФактураВыписанный";
	КомандаПечати.Представление  = НСтр("ru = 'Реестр документов'");
	КомандаПечати.ЗаголовокФормы = НСтр("ru = 'Реестр документов ""Счет фактура выписанный""'");
	КомандаПечати.Обработчик     = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечатиРеестраДокументов";
	КомандаПечати.СписокФорм     = "ФормаСписка";
	КомандаПечати.Порядок        = 100;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция для формирования текста запроса
//
// Возвращаемое значение:
//	Строка - текст запроса
//
Функция ПолучитьТекстЗапросаДокументовОснования()
	
	// 1. Данные из выделенных документов "Счет-фактура выписанный"
	// 2. Документы "Счет-фактура выписанный", в которых необходимо пересчитать суммы
	// 3. Документы "Счет-фактура выписанный" с исходными суммы
	// 4. Документы "Счет-фактура выписанный" в которых не нужно группировать номенклатуру
	// 5. Документы из ТЧ "ДокументыОснования"
	// 6. Данные из документов основания по ТЧ "Товары" и "Услуги"
	// 7. Данные по 6 пункту с отбором по документам 3 пункта
	// 8. Данные по 6 пункту с отбором по документам 2 пункта с пересчитанными суммами по курсу
	// 9. Готовые данные по документам с исходными суммами (объединение данных без группировки
	//		по номенклатуре и данных с группировкой).
	// 10. Готовые данные по документам с пересчитанными суммами (объединение данных без группировки
	//		по номенклатуре и данных с группировкой).
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	ТаблицаДокумента.Ссылка КАК Ссылка,
		|	ТаблицаДокумента.ПечатьВРегламентированнойВалюте КАК ПечатьВРегламентированнойВалюте,
		|	ТаблицаДокумента.ПечататьКурсИСуммуВРегламентированнойВалюте КАК ПечататьКурсИСуммуВРегламентированнойВалюте,
		|	ТаблицаДокумента.НеГруппироватьПоНоменклатуре КАК НеГруппироватьПоНоменклатуре
		|ПОМЕСТИТЬ ВременнаяТаблицаНастройкиПечати
		|ИЗ
		|	Документ.СчетФактураВыписанный КАК ТаблицаДокумента
		|ГДЕ
		|	ТаблицаДокумента.Ссылка В(&СписокДокументов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаНастройкиПечати.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВременнаяТаблицаДокументыДляПересчета
		|ИЗ
		|	ВременнаяТаблицаНастройкиПечати КАК ВременнаяТаблицаНастройкиПечати
		|ГДЕ
		|	(ВременнаяТаблицаНастройкиПечати.ПечатьВРегламентированнойВалюте
		|			ИЛИ ВременнаяТаблицаНастройкиПечати.ПечататьКурсИСуммуВРегламентированнойВалюте)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаНастройкиПечати.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВременнаяТаблицаДокументыСИсходнымиСуммами
		|ИЗ
		|	ВременнаяТаблицаНастройкиПечати КАК ВременнаяТаблицаНастройкиПечати
		|ГДЕ
		|	НЕ ВременнаяТаблицаНастройкиПечати.ПечатьВРегламентированнойВалюте
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаНастройкиПечати.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВременнаяТаблицаДокументыБезГруппировки
		|ИЗ
		|	ВременнаяТаблицаНастройкиПечати КАК ВременнаяТаблицаНастройкиПечати
		|ГДЕ
		|	ВременнаяТаблицаНастройкиПечати.НеГруппироватьПоНоменклатуре
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДокумента.Ссылка КАК ДокументСФ,
		|	ТаблицаДокумента.ДокументОснование КАК ДокументОснование
		|ПОМЕСТИТЬ ВременнаяТаблицаДокументыОснования
		|ИЗ
		|	Документ.СчетФактураВыписанный.ДокументыОснования КАК ТаблицаДокумента
		|ГДЕ
		|	ТаблицаДокумента.Ссылка В(&СписокДокументов)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДокументОснование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаДокументыОснования.ДокументСФ КАК ДокументСФ,
		|	РеализацияТоваровУслугТовары.Ссылка КАК Ссылка,
		|	РеализацияТоваровУслугТовары.Ссылка.Курс КАК Курс,
		|	РеализацияТоваровУслугТовары.Ссылка.Кратность КАК Кратность,
		|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
		|	РеализацияТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмерения,
		|	РеализацияТоваровУслугТовары.Количество КАК Количество,
		|	РеализацияТоваровУслугТовары.Цена КАК Цена,
		|	РеализацияТоваровУслугТовары.Всего КАК Всего,
		//|	ВЫБОР
		//|		КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНалоги
		//|			ТОГДА РеализацияТоваровУслугТовары.Сумма - РеализацияТоваровУслугТовары.СуммаНДС - РеализацияТоваровУслугТовары.СуммаНСП
		//|		ИНАЧЕ РеализацияТоваровУслугТовары.Сумма
		//|	КОНЕЦ КАК Стоимость,
		|	РеализацияТоваровУслугТовары.СуммаНДС КАК СуммаНДС,
		|	РеализацияТоваровУслугТовары.СуммаНСП КАК СуммаНСП,
		|	РеализацияТоваровУслугТовары.СуммаДохода КАК Стоимость,
		|	РеализацияТоваровУслугТовары.СуммаСкидки КАК СуммаСкидки,
		|	РеализацияТоваровУслугТовары.Номенклатура.КодТНВЭД КАК КодТНВЭД
		|ПОМЕСТИТЬ ВременнаяТаблицаТоварыУслуги
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаДокументыОснования КАК ВременнаяТаблицаДокументыОснования
		|		ПО РеализацияТоваровУслугТовары.Ссылка = ВременнаяТаблицаДокументыОснования.ДокументОснование
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаДокументыОснования.ДокументСФ,
		|	ВозвратТоваровОтПокупателяТовары.Ссылка,
		|	ВозвратТоваровОтПокупателяТовары.Ссылка.Курс,
		|	ВозвратТоваровОтПокупателяТовары.Ссылка.Кратность,
		|	ВозвратТоваровОтПокупателяТовары.Номенклатура,
		|	ВозвратТоваровОтПокупателяТовары.Номенклатура.ЕдиницаИзмерения.Наименование,
		|	ВозвратТоваровОтПокупателяТовары.Количество,
		|	ВозвратТоваровОтПокупателяТовары.Цена,
		|	ВозвратТоваровОтПокупателяТовары.Всего,
		//|	ВЫБОР
		//|		КОГДА ВозвратТоваровОтПокупателяТовары.Ссылка.СуммаВключаетНалоги
		//|			ТОГДА ВозвратТоваровОтПокупателяТовары.Сумма - ВозвратТоваровОтПокупателяТовары.СуммаНДС - ВозвратТоваровОтПокупателяТовары.СуммаНСП
		//|		ИНАЧЕ ВозвратТоваровОтПокупателяТовары.Сумма
		//|	КОНЕЦ,
		|	ВозвратТоваровОтПокупателяТовары.СуммаНДС,
		|	ВозвратТоваровОтПокупателяТовары.СуммаНСП,
		|	ВозвратТоваровОтПокупателяТовары.СуммаДохода КАК Стоимость,
		|	ВозвратТоваровОтПокупателяТовары.СуммаСкидки,
		|	ВозвратТоваровОтПокупателяТовары.Номенклатура.КодТНВЭД
		|ИЗ
		|	Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаДокументыОснования КАК ВременнаяТаблицаДокументыОснования
		|		ПО ВозвратТоваровОтПокупателяТовары.Ссылка = ВременнаяТаблицаДокументыОснования.ДокументОснование
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаДокументыОснования.ДокументСФ,
		|	РеализацияТоваровУслугУслуги.Ссылка,
		|	РеализацияТоваровУслугУслуги.Ссылка.Курс,
		|	РеализацияТоваровУслугУслуги.Ссылка.Кратность,
		|	РеализацияТоваровУслугУслуги.Номенклатура,
		|	РеализацияТоваровУслугУслуги.Номенклатура.ЕдиницаИзмерения.Наименование,
		|	РеализацияТоваровУслугУслуги.Количество,
		|	РеализацияТоваровУслугУслуги.Цена,
		|	РеализацияТоваровУслугУслуги.Всего,
		//|	ВЫБОР
		//|		КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНалоги
		//|			ТОГДА РеализацияТоваровУслугУслуги.Сумма - РеализацияТоваровУслугУслуги.СуммаНДС - РеализацияТоваровУслугУслуги.СуммаНСП
		//|		ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма
		//|	КОНЕЦ,
		|	РеализацияТоваровУслугУслуги.СуммаНДС,
		|	РеализацияТоваровУслугУслуги.СуммаНСП,
		|	РеализацияТоваровУслугУслуги.СуммаДохода КАК Стоимость,
		|	РеализацияТоваровУслугУслуги.СуммаСкидки,
		|	РеализацияТоваровУслугУслуги.Номенклатура.КодТНВЭД
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаДокументыОснования КАК ВременнаяТаблицаДокументыОснования
		|		ПО РеализацияТоваровУслугУслуги.Ссылка = ВременнаяТаблицаДокументыОснования.ДокументОснование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаТоварыУслуги.ДокументСФ КАК ДокументСФ,
		|	ВременнаяТаблицаТоварыУслуги.Ссылка КАК Ссылка,
		|	ВременнаяТаблицаТоварыУслуги.Курс КАК Курс,
		|	ВременнаяТаблицаТоварыУслуги.Кратность КАК Кратность,
		|	ВременнаяТаблицаТоварыУслуги.Номенклатура КАК Номенклатура,
		|	ВременнаяТаблицаТоварыУслуги.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВременнаяТаблицаТоварыУслуги.Количество КАК Количество,
		|	ВременнаяТаблицаТоварыУслуги.Цена КАК Цена,
		|	ВременнаяТаблицаТоварыУслуги.Всего КАК Всего,
		|	ВременнаяТаблицаТоварыУслуги.Стоимость КАК Стоимость,
		|	ВременнаяТаблицаТоварыУслуги.СуммаНДС КАК СуммаНДС,
		|	ВременнаяТаблицаТоварыУслуги.СуммаНСП КАК СуммаНСП,
		|	ВременнаяТаблицаТоварыУслуги.СуммаСкидки КАК СуммаСкидки,
		|	ВременнаяТаблицаТоварыУслуги.КодТНВЭД КАК КодТНВЭД
		|ПОМЕСТИТЬ ВременнаяТаблицаТоварыУслугиИсходныеСуммы
		|ИЗ
		|	ВременнаяТаблицаТоварыУслуги КАК ВременнаяТаблицаТоварыУслуги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаДокументыСИсходнымиСуммами КАК ВременнаяТаблицаДокументыСИсходнымиСуммами
		|		ПО ВременнаяТаблицаТоварыУслуги.ДокументСФ = ВременнаяТаблицаДокументыСИсходнымиСуммами.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаТоварыУслуги.ДокументСФ КАК ДокументСФ,
		|	ВременнаяТаблицаТоварыУслуги.Ссылка КАК Ссылка,
		|	ВременнаяТаблицаТоварыУслуги.Курс КАК Курс,
		|	ВременнаяТаблицаТоварыУслуги.Кратность КАК Кратность,
		|	ВременнаяТаблицаТоварыУслуги.Номенклатура КАК Номенклатура,
		|	ВременнаяТаблицаТоварыУслуги.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВременнаяТаблицаТоварыУслуги.Количество КАК Количество,
		|	ВЫРАЗИТЬ(ВременнаяТаблицаТоварыУслуги.Цена * ВременнаяТаблицаТоварыУслуги.Курс / ВременнаяТаблицаТоварыУслуги.Кратность КАК ЧИСЛО(15, 2)) КАК Цена,
		|	ВЫРАЗИТЬ(ВременнаяТаблицаТоварыУслуги.Всего * ВременнаяТаблицаТоварыУслуги.Курс / ВременнаяТаблицаТоварыУслуги.Кратность КАК ЧИСЛО(15, 2)) КАК Всего,
		|	ВЫРАЗИТЬ(ВременнаяТаблицаТоварыУслуги.Стоимость * ВременнаяТаблицаТоварыУслуги.Курс / ВременнаяТаблицаТоварыУслуги.Кратность КАК ЧИСЛО(15, 2)) КАК Стоимость,
		|	ВЫРАЗИТЬ(ВременнаяТаблицаТоварыУслуги.СуммаНДС * ВременнаяТаблицаТоварыУслуги.Курс / ВременнаяТаблицаТоварыУслуги.Кратность КАК ЧИСЛО(15, 2)) КАК СуммаНДС,
		|	ВЫРАЗИТЬ(ВременнаяТаблицаТоварыУслуги.СуммаНСП * ВременнаяТаблицаТоварыУслуги.Курс / ВременнаяТаблицаТоварыУслуги.Кратность КАК ЧИСЛО(15, 2)) КАК СуммаНСП,
		|	ВЫРАЗИТЬ(ВременнаяТаблицаТоварыУслуги.СуммаСкидки * ВременнаяТаблицаТоварыУслуги.Курс / ВременнаяТаблицаТоварыУслуги.Кратность КАК ЧИСЛО(15, 2)) КАК СуммаСкидки,
		|	ВременнаяТаблицаТоварыУслуги.КодТНВЭД КАК КодТНВЭД
		|ПОМЕСТИТЬ ВременнаяТаблицаТоварыУслугиПересчитанныеСуммы
		|ИЗ
		|	ВременнаяТаблицаТоварыУслуги КАК ВременнаяТаблицаТоварыУслуги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаДокументыДляПересчета КАК ВременнаяТаблицаДокументыДляПересчета
		|		ПО ВременнаяТаблицаТоварыУслуги.ДокументСФ = ВременнаяТаблицаДокументыДляПересчета.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаТоварыУслугиИсходныеСуммы.ДокументСФ КАК ДокументСФ,
		|	ВременнаяТаблицаТоварыУслугиИсходныеСуммы.Ссылка КАК Ссылка,
		|	ВременнаяТаблицаТоварыУслугиИсходныеСуммы.Курс КАК Курс,
		|	ВременнаяТаблицаТоварыУслугиИсходныеСуммы.Кратность КАК Кратность,
		|	ВременнаяТаблицаТоварыУслугиИсходныеСуммы.Номенклатура КАК Номенклатура,
		|	ВременнаяТаблицаТоварыУслугиИсходныеСуммы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВременнаяТаблицаТоварыУслугиИсходныеСуммы.Количество КАК Количество,
		|	ВременнаяТаблицаТоварыУслугиИсходныеСуммы.Цена КАК Цена,
		|	ВременнаяТаблицаТоварыУслугиИсходныеСуммы.Всего КАК Всего,
		|	ВременнаяТаблицаТоварыУслугиИсходныеСуммы.Стоимость КАК Стоимость,
		|	ВременнаяТаблицаТоварыУслугиИсходныеСуммы.СуммаНДС КАК СуммаНДС,
		|	ВременнаяТаблицаТоварыУслугиИсходныеСуммы.СуммаНСП КАК СуммаНСП,
		|	ВременнаяТаблицаТоварыУслугиИсходныеСуммы.СуммаСкидки КАК СуммаСкидки,
		|	ВременнаяТаблицаТоварыУслугиИсходныеСуммы.КодТНВЭД КАК КодТНВЭД
		|ИЗ
		|	ВременнаяТаблицаТоварыУслугиИсходныеСуммы КАК ВременнаяТаблицаТоварыУслугиИсходныеСуммы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаДокументыБезГруппировки КАК ВременнаяТаблицаДокументыБезГруппировки
		|		ПО ВременнаяТаблицаТоварыУслугиИсходныеСуммы.ДокументСФ = ВременнаяТаблицаДокументыБезГруппировки.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаТоварыУслугиИсходныеСуммы.ДокументСФ,
		|	МАКСИМУМ(ВременнаяТаблицаТоварыУслугиИсходныеСуммы.Ссылка),
		|	СРЕДНЕЕ(ВременнаяТаблицаТоварыУслугиИсходныеСуммы.Курс),
		|	СРЕДНЕЕ(ВременнаяТаблицаТоварыУслугиИсходныеСуммы.Кратность),
		|	ВременнаяТаблицаТоварыУслугиИсходныеСуммы.Номенклатура,
		|	МАКСИМУМ(ВременнаяТаблицаТоварыУслугиИсходныеСуммы.ЕдиницаИзмерения),
		|	СУММА(ВременнаяТаблицаТоварыУслугиИсходныеСуммы.Количество),
		|	СРЕДНЕЕ(ВременнаяТаблицаТоварыУслугиИсходныеСуммы.Цена),
		|	СУММА(ВременнаяТаблицаТоварыУслугиИсходныеСуммы.Всего),
		|	СУММА(ВременнаяТаблицаТоварыУслугиИсходныеСуммы.Стоимость),
		|	СУММА(ВременнаяТаблицаТоварыУслугиИсходныеСуммы.СуммаНДС),
		|	СУММА(ВременнаяТаблицаТоварыУслугиИсходныеСуммы.СуммаНСП),
		|	СУММА(ВременнаяТаблицаТоварыУслугиИсходныеСуммы.СуммаСкидки),
		|	МАКСИМУМ(ВременнаяТаблицаТоварыУслугиИсходныеСуммы.КодТНВЭД)
		|ИЗ
		|	ВременнаяТаблицаТоварыУслугиИсходныеСуммы КАК ВременнаяТаблицаТоварыУслугиИсходныеСуммы
		|ГДЕ
		|	НЕ ВременнаяТаблицаТоварыУслугиИсходныеСуммы.ДокументСФ В
		|				(ВЫБРАТЬ
		|					ВременнаяТаблицаДокументыБезГруппировки.Ссылка
		|				ИЗ
		|					ВременнаяТаблицаДокументыБезГруппировки)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаТоварыУслугиИсходныеСуммы.ДокументСФ,
		|	ВременнаяТаблицаТоварыУслугиИсходныеСуммы.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаТоварыУслугиПересчитанныеСуммы.ДокументСФ КАК ДокументСФ,
		|	ВременнаяТаблицаТоварыУслугиПересчитанныеСуммы.Ссылка КАК Ссылка,
		|	ВременнаяТаблицаТоварыУслугиПересчитанныеСуммы.Курс КАК Курс,
		|	ВременнаяТаблицаТоварыУслугиПересчитанныеСуммы.Кратность КАК Кратность,
		|	ВременнаяТаблицаТоварыУслугиПересчитанныеСуммы.Номенклатура КАК Номенклатура,
		|	ВременнаяТаблицаТоварыУслугиПересчитанныеСуммы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВременнаяТаблицаТоварыУслугиПересчитанныеСуммы.Количество КАК Количество,
		|	ВременнаяТаблицаТоварыУслугиПересчитанныеСуммы.Цена КАК Цена,
		|	ВременнаяТаблицаТоварыУслугиПересчитанныеСуммы.Всего КАК Всего,
		|	ВременнаяТаблицаТоварыУслугиПересчитанныеСуммы.Стоимость КАК Стоимость,
		|	ВременнаяТаблицаТоварыУслугиПересчитанныеСуммы.СуммаНДС КАК СуммаНДС,
		|	ВременнаяТаблицаТоварыУслугиПересчитанныеСуммы.СуммаНСП КАК СуммаНСП,
		|	ВременнаяТаблицаТоварыУслугиПересчитанныеСуммы.СуммаСкидки КАК СуммаСкидки,
		|	ВременнаяТаблицаТоварыУслугиПересчитанныеСуммы.КодТНВЭД КАК КодТНВЭД
		|ИЗ
		|	ВременнаяТаблицаТоварыУслугиПересчитанныеСуммы КАК ВременнаяТаблицаТоварыУслугиПересчитанныеСуммы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаДокументыБезГруппировки КАК ВременнаяТаблицаДокументыБезГруппировки
		|		ПО ВременнаяТаблицаТоварыУслугиПересчитанныеСуммы.ДокументСФ = ВременнаяТаблицаДокументыБезГруппировки.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаТоварыУслугиПересчитанныеСуммы.ДокументСФ,
		|	МАКСИМУМ(ВременнаяТаблицаТоварыУслугиПересчитанныеСуммы.Ссылка),
		|	СРЕДНЕЕ(ВременнаяТаблицаТоварыУслугиПересчитанныеСуммы.Курс),
		|	СРЕДНЕЕ(ВременнаяТаблицаТоварыУслугиПересчитанныеСуммы.Кратность),
		|	ВременнаяТаблицаТоварыУслугиПересчитанныеСуммы.Номенклатура,
		|	МАКСИМУМ(ВременнаяТаблицаТоварыУслугиПересчитанныеСуммы.ЕдиницаИзмерения),
		|	СУММА(ВременнаяТаблицаТоварыУслугиПересчитанныеСуммы.Количество),
		|	СРЕДНЕЕ(ВременнаяТаблицаТоварыУслугиПересчитанныеСуммы.Цена),
		|	СУММА(ВременнаяТаблицаТоварыУслугиПересчитанныеСуммы.Всего),
		|	СУММА(ВременнаяТаблицаТоварыУслугиПересчитанныеСуммы.Стоимость),
		|	СУММА(ВременнаяТаблицаТоварыУслугиПересчитанныеСуммы.СуммаНДС),
		|	СУММА(ВременнаяТаблицаТоварыУслугиПересчитанныеСуммы.СуммаНСП),
		|	СУММА(ВременнаяТаблицаТоварыУслугиПересчитанныеСуммы.СуммаСкидки),
		|	МАКСИМУМ(ВременнаяТаблицаТоварыУслугиПересчитанныеСуммы.КодТНВЭД)
		|ИЗ
		|	ВременнаяТаблицаТоварыУслугиПересчитанныеСуммы КАК ВременнаяТаблицаТоварыУслугиПересчитанныеСуммы
		|ГДЕ
		|	НЕ ВременнаяТаблицаТоварыУслугиПересчитанныеСуммы.ДокументСФ В
		|				(ВЫБРАТЬ
		|					ВременнаяТаблицаДокументыБезГруппировки.Ссылка
		|				ИЗ
		|					ВременнаяТаблицаДокументыБезГруппировки)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаТоварыУслугиПересчитанныеСуммы.ДокументСФ,
		|	ВременнаяТаблицаТоварыУслугиПересчитанныеСуммы.Номенклатура";	
		
	Возврат ТекстЗапроса;
	
КонецФункции // ПолучитьТекстЗапросаДокументовОснования()

Процедура ЗаполнитьЛоготипФаксимилеВОбластиМакета(ОбластьМакета, ДанныеОбъекта, ПодписиИФаксимиле, Ошибки) Экспорт
	
	Для каждого ЭлементСоответствия Из ПодписиИФаксимиле Цикл
		
		ПлашкаПодписи = ПолучитьПлашкуПодписиБезопасно(ОбластьМакета, ЭлементСоответствия.Ключ, , Ошибки);
		Если ПлашкаПодписи = Неопределено Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеОбъекта[ЭлементСоответствия.Значение]) Тогда
			
			ДвоичныеДанные = РаботаСФайлами.ДвоичныеДанныеФайла(ДанныеОбъекта[ЭлементСоответствия.Значение]);
			Если ЗначениеЗаполнено(ДвоичныеДанные) Тогда
				
				ПлашкаПодписи.Картинка = Новый Картинка(ДвоичныеДанные);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьПлашкуПодписиБезопасно(ОбластьМакета, ИмяПлашки, ПредставлениеПодписи, Ошибки) Экспорт
	
	ПлашкаПодписи = ОбластьМакета.Области.Найти(ИмяПлашки);
	Если ПлашкаПодписи = Неопределено Тогда
		
		ТекстСообщения = НСтр("ru ='ВНИМАНИЕ! Нет места для картинки %1. Возможно используется пользовательский макет.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ?(ПустаяСтрока(ПредставлениеПодписи), ИмяПлашки, ПредставлениеПодписи));
		
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, Неопределено, ТекстСообщения, Неопределено);
		
	КонецЕсли;
	
	ПлашкаПодписи.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
	
	Возврат ПлашкаПодписи;
	
КонецФункции

#КонецОбласти

#КонецЕсли