#Область ОбработчикиСобытийФормы

// Процедура - обработчик события ПриСозданииНаСервере.
// В процедуре осуществляется
// - инициализация реквизитов формы,
// - установка параметров функциональных опций формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ЗаполнитьКоэффициент();
КонецПроцедуры

// Процедура - обработчик события ОбработкаОповещения.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ИзмененОтраслевойКоэффициент" Тогда 
		ЗаполнитьКоэффициент();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура - Заполнить коэффициент.
//
&НаСервере
Процедура ЗаполнитьКоэффициент()
	Период = НачалоГода(ТекущаяДатаСеанса());
	ДанныеСтруктура = РегистрыСведений.КоэффициентыНалогаНаИмущество.ПолучитьПоследнее(Период, Новый Структура("Классификация", Объект.Ссылка));
	Коэффициент = ДанныеСтруктура.Коэффициент;	
КонецПроцедуры // ЗаполнитьКоэффициент()

#КонецОбласти
