#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура - Заполнить по умолчанию
// Выполняет первоночальное заполнение
Процедура ЗаполнитьПоУмолчанию() Экспорт 
	// Заполнение справочника ГруппыОСНУ  	
	// I группа
	ГруппаОС 	= Справочники.ГруппыНалоговогоУчетаОС.Группа1;
	СправочникОбъект 		= ГруппаОС.ПолучитьОбъект();
	СправочникОбъект.Наименование = НСтр("ru = 'Легковые автомобили; автотракторная техника, спец/инструменты, инвентарь; компьютеры'");
	СправочникОбъект.ВидУчетаВГруппеОС = Перечисления.ВидыНалоговогоУчетаВГруппахОС.ПоГруппе;
	СправочникОбъект.НормаАмортизации	= 30;	
	БухгалтерскийУчетСервер.ЗаписатьСправочникОбъект(СправочникОбъект);
	СоздатьЗаписьСведенийОГруппахОСНУ(ГруппаОС, 15, 30);
	
	// II группа
	ГруппаОС 	= Справочники.ГруппыНалоговогоУчетаОС.Группа2;
	СправочникОбъект 		= ГруппаОС.ПолучитьОбъект();
	СправочникОбъект.Наименование = НСтр("ru = 'Машины и оборудование, подвижной состав автомобильного транспорта, мебель для офиса'");
	СправочникОбъект.ВидУчетаВГруппеОС = Перечисления.ВидыНалоговогоУчетаВГруппахОС.ПоГруппе;
	СправочникОбъект.НормаАмортизации	= 25; 
	БухгалтерскийУчетСервер.ЗаписатьСправочникОбъект(СправочникОбъект);
	СоздатьЗаписьСведенийОГруппахОСНУ(ГруппаОС, 15, 25);
	
	// III группа
	ГруппаОС 	= Справочники.ГруппыНалоговогоУчетаОС.Группа3;
	СправочникОбъект 		= ГруппаОС.ПолучитьОбъект();
	СправочникОбъект.Наименование = НСтр("ru = 'Другие ОС, подлежащие амортизации и расходы, приравненные к ним'");
	СправочникОбъект.ВидУчетаВГруппеОС = Перечисления.ВидыНалоговогоУчетаВГруппахОС.ПоГруппе;
	СправочникОбъект.НормаАмортизации	= 20;  
	БухгалтерскийУчетСервер.ЗаписатьСправочникОбъект(СправочникОбъект);
	СоздатьЗаписьСведенийОГруппахОСНУ(ГруппаОС, 15, 20);
	
	// IV группа
	ГруппаОС 	= Справочники.ГруппыНалоговогоУчетаОС.Группа4;
	СправочникОбъект 		= ГруппаОС.ПолучитьОбъект();
	СправочникОбъект.Наименование = НСтр("ru = 'Железнодорожные, морские и речные транспортные средства, силовые установки, устройства электропередачи'");
	СправочникОбъект.ВидУчетаВГруппеОС = Перечисления.ВидыНалоговогоУчетаВГруппахОС.ПоГруппе;
	СправочникОбъект.НормаАмортизации	= 10;
	БухгалтерскийУчетСервер.ЗаписатьСправочникОбъект(СправочникОбъект);
	СоздатьЗаписьСведенийОГруппахОСНУ(ГруппаОС, 15, 10);		
	
	// V группа
	ГруппаОС 	= Справочники.ГруппыНалоговогоУчетаОС.Группа5;
	СправочникОбъект 		= ГруппаОС.ПолучитьОбъект();
	СправочникОбъект.Наименование = НСтр("ru = 'Здания, сооружения, строения'");
	СправочникОбъект.ВидУчетаВГруппеОС = Перечисления.ВидыНалоговогоУчетаВГруппахОС.ПоОбъектам;
	СправочникОбъект.НормаАмортизации	= 10;
	СправочникОбъект.НормаАмортизацииДополнительная	= 20;
	БухгалтерскийУчетСервер.ЗаписатьСправочникОбъект(СправочникОбъект);
	СоздатьЗаписьСведенийОГруппахОСНУ(ГруппаОС, 15, 10);
	
	// VI группа
	ГруппаОС 	= Справочники.ГруппыНалоговогоУчетаОС.Группа6;
	СправочникОбъект 		= ГруппаОС.ПолучитьОбъект();
	СправочникОбъект.Наименование = НСтр("ru = 'Геологическая подготовка месторождений, ОС горнодобывающих(-перерабатывающих) предприятий'");
	СправочникОбъект.ВидУчетаВГруппеОС = Перечисления.ВидыНалоговогоУчетаВГруппахОС.ПоОбъектам;
	СправочникОбъект.НормаАмортизации	= 50;     
	БухгалтерскийУчетСервер.ЗаписатьСправочникОбъект(СправочникОбъект);
	СоздатьЗаписьСведенийОГруппахОСНУ(ГруппаОС, 15, 50);
КонецПроцедуры // ЗаполнитьПоУмолчанию()	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СоздатьЗаписьСведенийОГруппахОСНУ(ГруппаОС, ВычетНаРемонт, НормаАмортизации)
	
	НаборЗаписей = РегистрыСведений.СведенияОГруппахОсновныхСредств.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.ВидСравнения 		= ВидСравнения.Равно;		
	НаборЗаписей.Отбор.Период.Значение	 		= '20060101';		
	НаборЗаписей.Отбор.ГруппаОС.ВидСравнения 	= ВидСравнения.Равно;		
	НаборЗаписей.Отбор.ГруппаОС.Значение	 	= ГруппаОС;		
	НаборЗаписей.Отбор.Период.Использование = Истина;		
	НаборЗаписей.Отбор.ГруппаОС.Использование = Истина;
	
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Запись = НаборЗаписей.Добавить();
	Запись.Период = '20060101';
	Запись.ГруппаОС = ГруппаОС;
	Запись.ВычетНаРемонт = ВычетНаРемонт;
	Запись.НормаАмортизации = НормаАмортизации;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

