#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыПроведенияДокумента

// Формирует таблицу значений, содержащую данные для проведения по регистру бухгалтерии Хозрасчетный.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаХозрасчетный(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	ВалютаРегламентированногоУчета = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.БанковскийСчет.СчетУчета КАК СчетДт,
		|	ВременнаяТаблицаРасшифровкаПлатежа.СчетУчета КАК СчетКт,
		|	ВременнаяТаблицаШапка.БанковскийСчет КАК СубконтоДт1,
		|	ВременнаяТаблицаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств КАК СубконтоДт2,
		|	ВременнаяТаблицаШапка.Контрагент КАК СубконтоКт1,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
		|	ВременнаяТаблицаРасшифровкаПлатежа.ДоговорКонтрагента КАК СубконтоКт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.БанковскийСчет.СчетУчета.Валютный
		|			ТОГДА ВременнаяТаблицаШапка.БанковскийСчет.ВалютаДенежныхСредств
		|		ИНАЧЕ &ВалютаРегламентированногоУчета
		|	КОНЕЦ КАК ВалютаДт,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.СчетУчета.Валютный
		|			ТОГДА ВременнаяТаблицаШапка.ВалютаДоговора
		|		ИНАЧЕ &ВалютаРегламентированногоУчета
		|	КОНЕЦ КАК ВалютаКт,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.БанковскийСчет.СчетУчета.Валютный
		|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ВалютнаяСуммаДт,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.СчетУчета.Валютный
		|			ТОГДА ВЫБОР
		|					КОГДА ВременнаяТаблицаШапка.Курс >= ВременнаяТаблицаШапка.КурсДоговора
		|						ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов
		|					ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа / ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов
		|				КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ВалютнаяСуммаКт,
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВЫБОР
		|		КОГДА (ВЫРАЗИТЬ(ВременнаяТаблицаШапка.Комментарий КАК СТРОКА(1024))) = """"
		|			ТОГДА """"
		|		ИНАЧЕ "" - ""
		|	КОНЕЦ + (ВЫРАЗИТЬ(ВременнаяТаблицаШапка.Комментарий КАК СТРОКА(1024))) КАК Содержание,
		|	ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаШапка.Курс КАК Сумма,
		|	0 КАК КоличествоДт,
		|	0 КАК КоличествоКт
		|ИЗ
		|	ВременнаяТаблицаРасшифровкаПлатежа КАК ВременнаяТаблицаРасшифровкаПлатежа
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО ВременнаяТаблицаРасшифровкаПлатежа.Ссылка = ВременнаяТаблицаШапка.Ссылка
		|ГДЕ
		|	(ВременнаяТаблицаШапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППВ.ОплатаОтПокупателя)
		|			ИЛИ ВременнаяТаблицаШапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППВ.ВозвратОтПоставщика)
		|			ИЛИ ВременнаяТаблицаШапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППВ.РасчетыПоЗаймам))
		|	И ВЫБОР
		|			КОГДА ВременнаяТаблицаШапка.ВалютаДоговора = &ВалютаРегламентированногоУчета
		|				ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа
		|			ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов * ВременнаяТаблицаШапка.Курс
		|		КОНЕЦ <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.БанковскийСчет.СчетУчета,
		|	ВременнаяТаблицаПрочиеПриходы.СчетУчета,
		|	ВременнаяТаблицаШапка.БанковскийСчет,
		|	ВременнаяТаблицаПрочиеПриходы.СтатьяДвиженияДенежныхСредств,
		|	НЕОПРЕДЕЛЕНО,
		|	ВременнаяТаблицаПрочиеПриходы.Субконто1,
		|	ВременнаяТаблицаПрочиеПриходы.Субконто2,
		|	ВременнаяТаблицаПрочиеПриходы.Субконто3,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.БанковскийСчет.СчетУчета.Валютный
		|			ТОГДА ВременнаяТаблицаШапка.БанковскийСчет.ВалютаДенежныхСредств
		|		ИНАЧЕ &ВалютаРегламентированногоУчета
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаПрочиеПриходы.СчетУчета.Валютный
		|			ТОГДА ВременнаяТаблицаШапка.БанковскийСчет.ВалютаДенежныхСредств
		|		ИНАЧЕ &ВалютаРегламентированногоУчета
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.БанковскийСчет.СчетУчета.Валютный
		|			ТОГДА ВременнаяТаблицаПрочиеПриходы.СуммаПлатежа
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаПрочиеПриходы.СчетУчета.Валютный
		|			ТОГДА ВременнаяТаблицаПрочиеПриходы.СуммаПлатежа
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВЫБОР
		|		КОГДА (ВЫРАЗИТЬ(ВременнаяТаблицаШапка.Комментарий КАК СТРОКА(1024))) = """"
		|			ТОГДА """"
		|		ИНАЧЕ "" - ""
		|	КОНЕЦ + (ВЫРАЗИТЬ(ВременнаяТаблицаШапка.Комментарий КАК СТРОКА(1024))),
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.Курс = 0
		|			ТОГДА ВременнаяТаблицаПрочиеПриходы.СуммаПлатежа
		|		ИНАЧЕ ВременнаяТаблицаПрочиеПриходы.СуммаПлатежа * ВременнаяТаблицаШапка.Курс
		|	КОНЕЦ,
		|	0,
		|	0
		|ИЗ
		|	ВременнаяТаблицаПрочиеПриходы КАК ВременнаяТаблицаПрочиеПриходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО ВременнаяТаблицаПрочиеПриходы.Ссылка = ВременнаяТаблицаШапка.Ссылка
		|ГДЕ
		|	ВременнаяТаблицаШапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППВ.ПрочийПриход)
		|	И ВременнаяТаблицаПрочиеПриходы.СуммаПлатежа <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.БанковскийСчет.СчетУчета,
		|	ВременнаяТаблицаШапка.СчетУчета,
		|	ВременнаяТаблицаШапка.БанковскийСчет,
		|	ВременнаяТаблицаШапка.СтатьяДвиженияДенежныхСредств,
		|	НЕОПРЕДЕЛЕНО,
		|	ВременнаяТаблицаШапка.ФизЛицо,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	ВременнаяТаблицаШапка.БанковскийСчет.ВалютаДенежныхСредств,
		|	ВременнаяТаблицаШапка.БанковскийСчет.ВалютаДенежныхСредств,
		|	ВременнаяТаблицаШапка.СуммаДокумента,
		|	ВременнаяТаблицаШапка.СуммаДокумента,
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВЫБОР
		|		КОГДА (ВЫРАЗИТЬ(ВременнаяТаблицаШапка.Комментарий КАК СТРОКА(1024))) = """"
		|			ТОГДА """"
		|		ИНАЧЕ "" - ""
		|	КОНЕЦ + (ВЫРАЗИТЬ(ВременнаяТаблицаШапка.Комментарий КАК СТРОКА(1024))),
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.Курс = 0
		|			ТОГДА ВременнаяТаблицаШапка.СуммаДокумента
		|		ИНАЧЕ ВременнаяТаблицаШапка.СуммаДокумента * ВременнаяТаблицаШапка.Курс
		|	КОНЕЦ,
		|	0,
		|	0
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|ГДЕ
		|	ВременнаяТаблицаШапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППВ.ВозвратОтСорудника)";
			
	//Операционная курсовая разница
	ТекстОКР = "";
	Если НЕ Константы.НеСчитатьОперационныеКурсовыеРазницы.Получить() Тогда	
		Если ДокументСсылка.ВалютаДенежныхСредств <> ВалютаРегламентированногоУчета И ДокументСсылка.ВалютаДоговора <> ВалютаРегламентированногоУчета Тогда
			ТекстОКР =
			"ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА (ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов - ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВЫБОР
			|				КОГДА ВременнаяТаблицаШапка.КурсДоговора > ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов
			|					ТОГДА ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.КурсДоговора
			|				ИНАЧЕ ВременнаяТаблицаШапка.КурсДоговора / ВременнаяТаблицаШапка.Курс
			|			КОНЕЦ) * ВременнаяТаблицаШапка.Курс < 0
			|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УбыткиОтКурсовыхРазницПоОперациямВИностраннойВалюте)
			|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.СчетУчета
			|	КОНЕЦ КАК СчетДт,
			|	ВЫБОР
			|		КОГДА (ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов - ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВЫБОР
			|				КОГДА ВременнаяТаблицаШапка.КурсДоговора > ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов
			|					ТОГДА ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.КурсДоговора
			|				ИНАЧЕ ВременнаяТаблицаШапка.КурсДоговора / ВременнаяТаблицаШапка.Курс
			|			КОНЕЦ) * ВременнаяТаблицаШапка.Курс < 0
			|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СчетУчета
			|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходОтКурсовыхРазницПоОперациямВИностраннойВалюте)
			|	КОНЕЦ КАК СчетКт,
			|	ВЫБОР
			|		КОГДА (ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов - ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВЫБОР
			|				КОГДА ВременнаяТаблицаШапка.КурсДоговора > ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов
			|					ТОГДА ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.КурсДоговора
			|				ИНАЧЕ ВременнаяТаблицаШапка.КурсДоговора / ВременнаяТаблицаШапка.Курс
			|			КОНЕЦ) * ВременнаяТаблицаШапка.Курс < 0
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.КурсовыеРазницы)
			|		ИНАЧЕ ВременнаяТаблицаШапка.Контрагент
			|	КОНЕЦ КАК СубконтоДт1,
			|	ВЫБОР
			|		КОГДА (ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов - ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВЫБОР
			|				КОГДА ВременнаяТаблицаШапка.КурсДоговора > ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов
			|					ТОГДА ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.КурсДоговора
			|				ИНАЧЕ ВременнаяТаблицаШапка.КурсДоговора / ВременнаяТаблицаШапка.Курс
			|			КОНЕЦ) * ВременнаяТаблицаШапка.Курс < 0
			|			ТОГДА НЕОПРЕДЕЛЕНО
			|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.ДоговорКонтрагента
			|	КОНЕЦ КАК СубконтоДт2,
			|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
			|	ВЫБОР
			|		КОГДА (ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов - ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВЫБОР
			|				КОГДА ВременнаяТаблицаШапка.КурсДоговора > ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов
			|					ТОГДА ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.КурсДоговора
			|				ИНАЧЕ ВременнаяТаблицаШапка.КурсДоговора / ВременнаяТаблицаШапка.Курс
			|			КОНЕЦ) * ВременнаяТаблицаШапка.Курс < 0
			|			ТОГДА ВременнаяТаблицаШапка.Контрагент
			|		ИНАЧЕ НЕОПРЕДЕЛЕНО
			|	КОНЕЦ КАК СубконтоКт1,
			|	ВЫБОР
			|		КОГДА (ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов - ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВЫБОР
			|				КОГДА ВременнаяТаблицаШапка.КурсДоговора > ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов
			|					ТОГДА ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.КурсДоговора
			|				ИНАЧЕ ВременнаяТаблицаШапка.КурсДоговора / ВременнаяТаблицаШапка.Курс
			|			КОНЕЦ) * ВременнаяТаблицаШапка.Курс < 0
			|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.ДоговорКонтрагента
			|		ИНАЧЕ НЕОПРЕДЕЛЕНО
			|	КОНЕЦ КАК СубконтоКт2,
			|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
			|	&ВалютаРегламентированногоУчета КАК Поле5,
			|	ВременнаяТаблицаШапка.ВалютаДоговора КАК Поле6,
			|	0 КАК ВалютнаяСуммаДт,
			|	0 КАК ВалютнаяСуммаКт,
			|	ВременнаяТаблицаШапка.Дата,
			|	ВременнаяТаблицаШапка.Организация,
			|	ВременнаяТаблицаШапка.СодержаниеОКР КАК Содержание,
			|	ВЫБОР
			|		КОГДА (ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов - ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВЫБОР
			|				КОГДА ВременнаяТаблицаШапка.КурсДоговора > ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов
			|					ТОГДА ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.КурсДоговора
			|				ИНАЧЕ ВременнаяТаблицаШапка.КурсДоговора / ВременнаяТаблицаШапка.Курс
			|			КОНЕЦ) * ВременнаяТаблицаШапка.Курс > 0
			|			ТОГДА (ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов - ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВЫБОР
			|				КОГДА ВременнаяТаблицаШапка.КурсДоговора > ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов
			|					ТОГДА ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.КурсДоговора
			|				ИНАЧЕ ВременнаяТаблицаШапка.КурсДоговора / ВременнаяТаблицаШапка.Курс
			|			КОНЕЦ) * ВременнаяТаблицаШапка.Курс
			|		ИНАЧЕ -((ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов - ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВЫБОР
			|				КОГДА ВременнаяТаблицаШапка.КурсДоговора > ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов
			|					ТОГДА ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.КурсДоговора
			|				ИНАЧЕ ВременнаяТаблицаШапка.КурсДоговора / ВременнаяТаблицаШапка.Курс
			|			КОНЕЦ) * ВременнаяТаблицаШапка.Курс)
			|	КОНЕЦ КАК Сумма,
			|	0 КАК Поле3,
			|	0 КАК Поле9
			|ИЗ
			|	ВременнаяТаблицаРасшифровкаПлатежа КАК ВременнаяТаблицаРасшифровкаПлатежа
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
			|		ПО ВременнаяТаблицаРасшифровкаПлатежа.Ссылка = ВременнаяТаблицаШапка.Ссылка
			|ГДЕ
			|	НЕ (ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов - ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВЫБОР
			|				КОГДА ВременнаяТаблицаШапка.КурсДоговора > ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов
			|					ТОГДА ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.КурсДоговора
			|				ИНАЧЕ ВременнаяТаблицаШапка.КурсДоговора / ВременнаяТаблицаШапка.Курс
			|			КОНЕЦ) * ВременнаяТаблицаШапка.Курс = 0
			|	И НЕ ВременнаяТаблицаШапка.ВалютаДоговора = ВременнаяТаблицаШапка.БанковскийСчет.ВалютаДенежныхСредств
			|	И НЕ ВременнаяТаблицаШапка.КурсДоговора = ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов";
		Иначе
			ТекстОКР = 
			"ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаШапка.Курс - ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов * ВременнаяТаблицаШапка.КурсДоговора < 0
			|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УбыткиОтКурсовыхРазницПоОперациямВИностраннойВалюте)
			|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.СчетУчета
			|	КОНЕЦ КАК СчетДт,
			|	ВЫБОР
			|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаШапка.Курс - ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов * ВременнаяТаблицаШапка.КурсДоговора < 0
			|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СчетУчета
			|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходОтКурсовыхРазницПоОперациямВИностраннойВалюте)
			|	КОНЕЦ КАК СчетКт,
			|	ВЫБОР
			|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаШапка.Курс - ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов * ВременнаяТаблицаШапка.КурсДоговора < 0
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.КурсовыеРазницы)
			|		ИНАЧЕ ВременнаяТаблицаШапка.Контрагент
			|	КОНЕЦ КАК СубконтоДт1,
			|	ВЫБОР
			|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаШапка.Курс - ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов * ВременнаяТаблицаШапка.КурсДоговора < 0
			|			ТОГДА НЕОПРЕДЕЛЕНО
			|		ИНАЧЕ ВременнаяТаблицаРасшифровкаПлатежа.ДоговорКонтрагента
			|	КОНЕЦ КАК СубконтоДт2,
			|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
			|	ВЫБОР
			|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаШапка.Курс - ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов * ВременнаяТаблицаШапка.КурсДоговора < 0
			|			ТОГДА ВременнаяТаблицаШапка.Контрагент
			|		ИНАЧЕ НЕОПРЕДЕЛЕНО
			|	КОНЕЦ КАК СубконтоКт1,
			|	ВЫБОР
			|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаШапка.Курс - ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов * ВременнаяТаблицаШапка.КурсДоговора < 0
			|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.ДоговорКонтрагента
			|		ИНАЧЕ НЕОПРЕДЕЛЕНО
			|	КОНЕЦ КАК СубконтоКт2,
			|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
			|	&ВалютаРегламентированногоУчета КАК Поле5,
			|	ВременнаяТаблицаШапка.ВалютаДоговора КАК Поле6,
			|	0 КАК ВалютнаяСуммаДт,
			|	0 КАК ВалютнаяСуммаКт,
			|	ВременнаяТаблицаШапка.Дата,
			|	ВременнаяТаблицаШапка.Организация,
			|	ВременнаяТаблицаШапка.СодержаниеОКР КАК Содержание,
			|	ВЫБОР
			|		КОГДА ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаШапка.Курс - ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов * ВременнаяТаблицаШапка.КурсДоговора > 0
			|			ТОГДА ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаШапка.Курс - ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов * ВременнаяТаблицаШапка.КурсДоговора
			|		ИНАЧЕ -(ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаШапка.Курс - ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов * ВременнаяТаблицаШапка.КурсДоговора)
			|	КОНЕЦ КАК Сумма,
			|	0 КАК Поле3,
			|	0 КАК Поле9
			|ИЗ
			|	ВременнаяТаблицаРасшифровкаПлатежа КАК ВременнаяТаблицаРасшифровкаПлатежа
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
			|		ПО ВременнаяТаблицаРасшифровкаПлатежа.Ссылка = ВременнаяТаблицаШапка.Ссылка
			|ГДЕ
			|	НЕ ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаШапка.Курс - ВременнаяТаблицаРасшифровкаПлатежа.СуммаВзаиморасчетов * ВременнаяТаблицаШапка.КурсДоговора = 0
			|	И НЕ ВременнаяТаблицаШапка.ВалютаДоговора = ВременнаяТаблицаШапка.БанковскийСчет.ВалютаДенежныхСредств
			|	И НЕ ВременнаяТаблицаШапка.КурсДоговора = ВременнаяТаблицаРасшифровкаПлатежа.КурсВзаиморасчетов";
			
		КонецЕсли;
		ТекстОКР = 
		"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|"
		+ ТекстОКР;	
		
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + ТекстОКР;	
	
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
		
	РезультатЗапроса = Запрос.Выполнить();	
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаХозрасчетный", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаДенежныеСредства()

// Формирует таблицу значений, содержащую данные для проведения по регистру накопления ДвиженияДенежныхСредств.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДДС(СтруктураДополнительныеСвойства)
	
	ВалютаРегламентированногоУчета = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств КАК Статья,
		|	ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа * ВременнаяТаблицаШапка.Курс КАК Сумма,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаШапка.Дата КАК Период
		|ИЗ
		|	ВременнаяТаблицаРасшифровкаПлатежа КАК ВременнаяТаблицаРасшифровкаПлатежа
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО ВременнаяТаблицаРасшифровкаПлатежа.Ссылка = ВременнаяТаблицаШапка.Ссылка
		|ГДЕ
		|	НЕ ВременнаяТаблицаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
		|	И (ВременнаяТаблицаШапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППВ.ОплатаОтПокупателя)
		|			ИЛИ ВременнаяТаблицаШапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППВ.ВозвратОтПоставщика)
		|			ИЛИ ВременнаяТаблицаШапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППВ.РасчетыПоЗаймам))
		|	И ВременнаяТаблицаРасшифровкаПлатежа.СуммаПлатежа <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаПрочиеПриходы.СтатьяДвиженияДенежныхСредств,
		|	ВременнаяТаблицаПрочиеПриходы.СуммаПлатежа,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаШапка.Дата
		|ИЗ
		|	ВременнаяТаблицаПрочиеПриходы КАК ВременнаяТаблицаПрочиеПриходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО ВременнаяТаблицаПрочиеПриходы.Ссылка = ВременнаяТаблицаШапка.Ссылка
		|ГДЕ
		|	НЕ ВременнаяТаблицаПрочиеПриходы.СтатьяДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
		|	И ВременнаяТаблицаШапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПКО.ПрочийПриход)
		|	И ВременнаяТаблицаПрочиеПриходы.СуммаПлатежа <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.СтатьяДвиженияДенежныхСредств,
		|	ВременнаяТаблицаШапка.СуммаДокумента * ВременнаяТаблицаШапка.Курс,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаШапка.Дата
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|ГДЕ
		|	НЕ ВременнаяТаблицаШапка.СтатьяДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
		|	И ВременнаяТаблицаШапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППВ.ВозвратОтСорудника)
		|	И ВременнаяТаблицаШапка.СуммаДокумента <> 0";
			
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
		
	РезультатЗапроса = Запрос.Выполнить();	
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДДС", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру накопления ВозвратДенежныхСредствПодотчетником.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаОтразитьВозвратПодотчетником(СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	ВременнаяТаблицаШапка.СуммаДокумента КАК Сумма,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаШапка.ФизЛицо КАК ФизЛицо
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|ГДЕ
		|	ВременнаяТаблицаШапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППВ.ВозвратОтСорудника)";	
		
		
	РезультатЗапроса = Запрос.Выполнить();	
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОтразитьВозвратПодотчетником", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	
		"ВЫБРАТЬ
		|	ПлатежноеПоручениеВходящее.Ссылка,
		|	ПлатежноеПоручениеВходящее.ВерсияДанных,
		|	ПлатежноеПоручениеВходящее.ПометкаУдаления,
		|	ПлатежноеПоручениеВходящее.Номер,
		|	ПлатежноеПоручениеВходящее.Дата,
		|	ПлатежноеПоручениеВходящее.Проведен,
		|	ПлатежноеПоручениеВходящее.Организация,
		|	ПлатежноеПоручениеВходящее.ВидОперации,
		|	ПлатежноеПоручениеВходящее.БанковскийСчет,
		|	ПлатежноеПоручениеВходящее.СтатьяДвиженияДенежныхСредств,
		|	ПлатежноеПоручениеВходящее.Контрагент,
		|	ПлатежноеПоручениеВходящее.СчетУчета,
		|	ПлатежноеПоручениеВходящее.БанковскийСчетПлательщика,
		|	ПлатежноеПоручениеВходящее.ФизЛицо,
		|	ПлатежноеПоручениеВходящее.ВалютаДенежныхСредств,
		|	ПлатежноеПоручениеВходящее.Курс,
		|	ПлатежноеПоручениеВходящее.ВалютаДоговора,
		|	ПлатежноеПоручениеВходящее.КурсДоговора,
		|	ПлатежноеПоручениеВходящее.НазначениеПлатежа,
		|	ПлатежноеПоручениеВходящее.ДокументОснование,
		|	ПлатежноеПоручениеВходящее.СуммаДокумента,
		|	ПлатежноеПоручениеВходящее.Комментарий,
		|	ПлатежноеПоручениеВходящее.Автор,
		|	&СодержаниеОКР КАК СодержаниеОКР,
		|	&СчетКР КАК СчетКР
		|ПОМЕСТИТЬ ВременнаяТаблицаШапка
		|ИЗ
		|	Документ.ПлатежноеПоручениеВходящее КАК ПлатежноеПоручениеВходящее
		|ГДЕ
		|	ПлатежноеПоручениеВходящее.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка,
		|	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.НомерСтроки,
		|	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.ДоговорКонтрагента,
		|	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств,
		|	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.СчетУчета,
		|	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.СуммаПлатежа,
		|	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.КурсВзаиморасчетов,
		|	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Комментарий,
		|	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.СуммаВзаиморасчетов,
		|	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.КурсНБКР
		|ПОМЕСТИТЬ ВременнаяТаблицаРасшифровкаПлатежа
		|ИЗ
		|	Документ.ПлатежноеПоручениеВходящее.РасшифровкаПлатежа КАК ПлатежноеПоручениеВходящееРасшифровкаПлатежа
		|ГДЕ
		|	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПлатежноеПоручениеВходящееПрочиеПриходы.Ссылка,
		|	ПлатежноеПоручениеВходящееПрочиеПриходы.НомерСтроки,
		|	ПлатежноеПоручениеВходящееПрочиеПриходы.СчетУчета,
		|	ПлатежноеПоручениеВходящееПрочиеПриходы.СтатьяДвиженияДенежныхСредств,
		|	ПлатежноеПоручениеВходящееПрочиеПриходы.СуммаПлатежа,
		|	ПлатежноеПоручениеВходящееПрочиеПриходы.Субконто1,
		|	ПлатежноеПоручениеВходящееПрочиеПриходы.Субконто2,
		|	ПлатежноеПоручениеВходящееПрочиеПриходы.Субконто3
		|ПОМЕСТИТЬ ВременнаяТаблицаПрочиеПриходы
		|ИЗ
		|	Документ.ПлатежноеПоручениеВходящее.ПрочиеПриходы КАК ПлатежноеПоручениеВходящееПрочиеПриходы
		|ГДЕ
		|	ПлатежноеПоручениеВходящееПрочиеПриходы.Ссылка = &Ссылка";				
		
	Запрос.УстановитьПараметр("Ссылка", 		ДокументСсылка);	
	Запрос.УстановитьПараметр("СчетКР", 		ПланыСчетов.Хозрасчетный.ДоходыОтОперационныхКурсовыхРазниц);
	Запрос.УстановитьПараметр("СодержаниеОКР", 	?(ДокументСсылка.РасшифровкаПлатежа.Количество() > 0, "ОКР. Курс НБКР = " + ДокументСсылка.РасшифровкаПлатежа[0].КурсНБКР, ""));	
	
	Запрос.Выполнить();
	
	СформироватьТаблицаХозрасчетный(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДДС(СтруктураДополнительныеСвойства);
	СформироватьТаблицаОтразитьВозвратПодотчетником(СтруктураДополнительныеСвойства);

КонецПроцедуры // ИнициализироватьДанныеДокумента()

#КонецОбласти

#Область ВерсионированиеОбъектов

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#КонецЕсли
