#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДняПриИзменении(Элемент)

	Если Запись.ВидДня = ПредопределенноеЗначение("Перечисление.ВидыДнейПроизводственногоКалендаря.Праздник")
		Или Запись.ВидДня = ПредопределенноеЗначение("Перечисление.ВидыДнейПроизводственногоКалендаря.Выходной")
		Или Запись.ВидДня = ПредопределенноеЗначение("Перечисление.ВидыДнейПроизводственногоКалендаря.Нерабочий") Тогда 
		
		Запись.ЗначениеДней = 0;
		Запись.ЗначениеЧасов = 0;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

