#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		
#Область ОбработчикиСобытий

// Процедура - обработчик события ОбработкаЗаполнения объекта.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеОбъектовБП.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения);

	Если Не ЗначениеЗаполнено(ДатаНачала) Тогда 
		ДатаНачала 	 = НачалоКвартала(Дата);
		ДатаОкончания = КонецКвартала(Дата);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура заполняет табличную часть
//
Процедура ЗаполнитьТабличнуюЧастьОтчет() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодоходныйНалогОбороты.ФизЛицо КАК ФизЛицо,
		|	ПодоходныйНалогОбороты.ОДПНОборот КАК ОДПН,
		|	ПодоходныйНалогОбороты.ПНОборот КАК СуммаПН
		|ПОМЕСТИТЬ ВременнаяТаблицаПН
		|ИЗ
		|	РегистрНакопления.ПодоходныйНалог.Обороты(&НачалоПериода, &КонецПериода, , Организация = &Организация) КАК ПодоходныйНалогОбороты
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ФизЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ГражданствоФизическихЛицСрезПоследних.ФизЛицо КАК Физлицо,
		|	ГражданствоФизическихЛицСрезПоследних.Страна КАК Страна
		|ПОМЕСТИТЬ ВременнаяТаблицаГражданство
		|ИЗ
		|	РегистрСведений.ГражданствоФизическихЛиц.СрезПоследних(
		|			&КонецПериода,
		|			Физлицо В
		|				(ВЫБРАТЬ
		|					ВременнаяТаблицаПН.ФизЛицо
		|				ИЗ
		|					ВременнаяТаблицаПН КАК ВременнаяТаблицаПН)) КАК ГражданствоФизическихЛицСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаПН.ФизЛицо КАК Физлицо,
		|	ВременнаяТаблицаПН.ОДПН КАК ОДПН,
		|	ВременнаяТаблицаПН.СуммаПН КАК СуммаПН,
		|	ЕСТЬNULL(ВременнаяТаблицаГражданство.Страна.Код, """") КАК КодСтраны,
		|	ВременнаяТаблицаПН.ФизЛицо.ИНН КАК НомерНалоговойРегистрации
		|ИЗ
		|	ВременнаяТаблицаПН КАК ВременнаяТаблицаПН
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаГражданство КАК ВременнаяТаблицаГражданство
		|		ПО ВременнаяТаблицаПН.ФизЛицо = ВременнаяТаблицаГражданство.Физлицо";
	
	Запрос.УстановитьПараметр("НачалоПериода", ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ДатаОкончания));
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Отчет.Загрузить(Запрос.Выполнить().Выгрузить());
			
КонецПроцедуры // ЗаполнитьТабличнуюЧастьОтчет()

// Процедура заполняет табличную часть
//
Процедура ЗаполнитьТабличнуюЧастьОтчетГодовой() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодоходныйНалогОбороты.ФизЛицо КАК Физлицо,
		|	ПодоходныйНалогОбороты.ОДПНОборот КАК ОДПН,
		|	ПодоходныйНалогОбороты.ПНОборот КАК СуммаПН,
		|	ПодоходныйНалогОбороты.ФизЛицо.ИНН КАК ИНН,
		|	""001"" КАК КодДохода
		|ПОМЕСТИТЬ ВременнаяТаблицаПН
		|ИЗ
		|	РегистрНакопления.ПодоходныйНалог.Обороты(&НачалоПериода, &КонецПериода, , Организация = &Организация) КАК ПодоходныйНалогОбороты
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Физлицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаПН.Физлицо КАК Физлицо,
		|	ВременнаяТаблицаПН.ОДПН КАК ОДПН,
		|	ВременнаяТаблицаПН.СуммаПН КАК СуммаПН,
		|	ВременнаяТаблицаПН.ИНН КАК ИНН,
		|	ВременнаяТаблицаПН.КодДохода КАК КодДохода,
		|	0 КАК СуммаМатериальнойВыгоды,
		|	0 КАК СуммаПНСМатериальнойВыгоды
		|ИЗ
		|	ВременнаяТаблицаПН КАК ВременнаяТаблицаПН";
			
	Запрос.УстановитьПараметр("НачалоПериода", ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ДатаОкончания));
	Запрос.УстановитьПараметр("Организация", Организация);
	
	ОтчетГодовой.Загрузить(Запрос.Выполнить().Выгрузить());
		
КонецПроцедуры // ЗаполнитьТабличнуюЧастьОтчетГодовой()

#КонецОбласти

#КонецЕсли