#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Процедура - Заполнить по умолчанию
// Выполняет первоночальное заполнение
Процедура ЗаполнитьПоУмолчанию() Экспорт 
	СправочникМенеджер = Справочники.ОтраслевыеКоэффициентыНалогаНаИмущество;
	
	КлассификаторXML = СправочникМенеджер.ПолучитьМакет("Классификатор").ПолучитьТекст();
	КлассификаторТаблица = ОбщегоНазначения.ПрочитатьXMLВТаблицу(КлассификаторXML).Данные;     
	
	ПериодНабораЗаписей = НачалоГода(ТекущаяДатаСеанса()); 
	НаборЗаписей = РегистрыСведений.КоэфицентыНалогаНаИмущество.СоздатьНаборЗаписей(); 
	
	Для Каждого СтрокаТаблицыЗначений Из КлассификаторТаблица Цикл
		Наименование = СокрЛП(СтрокаТаблицыЗначений.Name);
		Коэффициент = СтрокаТаблицыЗначений.Коэффициент; 
		
		СправочникСсылка = СправочникМенеджер.НайтиПоНаименованию(Наименование, Истина);
		
		Если СправочникСсылка.Пустая() Тогда
			СправочникСсылка = СправочникМенеджер.ПолучитьСсылку(Новый УникальныйИдентификатор);
			
			СправочникОбъект = СправочникМенеджер.СоздатьЭлемент();
			СправочникОбъект.УстановитьСсылкуНового(СправочникСсылка);
		Иначе
			СправочникОбъект = СправочникСсылка.ПолучитьОбъект();
		КонецЕсли;	
		
		СправочникОбъект.Наименование = Наименование;
		СправочникОбъект.Коэффициент = Коэффициент;
		
		БухгалтерскийУчетКлиентСервер.ЗаписатьСправочникОбъект(СправочникОбъект);
		
		// Записи в РС КоэфицентыНалогаНаИмущество
		НаборЗаписей.Отбор.Период.Установить(ПериодНабораЗаписей);
		НаборЗаписей.Отбор.Классификация.Установить(СправочникСсылка);
		НаборЗаписей.Прочитать();		
		НаборЗаписей.Очистить(); 

		ЗаписьНабораЗаписей = НаборЗаписей.Добавить();
		ЗаписьНабораЗаписей.Период = ПериодНабораЗаписей;
		ЗаписьНабораЗаписей.Классификация = СправочникСсылка;
		ЗаписьНабораЗаписей.Коэфициент = Коэффициент;
		
		Попытка
			НаборЗаписей.Записать();
		Исключение
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры // ЗаполнитьПоУмолчанию()	

#КонецОбласти
	
#КонецЕсли


