#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Процедура - Заполнить по умолчанию
// Выполняет первоночальное заполнение
Процедура ЗаполнитьПоУмолчанию() Экспорт 
	КлассификаторXML = РегистрыСведений.НормыБольничныхЛистов.ПолучитьМакет("МакетЗаполнения").ПолучитьТекст();
	КлассификаторТаблица = ОбщегоНазначения.ПрочитатьXMLВТаблицу(КлассификаторXML).Данные;
	
	НаборЗаписей = РегистрыСведений.НормыБольничныхЛистов.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();                 
	
	Для Каждого СтрокаТаблицыЗначений Из КлассификаторТаблица Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.НижняяГраница = Число(СокрЛП(СтрокаТаблицыЗначений.НижняяГраница));
		НоваяЗапись.ДнейОрганизации = Число(СокрЛП(СтрокаТаблицыЗначений.ДнейОрганизации));
		НоваяЗапись.Процент = Число(СокрЛП(СтрокаТаблицыЗначений.Процент));
		НоваяЗапись.ПроцентБеременность = Число(СокрЛП(СтрокаТаблицыЗначений.ПроцентБеременность));
		НоваяЗапись.РазмерЗаСчетСФ = Число(СокрЛП(СтрокаТаблицыЗначений.РазмерЗаСчетСФ));
		НоваяЗапись.РазмерБеременностьЗаСчетСФ = Число(СокрЛП(СтрокаТаблицыЗначений.РазмерБеременностьЗаСчетСФ));
	КонецЦикла;
	
	Попытка
		НаборЗаписей.Записать();
	Исключение
	КонецПопытки;
КонецПроцедуры // ЗаполнитьПоУмолчанию()	

#КонецОбласти

#КонецЕсли