#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ)
		
	Если Не ОбщегоНазначения.СсылкаСуществует(Ссылка) И Не ДополнительныеСвойства.Свойство("ПодборИзКлассификатора") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Добавление языка доступно только подбором из классификатора.'"), , , , Отказ);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры
	
#КонецЕсли