#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

// Заполняет данные БИК покупателя.
Процедура  ЗаполнитьДанныеБИКПокупателя(БанкСсылкаПок, ОбластьМакета) Экспорт

	ДанныеБИКПок = Новый Структура("БИКПок1, БИКПок2, БИКПок3, БИКПок4, БИКПок5, БИКПок6, БИКПок7, БИКПок8, БИКПок9, БанкПок", "0","0","0","0","0","0","","","", "Отсуствует");
	
	БИКПок = БанкСсылкаПок.Банк.Код;
	Если ЗначениеЗаполнено(БанкСсылкаПок) Тогда 
		ДанныеБИКПок.БИКПок1 = Сред(БИКПок,1,1);		
		ДанныеБИКПок.БИКПок2 = Сред(БИКПок,2,1);		
		ДанныеБИКПок.БИКПок3 = Сред(БИКПок,3,1);		
		ДанныеБИКПок.БИКПок4 = Сред(БИКПок,4,1);		
		ДанныеБИКПок.БИКПок5 = Сред(БИКПок,5,1);		
		ДанныеБИКПок.БИКПок6 = Сред(БИКПок,6,1);		
		ДанныеБИКПок.БИКПок7 = Сред(БИКПок,7,1);		
		ДанныеБИКПок.БИКПок8 = Сред(БИКПок,8,1);		
		ДанныеБИКПок.БИКПок9 = Сред(БИКПок,9,1);
		ДанныеБИКПок.БанкПок = БанкСсылкаПок.Банк.Наименование;
	КонецЕсли;
	
	ОбластьМакета.Параметры.Заполнить(ДанныеБИКПок);	
КонецПроцедуры 
#КонецОбласти

#Область ПроцедурыПроведенияДокумента

Процедура СформироватьТаблицаХозрасчетный(ДокументСсылка,СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
		ТекстПерваяЧасть =
			"ВЫБРАТЬ
			|	ВременнаяТаблицаШапка.СчетРасчетов КАК СчетДт,
			|	ВременнаяТаблицаОбщиеСуммыДоходы.СчетДохода КАК СчетКт,
			|	ВременнаяТаблицаШапка.Контрагент КАК СубконтоДт1,
			|	ВременнаяТаблицаШапка.ДоговорКонтрагента КАК СубконтоДт2,
			|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
			|	ВременнаяТаблицаОбщиеСуммыДоходы.СубконтоДоходов КАК СубконтоКт1,
			|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
			|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
			|	ВременнаяТаблицаШапка.Период КАК Период,
			|	ВременнаяТаблицаШапка.Организация,
			|	""Реализация ТМЗ - доходы"" КАК Содержание,
			|	ВЫБОР
			|		КОГДА ВременнаяТаблицаШапка.КонтрСчетУчетаСкидок = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
			|			ТОГДА ВременнаяТаблицаОбщиеСуммыДоходы.ДоходСоСкидкой * ВременнаяТаблицаШапка.Курс
			|		ИНАЧЕ ВременнаяТаблицаОбщиеСуммыДоходы.Доход * ВременнаяТаблицаШапка.Курс
			|	КОНЕЦ КАК Сумма,
			|	ВременнаяТаблицаШапка.ВалютаДокумента КАК ВалютаДт,
			|	ВременнаяТаблицаШапка.ВалютаДокумента КАК ВалютаКт,
			|	ВЫБОР
			|		КОГДА ВременнаяТаблицаШапка.КонтрСчетУчетаСкидок = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
			|			ТОГДА ВременнаяТаблицаОбщиеСуммыДоходы.ДоходСоСкидкой
			|		ИНАЧЕ ВременнаяТаблицаОбщиеСуммыДоходы.Доход
			|	КОНЕЦ КАК ВалютнаяСуммаДт,
			|	ВЫБОР
			|		КОГДА ВременнаяТаблицаШапка.КонтрСчетУчетаСкидок = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
			|			ТОГДА ВременнаяТаблицаОбщиеСуммыДоходы.ДоходСоСкидкой
			|		ИНАЧЕ ВременнаяТаблицаОбщиеСуммыДоходы.Доход
			|	КОНЕЦ КАК ВалютнаяСуммаКт,
			|	0 КАК КоличествоДт,
			|	0 КАК КоличествоКт
			|ПОМЕСТИТЬ ВременнаяТаблицаХозрасчетныйПерваяЧасть
			|ИЗ
			|	ВременнаяТаблицаОбщиеСуммыДоходы КАК ВременнаяТаблицаОбщиеСуммыДоходы
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
			|		ПО (ИСТИНА)
			|ГДЕ
			|	ВременнаяТаблицаОбщиеСуммыДоходы.Доход <> 0
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВременнаяТаблицаШапка.КонтрСчетУчетаСкидок,
			|	ВременнаяТаблицаШапка.СчетРасчетов,
			|	ВременнаяТаблицаОбщиеСуммыДоходы.СубконтоДоходов,
			|	НЕОПРЕДЕЛЕНО,
			|	НЕОПРЕДЕЛЕНО,
			|	ВременнаяТаблицаШапка.Контрагент,
			|	ВременнаяТаблицаШапка.ДоговорКонтрагента,
			|	НЕОПРЕДЕЛЕНО,
			|	ВременнаяТаблицаШапка.Период,
			|	ВременнаяТаблицаШапка.Организация,
			|	""Реализация ТМЗ - скидка"",
			|	ВременнаяТаблицаОбщиеСуммыДоходы.СуммаСкидки * ВременнаяТаблицаШапка.Курс,
			|	ВременнаяТаблицаШапка.ВалютаДокумента,
			|	ВременнаяТаблицаШапка.ВалютаДокумента,
			|	ВременнаяТаблицаОбщиеСуммыДоходы.СуммаСкидки,
			|	ВременнаяТаблицаОбщиеСуммыДоходы.СуммаСкидки,
			|	НЕОПРЕДЕЛЕНО,
			|	НЕОПРЕДЕЛЕНО
			|ИЗ
			|	ВременнаяТаблицаОбщиеСуммыДоходы КАК ВременнаяТаблицаОбщиеСуммыДоходы
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
			|		ПО (ИСТИНА)
			|ГДЕ
			|	ВременнаяТаблицаОбщиеСуммыДоходы.СуммаСкидки <> 0
			|	И ВременнаяТаблицаШапка.КонтрСчетУчетаСкидок <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВременнаяТаблицаШапка.СчетРасчетов,
			|	ВременнаяТаблицаШапка.СчетУчетаНДС,
			|	ВременнаяТаблицаШапка.Контрагент,
			|	ВременнаяТаблицаШапка.ДоговорКонтрагента,
			|	НЕОПРЕДЕЛЕНО,
			|	НЕОПРЕДЕЛЕНО,
			|	НЕОПРЕДЕЛЕНО,
			|	НЕОПРЕДЕЛЕНО,
			|	ВременнаяТаблицаШапка.Период,
			|	ВременнаяТаблицаШапка.Организация,
			|	""НДС из реализации ТМЗ"",
			|	ВЫБОР
			|		КОГДА ВременнаяТаблицаШапка.ПлательщикНДС
			|			ТОГДА ВременнаяТаблицаОбщиеСуммыДоходы.СуммаНДССоСкидкой * ВременнаяТаблицаШапка.Курс
			|		ИНАЧЕ 0
			|	КОНЕЦ,
			|	ВременнаяТаблицаШапка.ВалютаДокумента,
			|	ВременнаяТаблицаШапка.ВалютаДокумента,
			|	ВЫБОР
			|		КОГДА ВременнаяТаблицаШапка.ПлательщикНДС
			|			ТОГДА ВременнаяТаблицаОбщиеСуммыДоходы.СуммаНДССоСкидкой
			|		ИНАЧЕ 0
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ВременнаяТаблицаШапка.ПлательщикНДС
			|			ТОГДА ВременнаяТаблицаОбщиеСуммыДоходы.СуммаНДССоСкидкой
			|		ИНАЧЕ 0
			|	КОНЕЦ,
			|	НЕОПРЕДЕЛЕНО,
			|	НЕОПРЕДЕЛЕНО
			|ИЗ
			|	ВременнаяТаблицаОбщиеСуммыДоходы КАК ВременнаяТаблицаОбщиеСуммыДоходы
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
			|		ПО (ИСТИНА)
			|ГДЕ
			|	ВременнаяТаблицаОбщиеСуммыДоходы.СуммаНДССоСкидкой <> 0
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВременнаяТаблицаШапка.СчетРасчетов,
			|	ВременнаяТаблицаШапка.СчетУчетаНСП,
			|	ВременнаяТаблицаШапка.Контрагент,
			|	ВременнаяТаблицаШапка.ДоговорКонтрагента,
			|	НЕОПРЕДЕЛЕНО,
			|	НЕОПРЕДЕЛЕНО,
			|	НЕОПРЕДЕЛЕНО,
			|	НЕОПРЕДЕЛЕНО,
			|	ВременнаяТаблицаШапка.Период,
			|	ВременнаяТаблицаШапка.Организация,
			|	""НСП из реализация ТМЗ"",
			|	ВЫБОР
			|		КОГДА ВременнаяТаблицаШапка.ПлательщикНСП
			|			ТОГДА ВременнаяТаблицаОбщиеСуммыДоходы.СуммаНСПСоСкидкой * ВременнаяТаблицаШапка.Курс
			|		ИНАЧЕ 0
			|	КОНЕЦ,
			|	ВременнаяТаблицаШапка.ВалютаДокумента,
			|	ВременнаяТаблицаШапка.ВалютаДокумента,
			|	ВЫБОР
			|		КОГДА ВременнаяТаблицаШапка.ПлательщикНСП
			|			ТОГДА ВременнаяТаблицаОбщиеСуммыДоходы.СуммаНСПСоСкидкой
			|		ИНАЧЕ 0
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ВременнаяТаблицаШапка.ПлательщикНСП
			|			ТОГДА ВременнаяТаблицаОбщиеСуммыДоходы.СуммаНСПСоСкидкой
			|		ИНАЧЕ 0
			|	КОНЕЦ,
			|	НЕОПРЕДЕЛЕНО,
			|	НЕОПРЕДЕЛЕНО
			|ИЗ
			|	ВременнаяТаблицаОбщиеСуммыДоходы КАК ВременнаяТаблицаОбщиеСуммыДоходы
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
			|		ПО (ИСТИНА)
			|ГДЕ
			|	ВременнаяТаблицаОбщиеСуммыДоходы.СуммаНСПСоСкидкой <> 0";
					
		
		Запрос.Текст =
			ТекстПерваяЧасть
			+ "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|"
			+
			"ВЫБРАТЬ
			|	ВременнаяТаблицаТоварыСГруппировкой.СчетСебестоимости,
			|	ВременнаяТаблицаТоварыСГруппировкой.СчетУчета,
			|	ВременнаяТаблицаТоварыСГруппировкой.СубконтоСписанияСебестоимости1,
			|	НЕОПРЕДЕЛЕНО КАК Поле1,
			|	НЕОПРЕДЕЛЕНО КАК Поле2,
			|	ВременнаяТаблицаТоварыСГруппировкой.Номенклатура,
			|	ВременнаяТаблицаШапка.СкладРасход,
			|	ВЫБОР
			|		КОГДА ВременнаяТаблицаТоварыСГруппировкой.предСтатус = ЗНАЧЕНИЕ(Перечисление.СтатусыМБП.ПустаяСсылка)
			|			ТОГДА НЕОПРЕДЕЛЕНО
			|		ИНАЧЕ ВременнаяТаблицаТоварыСГруппировкой.предСтатус
			|	КОНЕЦ КАК Поле3,
			|	ВременнаяТаблицаШапка.Период,
			|	ВременнаяТаблицаШапка.Организация,
			|	""Реализация ТМЗ - списание себестоимости"" КАК Поле4,
			|	ВременнаяТаблицаТоварыСГруппировкой.Себестоимость * ВременнаяТаблицаТоварыСГруппировкой.Количество * ВременнаяТаблицаШапка.Курс КАК Поле5,
			|	ВременнаяТаблицаШапка.ВалютаДокумента,
			|	ВременнаяТаблицаШапка.ВалютаДокумента КАК ВалютаДокумента1,
			|	ВременнаяТаблицаТоварыСГруппировкой.Себестоимость * ВременнаяТаблицаТоварыСГруппировкой.Количество КАК Поле6,
			|	ВременнаяТаблицаТоварыСГруппировкой.Себестоимость * ВременнаяТаблицаТоварыСГруппировкой.Количество КАК Поле7,
			|	ВременнаяТаблицаТоварыСГруппировкой.Количество,
			|	ВременнаяТаблицаТоварыСГруппировкой.Количество КАК Количество1
			|ИЗ
			|	ВременнаяТаблицаТоварыСГруппировкой КАК ВременнаяТаблицаТоварыСГруппировкой
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
			|		ПО ВременнаяТаблицаТоварыСГруппировкой.Ссылка = ВременнаяТаблицаШапка.Ссылка,
			|	РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних(
			|			&Дата,
			|			Организация В
			|				(ВЫБРАТЬ
			|					ВременнаяТаблицаШапка.Организация
			|				ИЗ
			|					ВременнаяТаблицаШапка)) КАК УчетнаяПолитикаОрганизацийСрезПоследних
			|ГДЕ
			|	ВременнаяТаблицаТоварыСГруппировкой.Себестоимость <> 0
			|	И НЕ ВременнаяТаблицаШапка.МБПЭксплуатация			
			|	И ВЫБОР
			|			КОГДА ВременнаяТаблицаТоварыСГруппировкой.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МБП)
			|				ТОГДА УчетнаяПолитикаОрганизацийСрезПоследних.ВидУчетаИзносаМБП = ЗНАЧЕНИЕ(перечисление.ВидыУчетаИзносаМБП.ПриВводе)
			|						ИЛИ ВременнаяТаблицаТоварыСГруппировкой.предСтатус = ЗНАЧЕНИЕ(перечисление.СтатусыМБП.Новый)
			|			ИНАЧЕ ЛОЖЬ
			|		КОНЕЦ
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НачисленныйИзносМБП),
			|	ВременнаяТаблицаТоварыСГруппировкой.СчетУчета,
			|	ВременнаяТаблицаТоварыСГруппировкой.Номенклатура,
			|	НЕОПРЕДЕЛЕНО,
			|	НЕОПРЕДЕЛЕНО,
			|	ВременнаяТаблицаТоварыСГруппировкой.Номенклатура,
			|	ВременнаяТаблицаШапка.СкладРасход,
			|	ВЫБОР
			|		КОГДА ВременнаяТаблицаТоварыСГруппировкой.предСтатус = ЗНАЧЕНИЕ(Перечисление.СтатусыМБП.ПустаяСсылка)
			|			ТОГДА НЕОПРЕДЕЛЕНО
			|		ИНАЧЕ ВременнаяТаблицаТоварыСГруппировкой.предСтатус
			|	КОНЕЦ,
			|	ВременнаяТаблицаШапка.Период,
			|	ВременнаяТаблицаШапка.Организация,
			|	ВЫБОР
			|		КОГДА УчетнаяПолитикаОрганизацийСрезПоследних.ВидУчетаИзносаМБП = ЗНАЧЕНИЕ(перечисление.ВидыУчетаИзносаМБП.ПриСписании)
			|			ТОГДА ""Износ МБП - 100% при списании""
			|		ИНАЧЕ ""Износ МБП - 50% при списании""
			|	КОНЕЦ,
			|	ВременнаяТаблицаТоварыСГруппировкой.Себестоимость * ВременнаяТаблицаШапка.Курс,
			|	ВременнаяТаблицаШапка.ВалютаДокумента,
			|	ВременнаяТаблицаШапка.ВалютаДокумента,
			|	ВременнаяТаблицаТоварыСГруппировкой.Себестоимость,
			|	ВременнаяТаблицаТоварыСГруппировкой.Себестоимость,
			|	ВременнаяТаблицаТоварыСГруппировкой.Количество,
			|	ВременнаяТаблицаТоварыСГруппировкой.Количество
			|ИЗ
			|	ВременнаяТаблицаТоварыСГруппировкой КАК ВременнаяТаблицаТоварыСГруппировкой
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних(
			|					&Дата,
			|					Организация В
			|						(ВЫБРАТЬ
			|							ВременнаяТаблицаШапка.Организация
			|						ИЗ
			|							ВременнаяТаблицаШапка)) КАК УчетнаяПолитикаОрганизацийСрезПоследних
			|			ПО (ИСТИНА)
			|		ПО ВременнаяТаблицаТоварыСГруппировкой.Ссылка = ВременнаяТаблицаШапка.Ссылка
			|ГДЕ
			|	ВременнаяТаблицаТоварыСГруппировкой.Себестоимость <> 0
			|	И ВЫБОР
			|			КОГДА ВременнаяТаблицаТоварыСГруппировкой.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МБП)
			|				ТОГДА (УчетнаяПолитикаОрганизацийСрезПоследних.ВидУчетаИзносаМБП = ЗНАЧЕНИЕ(перечисление.ВидыУчетаИзносаМБП.ПриСписании)
			|						ИЛИ УчетнаяПолитикаОрганизацийСрезПоследних.ВидУчетаИзносаМБП = ЗНАЧЕНИЕ(перечисление.ВидыУчетаИзносаМБП.ПоловинуПриВводе))
			|						И НЕ ВременнаяТаблицаТоварыСГруппировкой.предСтатус = ЗНАЧЕНИЕ(перечисление.СтатусыМБП.Новый)
			|			ИНАЧЕ ЛОЖЬ
			|		КОНЕЦ
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВременнаяТаблицаТоварыСГруппировкой.СчетСебестоимости,
			|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НачисленныйИзносМБП),
			|	ВременнаяТаблицаТоварыСГруппировкой.СубконтоСписанияСебестоимости1,
			|	НЕОПРЕДЕЛЕНО,
			|	НЕОПРЕДЕЛЕНО,
			|	ВременнаяТаблицаТоварыСГруппировкой.Номенклатура,
			|	ВременнаяТаблицаШапка.СкладРасход,
			|	ВЫБОР
			|		КОГДА ВременнаяТаблицаТоварыСГруппировкой.предСтатус = ЗНАЧЕНИЕ(Перечисление.СтатусыМБП.ПустаяСсылка)
			|			ТОГДА НЕОПРЕДЕЛЕНО
			|		ИНАЧЕ ВременнаяТаблицаТоварыСГруппировкой.предСтатус
			|	КОНЕЦ,
			|	ВременнаяТаблицаШапка.Период,
			|	ВременнаяТаблицаШапка.Организация,
			|	""Списан накопленный износ МБП"",
			|	ВременнаяТаблицаТоварыСГруппировкой.Себестоимость * ВременнаяТаблицаТоварыСГруппировкой.Количество * ВременнаяТаблицаШапка.Курс * ВЫБОР
			|		КОГДА УчетнаяПолитикаОрганизацийСрезПоследних.ВидУчетаИзносаМБП = ЗНАЧЕНИЕ(перечисление.ВидыУчетаИзносаМБП.ПриСписании)
			|			ТОГДА 1
			|		ИНАЧЕ 0.5
			|	КОНЕЦ,
			|	ВременнаяТаблицаШапка.ВалютаДокумента,
			|	ВременнаяТаблицаШапка.ВалютаДокумента,
			|	ВременнаяТаблицаТоварыСГруппировкой.Себестоимость * ВременнаяТаблицаТоварыСГруппировкой.Количество * ВЫБОР
			|		КОГДА УчетнаяПолитикаОрганизацийСрезПоследних.ВидУчетаИзносаМБП = ЗНАЧЕНИЕ(перечисление.ВидыУчетаИзносаМБП.ПриСписании)
			|			ТОГДА 1
			|		ИНАЧЕ 0.5
			|	КОНЕЦ,
			|	ВременнаяТаблицаТоварыСГруппировкой.Себестоимость * ВременнаяТаблицаТоварыСГруппировкой.Количество * ВЫБОР
			|		КОГДА УчетнаяПолитикаОрганизацийСрезПоследних.ВидУчетаИзносаМБП = ЗНАЧЕНИЕ(перечисление.ВидыУчетаИзносаМБП.ПриСписании)
			|			ТОГДА 1
			|		ИНАЧЕ 0.5
			|	КОНЕЦ,
			|	ВременнаяТаблицаТоварыСГруппировкой.Количество,
			|	ВременнаяТаблицаТоварыСГруппировкой.Количество
			|ИЗ
			|	ВременнаяТаблицаТоварыСГруппировкой КАК ВременнаяТаблицаТоварыСГруппировкой
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних(
			|					&Дата,
			|					Организация В
			|						(ВЫБРАТЬ
			|							ВременнаяТаблицаШапка.Организация
			|						ИЗ
			|							ВременнаяТаблицаШапка)) КАК УчетнаяПолитикаОрганизацийСрезПоследних
			|			ПО (ИСТИНА)
			|		ПО ВременнаяТаблицаТоварыСГруппировкой.Ссылка = ВременнаяТаблицаШапка.Ссылка
			|ГДЕ
			|	ВременнаяТаблицаТоварыСГруппировкой.Себестоимость <> 0
			|	И ВЫБОР
			|			КОГДА ВременнаяТаблицаТоварыСГруппировкой.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МБП)
			|				ТОГДА (УчетнаяПолитикаОрганизацийСрезПоследних.ВидУчетаИзносаМБП = ЗНАЧЕНИЕ(перечисление.ВидыУчетаИзносаМБП.ПриСписании)
			|						ИЛИ УчетнаяПолитикаОрганизацийСрезПоследних.ВидУчетаИзносаМБП = ЗНАЧЕНИЕ(перечисление.ВидыУчетаИзносаМБП.ПоловинуПриВводе))
			|						И НЕ ВременнаяТаблицаТоварыСГруппировкой.предСтатус = ЗНАЧЕНИЕ(перечисление.СтатусыМБП.Новый)
			|			ИНАЧЕ ЛОЖЬ
			|		КОНЕЦ
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВременнаяТаблицаШапка.СчетРасчетов,
			|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходыОтВыбытияОсновныхСредствИНМА),
			|	ВременнаяТаблицаШапка.Контрагент,
			|	ВременнаяТаблицаШапка.ДоговорКонтрагента,
			|	НЕОПРЕДЕЛЕНО,
			|	НЕОПРЕДЕЛЕНО,
			|	НЕОПРЕДЕЛЕНО,
			|	НЕОПРЕДЕЛЕНО,
			|	ВременнаяТаблицаШапка.Период,
			|	ВременнаяТаблицаШапка.Организация,
			|	""Реализация ТМЗ - Основные средства"",
			|	ВЫБОР
			|		КОГДА ВременнаяТаблицаОС.Сумма >= ВременнаяТаблицаОС.ОстаточнаяСтоимость
			|				И ВременнаяТаблицаОС.ОстаточнаяСтоимость <> 0
			|			ТОГДА ВременнаяТаблицаОС.ОстаточнаяСтоимость
			|		ИНАЧЕ ВременнаяТаблицаОС.Сумма
			|	КОНЕЦ * ВременнаяТаблицаШапка.Курс,
			|	ВременнаяТаблицаШапка.ВалютаДокумента,
			|	ВременнаяТаблицаШапка.ВалютаДокумента,
			|	ВременнаяТаблицаОС.Сумма,
			|	ВременнаяТаблицаОС.Сумма,
			|	НЕОПРЕДЕЛЕНО,
			|	НЕОПРЕДЕЛЕНО
			|ИЗ
			|	ВременнаяТаблицаОС КАК ВременнаяТаблицаОС
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
			|		ПО (ИСТИНА)
			|ГДЕ
			|	ВременнаяТаблицаОС.Сумма <> 0
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВременнаяТаблицаШапка.СчетРасчетов,
			|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеДоходыОтОперационнойДеятельности),
			|	ВременнаяТаблицаШапка.Контрагент,
			|	ВременнаяТаблицаШапка.ДоговорКонтрагента,
			|	НЕОПРЕДЕЛЕНО,
			|	НЕОПРЕДЕЛЕНО,
			|	НЕОПРЕДЕЛЕНО,
			|	НЕОПРЕДЕЛЕНО,
			|	ВременнаяТаблицаШапка.Период,
			|	ВременнаяТаблицаШапка.Организация,
			|	""Реализация ТМЗ - Доход от реализации ОС"",
			|	(ВременнаяТаблицаОС.Сумма - ВременнаяТаблицаОС.ОстаточнаяСтоимость) * ВременнаяТаблицаШапка.Курс,
			|	ВременнаяТаблицаШапка.ВалютаДокумента,
			|	ВременнаяТаблицаШапка.ВалютаДокумента,
			|	ВременнаяТаблицаОС.Сумма,
			|	ВременнаяТаблицаОС.Сумма,
			|	НЕОПРЕДЕЛЕНО,
			|	НЕОПРЕДЕЛЕНО
			|ИЗ
			|	ВременнаяТаблицаОС КАК ВременнаяТаблицаОС
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
			|		ПО (ИСТИНА)
			|ГДЕ
			|	ВременнаяТаблицаОС.Сумма - ВременнаяТаблицаОС.ОстаточнаяСтоимость > 0
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВременнаяТаблицаШапка.СчетРасчетов,
			|	ВременнаяТаблицаШапка.СчетУчетаНДС,
			|	ВременнаяТаблицаШапка.Контрагент,
			|	ВременнаяТаблицаШапка.ДоговорКонтрагента,
			|	ВременнаяТаблицаШапка.ВалютаДокумента,
			|	ВременнаяТаблицаШапка.ВалютаДокумента,
			|	НЕОПРЕДЕЛЕНО,
			|	НЕОПРЕДЕЛЕНО,
			|	ВременнаяТаблицаШапка.Период,
			|	ВременнаяТаблицаШапка.Организация,
			|	""НДС из реализации ОС"",
			|	ВЫБОР
			|		КОГДА ВременнаяТаблицаШапка.ПлательщикНДС
			|			ТОГДА ВременнаяТаблицаОС.СуммаНДС * ВременнаяТаблицаШапка.Курс
			|		ИНАЧЕ 0
			|	КОНЕЦ,
			|	ВременнаяТаблицаШапка.ВалютаДокумента,
			|	ВременнаяТаблицаШапка.ВалютаДокумента,
			|	ВЫБОР
			|		КОГДА ВременнаяТаблицаШапка.ПлательщикНДС
			|			ТОГДА ВременнаяТаблицаОС.СуммаНДС
			|		ИНАЧЕ 0
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ВременнаяТаблицаШапка.ПлательщикНДС
			|			ТОГДА ВременнаяТаблицаОС.СуммаНДС
			|		ИНАЧЕ 0
			|	КОНЕЦ,
			|	НЕОПРЕДЕЛЕНО,
			|	НЕОПРЕДЕЛЕНО
			|ИЗ
			|	ВременнаяТаблицаОС КАК ВременнаяТаблицаОС
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
			|		ПО (ИСТИНА)
			|ГДЕ
			|	ВременнаяТаблицаОС.СуммаНДС <> 0
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВременнаяТаблицаШапка.СчетРасчетов,
			|	ВременнаяТаблицаШапка.СчетУчетаНСП,
			|	ВременнаяТаблицаШапка.Контрагент,
			|	ВременнаяТаблицаШапка.ДоговорКонтрагента,
			|	НЕОПРЕДЕЛЕНО,
			|	НЕОПРЕДЕЛЕНО,
			|	НЕОПРЕДЕЛЕНО,
			|	НЕОПРЕДЕЛЕНО,
			|	ВременнаяТаблицаШапка.Период,
			|	ВременнаяТаблицаШапка.Организация,
			|	""НСП из реализация ОС"",
			|	ВЫБОР
			|		КОГДА ВременнаяТаблицаШапка.ПлательщикНСП
			|			ТОГДА ВременнаяТаблицаОС.СуммаНСП * ВременнаяТаблицаШапка.Курс
			|		ИНАЧЕ 0
			|	КОНЕЦ,
			|	ВременнаяТаблицаШапка.ВалютаДокумента,
			|	ВременнаяТаблицаШапка.ВалютаДокумента,
			|	ВЫБОР
			|		КОГДА ВременнаяТаблицаШапка.ПлательщикНСП
			|			ТОГДА ВременнаяТаблицаОС.СуммаНСП
			|		ИНАЧЕ 0
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА ВременнаяТаблицаШапка.ПлательщикНСП
			|			ТОГДА ВременнаяТаблицаОС.СуммаНСП
			|		ИНАЧЕ 0
			|	КОНЕЦ,
			|	НЕОПРЕДЕЛЕНО,
			|	НЕОПРЕДЕЛЕНО
			|ИЗ
			|	ВременнаяТаблицаОС КАК ВременнаяТаблицаОС
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
			|		ПО (ИСТИНА)
			|ГДЕ
			|	ВременнаяТаблицаОС.СуммаНСП <> 0";			
	Запрос.УстановитьПараметр("Дата", ДокументСсылка.Дата);
		
	РезультатЗапроса = Запрос.Выполнить();	
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаХозрасчетный", РезультатЗапроса.Выгрузить());	
		
	БухгалтерскийУчетСервер.ПолучитьПроводкиСписанияСебестоимостиПоРБХ(ДокументСсылка, СтруктураДополнительныеСвойства);
	
КонецПроцедуры // СформироватьТаблицаХозрасчетный()

Процедура СформироватьТаблицаМБПСклад(ДокументСсылка, СтруктураДополнительныеСвойства)

	Запрос = новый Запрос;    
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаШапка.Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ВременнаяТаблицаШапка.Организация КАК Организация,
	|	ВременнаяТаблицаШапка.СкладРасход КАК Склад,
	|	ВременнаяТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ВременнаяТаблицаТовары.Партия КАК Партия,
	|	ВременнаяТаблицаТовары.ИндивидуальныйНомер КАК ИнвНомер,
	|	СУММА(ВременнаяТаблицаТовары.Количество) КАК Количество,
	|	СУММА(ВременнаяТаблицаТовары.Себестоимость * ВременнаяТаблицаТовары.Количество) КАК Сумма,
	|	ВременнаяТаблицаТовары.предСтатус КАК Статус
	|ИЗ
	|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка,
	|	ВременнаяТаблицаТовары КАК ВременнаяТаблицаТовары
	|ГДЕ
	|	ВременнаяТаблицаТовары.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МБП) И НЕ ВременнаяТаблицаШапка.МБПЭксплуатация
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаШапка.Период,
	|	ВременнаяТаблицаШапка.СкладРасход,
	|	ВременнаяТаблицаТовары.Номенклатура,
	|	ВременнаяТаблицаШапка.Организация,
	|	ВременнаяТаблицаТовары.Партия,
	|	ВременнаяТаблицаТовары.ИндивидуальныйНомер,
	|	ВременнаяТаблицаТовары.предСтатус";
	РезультатЗапроса = Запрос.Выполнить();	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаМБПСклад", РезультатЗапроса.Выгрузить());


КонецПроцедуры

Процедура СформироватьТаблицаМБПЭксплуатация(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаШапка.Организация КАК Организация,
	|	ВременнаяТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ВременнаяТаблицаТовары.Партия КАК Партия,
	|	ВременнаяТаблицаТовары.Количество КАК Количество,
	|	ВременнаяТаблицаТовары.Доход КАК Сумма,
	|	ВременнаяТаблицаШапка.Период КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ВременнаяТаблицаТовары.Сотрудник КАК МОЛ,
	|	ВременнаяТаблицаТовары.ИндивидуальныйНомер КАК ИнвНомер,
	|	ВременнаяТаблицаТовары.предСтатус КАК Статус,
	|	ВременнаяТаблицаТовары.ДатаВыдачи КАК ДатаВыдачи
	|ИЗ
	|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаТовары КАК ВременнаяТаблицаТовары
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ВременнаяТаблицаШапка.МБПЭксплуатация";
		
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаМБПЭксплуатация", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

Процедура СформироватьТаблицаЗапасы(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	БухгалтерскийУчетСервер.СформироватьТаблицаЗапасыСписание(ДокументСсылка, СтруктураДополнительныеСвойства, Ложь);
			
КонецПроцедуры

Процедура СформироватьТаблицаРеализация(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.Период КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаШапка.Контрагент КАК Контрагент,
		|	ВременнаяТаблицаШапка.ДоговорКонтрагента КАК Договор,
		|	ВременнаяТаблицаТовары.СтавкаНДС КАК СтавкаНДС,
		|	ВременнаяТаблицаТовары.СтавкаНСП КАК СтавкаНСП,
		|	ВременнаяТаблицаТовары.Номенклатура КАК Номенклатура,
		|	ВременнаяТаблицаТовары.ДоходСоСкидкой КАК Доход,
		|	ВременнаяТаблицаТовары.СуммаНДССоСкидкой КАК СуммаНДС,
		|	ВременнаяТаблицаТовары.СуммаНСПСоСкидкой КАК СуммаНСП,
		|	ВременнаяТаблицаТовары.СуммаСкидки КАК СуммаСкидки,
		|	ВременнаяТаблицаТовары.Себестоимость КАК Себестоимость,
		|	ВременнаяТаблицаТовары.Количество КАК Количество,
		|	ВременнаяТаблицаШапка.Ссылка КАК ДокументРеализации
		|ИЗ
		|	ВременнаяТаблицаТовары КАК ВременнаяТаблицаТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО ВременнаяТаблицаТовары.Ссылка = ВременнаяТаблицаШапка.Ссылка
		|ГДЕ
		|	ВременнаяТаблицаТовары.Доход <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.Период,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаШапка.Контрагент,
		|	ВременнаяТаблицаШапка.ДоговорКонтрагента,
		|	ВременнаяТаблицаУслуги.СтавкаНДС,
		|	ВременнаяТаблицаУслуги.СтавкаНСП,
		|	ВременнаяТаблицаУслуги.Номенклатура,
		|	ВременнаяТаблицаУслуги.ДоходСоСкидкой,
		|	ВременнаяТаблицаУслуги.СуммаНДССоСкидкой,
		|	ВременнаяТаблицаУслуги.СуммаНСПСоСкидкой,
		|	ВременнаяТаблицаУслуги.СуммаСкидки,
		|	0,
		|	ВременнаяТаблицаУслуги.Количество,
		|	ВременнаяТаблицаШапка.Ссылка
		|ИЗ
		|	ВременнаяТаблицаУслуги КАК ВременнаяТаблицаУслуги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО ВременнаяТаблицаУслуги.Ссылка = ВременнаяТаблицаШапка.Ссылка
		|ГДЕ
		|	ВременнаяТаблицаУслуги.Доход <> 0";
		
	РезультатЗапроса = Запрос.Выполнить();	
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРеализация", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаРеализация(ДокументСсылка, СтруктураДополнительныеСвойства) 

Процедура СформироватьТаблицаБланкиСФ(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.Период,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаШапка.СерияБланкаСФ КАК Серия,
		|	ВременнаяТаблицаШапка.НомерБланкаСФ КАК Номер,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСФ.ИспользованиеБланковСФ) КАК Операция,
		|	1 КАК Количество,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|ГДЕ
		|	НЕ ВременнаяТаблицаШапка.СерияБланкаСФ = """"
		|	И НЕ ВременнаяТаблицаШапка.НомерБланкаСФ = """"";		
		
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаБланкиСФ", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаСотрудники()

Процедура СформироватьТаблицаНДС(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =	
	"ВЫБРАТЬ
	|	ВременнаяТаблицаШапка.Период КАК Период,
	|	ВременнаяТаблицаШапка.Организация КАК Организация,
	|	ВременнаяТаблицаШапка.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаШапка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВременнаяТаблицаТовары.СтавкаНДС КАК СтавкаНДС,
	|	ВременнаяТаблицаТовары.СуммаНДС КАК СуммаНДС,
	|	ВременнаяТаблицаТовары.СуммаНСП КАК СуммаНСП,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ВременнаяТаблицаШапка.ДоговорКонтрагента КАК Справочник.ДоговорыКонтрагентов).СуммаВключаетНалоги
	|			ТОГДА ВременнаяТаблицаТовары.Доход - ВременнаяТаблицаТовары.СуммаНДС - ВременнаяТаблицаТовары.СуммаНСП
	|		ИНАЧЕ ВременнаяТаблицаТовары.Доход
	|	КОНЕЦ КАК СуммаБезНДС
	|ИЗ
	|	ВременнаяТаблицаТовары КАК ВременнаяТаблицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
	|		ПО ВременнаяТаблицаТовары.Ссылка = ВременнаяТаблицаШапка.Ссылка
	|ГДЕ
	|	ВременнаяТаблицаТовары.Доход <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВременнаяТаблицаШапка.Период,
	|	ВременнаяТаблицаШапка.Организация,
	|	ВременнаяТаблицаШапка.Контрагент,
	|	ВременнаяТаблицаШапка.ДоговорКонтрагента,
	|	ВременнаяТаблицаУслуги.СтавкаНДС,
	|	ВременнаяТаблицаУслуги.СуммаНДС,
	|	ВременнаяТаблицаУслуги.СуммаНСП,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ВременнаяТаблицаШапка.ДоговорКонтрагента КАК Справочник.ДоговорыКонтрагентов).СуммаВключаетНалоги
	|			ТОГДА ВременнаяТаблицаУслуги.Доход - ВременнаяТаблицаУслуги.СуммаНДС - ВременнаяТаблицаУслуги.СуммаНСП
	|		ИНАЧЕ ВременнаяТаблицаУслуги.Доход
	|	КОНЕЦ
	|ИЗ
	|	ВременнаяТаблицаУслуги КАК ВременнаяТаблицаУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
	|		ПО ВременнаяТаблицаУслуги.Ссылка = ВременнаяТаблицаШапка.Ссылка
	|ГДЕ
	|	ВременнаяТаблицаУслуги.Доход <> 0";	
	РезультатЗапроса = Запрос.Выполнить();
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаНДС", РезультатЗапроса.Выгрузить());
	
	
КонецПроцедуры

Процедура СформироватьТаблицаРеализацияИтоги(ДокументСсылка, СтруктураДополнительныеСвойства) 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаШапка.Период КАК Период,
	|	ВременнаяТаблицаШапка.Организация КАК Организация,
	|	ВременнаяТаблицаШапка.Ссылка КАК ДокументРеализации,
	|	ВременнаяТаблицаШапка.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаШапка.ДоговорКонтрагента КАК Договор,
	|	ВременнаяТаблицаТовары.СтавкаНДС КАК СтавкаНДС,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаШапка.СерияБланкаСФ = """"
	|			ТОГДА ""ДПБУ""
	|		ИНАЧЕ ВременнаяТаблицаШапка.СерияБланкаСФ
	|	КОНЕЦ КАК СерияБланкаСФ,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаШапка.СерияБланкаСФ = """"
	|			ТОГДА ВременнаяТаблицаШапка.Номер
	|		ИНАЧЕ ВременнаяТаблицаШапка.НомерБланкаСФ
	|	КОНЕЦ КАК НомерБланкаСФ,
	|	ВременнаяТаблицаШапка.ДатаСФ КАК ДатаСФ,
	|	ВЫБОР
	|			КОГДА ВременнаяТаблицаШапка.Контрагент.СтранаРезидентства = ЗНАЧЕНИЕ(Справочник.СтраныМира.Киргизия)
	|					ИЛИ ВременнаяТаблицаШапка.Контрагент.СтранаРезидентства = ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
	|			КОГДА ВременнаяТаблицаШапка.Контрагент.СтранаРезидентства.ЕАЭС
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.Импэкс)
	|		КОНЕЦ КАК ПризнакСтраны,
	|	ВременнаяТаблицаШапка.ВидПоставкиНДС КАК ВидПоставкиНДС,
	|	ВременнаяТаблицаШапка.ТипПоставкиСФ КАК ТипПоставкиСФ
	|ПОМЕСТИТЬ ВременнаяТаблицаОбщая
	|ИЗ
	|	ВременнаяТаблицаТовары КАК ВременнаяТаблицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
	|		ПО ВременнаяТаблицаТовары.Ссылка = ВременнаяТаблицаШапка.Ссылка
	|ГДЕ
	|	ВременнаяТаблицаТовары.Доход <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВременнаяТаблицаШапка.Период,
	|	ВременнаяТаблицаШапка.Организация,
	|	ВременнаяТаблицаШапка.Ссылка,
	|	ВременнаяТаблицаШапка.Контрагент,
	|	ВременнаяТаблицаШапка.ДоговорКонтрагента,
	|	ВременнаяТаблицаУслуги.СтавкаНДС,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаШапка.СерияБланкаСФ = """"
	|			ТОГДА ""ДПБУ""
	|		ИНАЧЕ ВременнаяТаблицаШапка.СерияБланкаСФ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаШапка.СерияБланкаСФ = """"
	|			ТОГДА ВременнаяТаблицаШапка.Номер
	|		ИНАЧЕ ВременнаяТаблицаШапка.НомерБланкаСФ
	|	КОНЕЦ,
	|	ВременнаяТаблицаШапка.ДатаСФ,
	|	ВЫБОР
	|			КОГДА ВременнаяТаблицаШапка.Контрагент.СтранаРезидентства = ЗНАЧЕНИЕ(Справочник.СтраныМира.Киргизия)
	|					ИЛИ ВременнаяТаблицаШапка.Контрагент.СтранаРезидентства = ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
	|			КОГДА ВременнаяТаблицаШапка.Контрагент.СтранаРезидентства.ЕАЭС
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ПустаяСсылка)
	|		КОНЕЦ,
	|	ВременнаяТаблицаШапка.ВидПоставкиНДС,
	|	ВременнаяТаблицаШапка.ТипПоставкиСФ
	|ИЗ
	|	ВременнаяТаблицаУслуги КАК ВременнаяТаблицаУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
	|		ПО ВременнаяТаблицаУслуги.Ссылка = ВременнаяТаблицаШапка.Ссылка
	|ГДЕ
	|	ВременнаяТаблицаУслуги.Доход <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВременнаяТаблицаШапка.Период,
	|	ВременнаяТаблицаШапка.Организация,
	|	ВременнаяТаблицаШапка.Ссылка,
	|	ВременнаяТаблицаШапка.Контрагент,
	|	ВременнаяТаблицаШапка.ДоговорКонтрагента,
	|	ВременнаяТаблицаШапка.ДоговорКонтрагента.СтавкаНДС,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаШапка.СерияБланкаСФ = """"
	|			ТОГДА ""ДПБУ""
	|		ИНАЧЕ ВременнаяТаблицаШапка.СерияБланкаСФ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаШапка.СерияБланкаСФ = """"
	|			ТОГДА ВременнаяТаблицаШапка.Номер
	|		ИНАЧЕ ВременнаяТаблицаШапка.НомерБланкаСФ
	|	КОНЕЦ,
	|	ВременнаяТаблицаШапка.ДатаСФ,
	|	ВЫБОР
	|			КОГДА ВременнаяТаблицаШапка.Контрагент.СтранаРезидентства = ЗНАЧЕНИЕ(Справочник.СтраныМира.Киргизия)
	|					ИЛИ ВременнаяТаблицаШапка.Контрагент.СтранаРезидентства = ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
	|			КОГДА ВременнаяТаблицаШапка.Контрагент.СтранаРезидентства.ЕАЭС
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ПустаяСсылка)
	|		КОНЕЦ,
	|	ВременнаяТаблицаШапка.ВидПоставкиНДС,
	|	ВременнаяТаблицаШапка.ТипПоставкиСФ
	|ИЗ
	|	ВременнаяТаблицаОС КАК ВременнаяТаблицаОС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
	|		ПО ВременнаяТаблицаОС.Ссылка = ВременнаяТаблицаШапка.Ссылка
	|ГДЕ
	|	ВременнаяТаблицаОС.Сумма <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаОбщая.Период,
	|	ВременнаяТаблицаОбщая.Организация,
	|	ВременнаяТаблицаОбщая.Контрагент,
	|	ВременнаяТаблицаОбщая.Договор,
	|	ВременнаяТаблицаОбщая.СтавкаНДС,
	|	ВременнаяТаблицаОбщая.СерияБланкаСФ,
	|	ВременнаяТаблицаОбщая.НомерБланкаСФ,
	|	ВременнаяТаблицаОбщая.ДатаСФ,
	|	ВременнаяТаблицаОбщая.ПризнакСтраны,
	|	ВременнаяТаблицаОбщая.ДокументРеализации,
	|	ВременнаяТаблицаОбщая.ВидПоставкиНДС,
	|	ВременнаяТаблицаОбщая.ТипПоставкиСФ
	|ИЗ
	|	ВременнаяТаблицаОбщая КАК ВременнаяТаблицаОбщая
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаОбщая.СерияБланкаСФ,
	|	ВременнаяТаблицаОбщая.НомерБланкаСФ,
	|	ВременнаяТаблицаОбщая.ДатаСФ,
	|	ВременнаяТаблицаОбщая.ПризнакСтраны,
	|	ВременнаяТаблицаОбщая.Контрагент,
	|	ВременнаяТаблицаОбщая.Договор,
	|	ВременнаяТаблицаОбщая.Организация,
	|	ВременнаяТаблицаОбщая.СтавкаНДС,
	|	ВременнаяТаблицаОбщая.Период,
	|	ВременнаяТаблицаОбщая.ДокументРеализации,
	|	ВременнаяТаблицаОбщая.ТипПоставкиСФ,
	|	ВременнаяТаблицаОбщая.ВидПоставкиНДС";	
		
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРеализацияИтоги", РезультатЗапроса.Выгрузить());
		
КонецПроцедуры 

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт	
	ВалютаРегламентированногоУчета = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка,
	|	РеализацияТоваровУслуг.Организация,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.ВалютаДокумента = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|			ТОГДА &ВалютаРегламентированногоУчета
	|		ИНАЧЕ РеализацияТоваровУслуг.ВалютаДокумента
	|	КОНЕЦ КАК ВалютаДокумента,
	|	РеализацияТоваровУслуг.Курс,
	|	РеализацияТоваровУслуг.Склад КАК СкладРасход,
	|	НЕОПРЕДЕЛЕНО КАК СкладПриход,
	|	РеализацияТоваровУслуг.СчетРасчетов,
	|	РеализацияТоваровУслуг.Контрагент,
	|	РеализацияТоваровУслуг.ДоговорКонтрагента,
	|	РеализацияТоваровУслуг.Дата КАК Период,
	|	&СчетУчетаНДС,
	|	&СчетУчетаНСП,
	|	&ПлательщикНДС,
	|	&ПлательщикНСП,
	|	РеализацияТоваровУслуг.СерияБланкаСФ,
	|	РеализацияТоваровУслуг.НомерБланкаСФ,
	|	РеализацияТоваровУслуг.ДатаСФ,
	|	РеализацияТоваровУслуг.ТипПоставкиСФ,
	|	РеализацияТоваровУслуг.ВидПоставкиНДС КАК ВидПоставкиНДС,
	|	РеализацияТоваровУслуг.Номер,
	|	РеализацияТоваровУслуг.КонтрСчетУчетаСкидок,
	|	РеализацияТоваровУслуг.СотрудникуНачислятьНалогиНаСкидки,
	|	РеализацияТоваровУслуг.МБПЭксплуатация
	|ПОМЕСТИТЬ ВременнаяТаблицаШапка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.Ссылка,
	|	РеализацияТоваровУслугТовары.Номенклатура,
	|	РеализацияТоваровУслугТовары.Количество,
	|	РеализацияТоваровУслугТовары.Доход,
	|	РеализацияТоваровУслугТовары.Доход КАК Сумма,
	|	РеализацияТоваровУслугТовары.СуммаНДС,
	|	РеализацияТоваровУслугТовары.СуммаНСП,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугТовары.Доход + РеализацияТоваровУслугТовары.СуммаНДС + РеализацияТоваровУслугТовары.СуммаНСП = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(РеализацияТоваровУслугТовары.СуммаНДС * (1 - РеализацияТоваровУслугТовары.СуммаСкидки / (РеализацияТоваровУслугТовары.Доход + РеализацияТоваровУслугТовары.СуммаНДС + РеализацияТоваровУслугТовары.СуммаНСП)) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК СуммаНДССоСкидкой,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугТовары.Доход + РеализацияТоваровУслугТовары.СуммаНДС + РеализацияТоваровУслугТовары.СуммаНСП = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(РеализацияТоваровУслугТовары.СуммаНСП * (1 - РеализацияТоваровУслугТовары.СуммаСкидки / (РеализацияТоваровУслугТовары.Доход + РеализацияТоваровУслугТовары.СуммаНДС + РеализацияТоваровУслугТовары.СуммаНСП)) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК СуммаНСПСоСкидкой,
	|	РеализацияТоваровУслугТовары.Итого - (ВЫРАЗИТЬ(РеализацияТоваровУслугТовары.СуммаНДС * (1 - ВЫБОР
	|			КОГДА РеализацияТоваровУслугТовары.Доход + РеализацияТоваровУслугТовары.СуммаНДС + РеализацияТоваровУслугТовары.СуммаНСП = 0
	|				ТОГДА 0
	|			ИНАЧЕ РеализацияТоваровУслугТовары.СуммаСкидки / (РеализацияТоваровУслугТовары.Доход + РеализацияТоваровУслугТовары.СуммаНДС + РеализацияТоваровУслугТовары.СуммаНСП)
	|		КОНЕЦ) КАК ЧИСЛО(15, 2))) - (ВЫРАЗИТЬ(РеализацияТоваровУслугТовары.СуммаНСП * (1 - ВЫБОР
	|			КОГДА РеализацияТоваровУслугТовары.Доход + РеализацияТоваровУслугТовары.СуммаНДС + РеализацияТоваровУслугТовары.СуммаНСП = 0
	|				ТОГДА 0
	|			ИНАЧЕ РеализацияТоваровУслугТовары.СуммаСкидки / (РеализацияТоваровУслугТовары.Доход + РеализацияТоваровУслугТовары.СуммаНДС + РеализацияТоваровУслугТовары.СуммаНСП)
	|		КОНЕЦ) КАК ЧИСЛО(15, 2))) КАК ДоходСоСкидкой,
	|	РеализацияТоваровУслугТовары.СчетУчета,
	|	РеализацияТоваровУслугТовары.СчетДохода,
	|	РеализацияТоваровУслугТовары.СубконтоДоходов,
	|	РеализацияТоваровУслугТовары.СчетСебестоимости,
	|	РеализацияТоваровУслугТовары.СубконтоСписанияСебестоимости КАК СубконтоСписанияСебестоимости1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоСписанияСебестоимости2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоСписанияСебестоимости3,
	|	РеализацияТоваровУслугТовары.СуммаСкидки,
	|	РеализацияТоваровУслугТовары.НомерСтроки,
	|	РеализацияТоваровУслугТовары.СтавкаНДС,
	|	РеализацияТоваровУслугТовары.СтавкаНСП,
	|	РеализацияТоваровУслугТовары.Партия,
	|	РеализацияТоваровУслугТовары.ИндивидуальныйНомер,
	|	РеализацияТоваровУслугТовары.Себестоимость,
	|	РеализацияТоваровУслугТовары.предСтатусМБП КАК предСтатус,
	|	РеализацияТоваровУслугТовары.Цена,
	|	РеализацияТоваровУслугТовары.Сотрудник,
	|	РеализацияТоваровУслугТовары.СкидкаПроцент,
	|	РеализацияТоваровУслугТовары.ДатаВыдачи,
	|	СотрудникиСрезПоследних.Подразделение
	|ПОМЕСТИТЬ ВременнаяТаблицаТовары
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Сотрудники.СрезПоследних(&Дата, ) КАК СотрудникиСрезПоследних
	|		ПО РеализацияТоваровУслугТовары.Сотрудник = СотрудникиСрезПоследних.ФизЛицо
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугОС.Ссылка,
	|	РеализацияТоваровУслугОС.ОсновноеСредство,
	|	РеализацияТоваровУслугОС.Сумма,
	|	РеализацияТоваровУслугОС.ОстаточнаяСтоимость,
	|	РеализацияТоваровУслугОС.СуммаНДС,
	|	РеализацияТоваровУслугОС.СуммаНСП
	|ПОМЕСТИТЬ ВременнаяТаблицаОС
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.ОС КАК РеализацияТоваровУслугОС
	|ГДЕ
	|	РеализацияТоваровУслугОС.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугУслуги.Ссылка,
	|	РеализацияТоваровУслугУслуги.Номенклатура,
	|	РеализацияТоваровУслугУслуги.Количество,
	|	РеализацияТоваровУслугУслуги.Доход,
	|	РеализацияТоваровУслугУслуги.СуммаНДС,
	|	РеализацияТоваровУслугУслуги.СуммаНСП,
	|	ВЫРАЗИТЬ(РеализацияТоваровУслугУслуги.СуммаНДС * (1 - ВЫБОР
	|			КОГДА РеализацияТоваровУслугУслуги.Доход + РеализацияТоваровУслугУслуги.СуммаНДС + РеализацияТоваровУслугУслуги.СуммаНСП = 0
	|				ТОГДА 0
	|			ИНАЧЕ РеализацияТоваровУслугУслуги.СуммаСкидки / (РеализацияТоваровУслугУслуги.Доход + РеализацияТоваровУслугУслуги.СуммаНДС + РеализацияТоваровУслугУслуги.СуммаНСП)
	|		КОНЕЦ) КАК ЧИСЛО(15, 2)) КАК СуммаНДССоСкидкой,
	|	ВЫРАЗИТЬ(РеализацияТоваровУслугУслуги.СуммаНСП * (1 - ВЫБОР
	|			КОГДА РеализацияТоваровУслугУслуги.Доход + РеализацияТоваровУслугУслуги.СуммаНДС + РеализацияТоваровУслугУслуги.СуммаНСП = 0
	|				ТОГДА 0
	|			ИНАЧЕ РеализацияТоваровУслугУслуги.СуммаСкидки / (РеализацияТоваровУслугУслуги.Доход + РеализацияТоваровУслугУслуги.СуммаНДС + РеализацияТоваровУслугУслуги.СуммаНСП)
	|		КОНЕЦ) КАК ЧИСЛО(15, 2)) КАК СуммаНСПСоСкидкой,
	|	РеализацияТоваровУслугУслуги.Итого - (ВЫРАЗИТЬ(РеализацияТоваровУслугУслуги.СуммаНДС * (1 - ВЫБОР
	|			КОГДА РеализацияТоваровУслугУслуги.Доход + РеализацияТоваровУслугУслуги.СуммаНДС + РеализацияТоваровУслугУслуги.СуммаНСП = 0
	|				ТОГДА 0
	|			ИНАЧЕ РеализацияТоваровУслугУслуги.СуммаСкидки / (РеализацияТоваровУслугУслуги.Доход + РеализацияТоваровУслугУслуги.СуммаНДС + РеализацияТоваровУслугУслуги.СуммаНСП)
	|		КОНЕЦ) КАК ЧИСЛО(15, 2))) - (ВЫРАЗИТЬ(РеализацияТоваровУслугУслуги.СуммаНСП * (1 - ВЫБОР
	|			КОГДА РеализацияТоваровУслугУслуги.Доход + РеализацияТоваровУслугУслуги.СуммаНДС + РеализацияТоваровУслугУслуги.СуммаНСП = 0
	|				ТОГДА 0
	|			ИНАЧЕ РеализацияТоваровУслугУслуги.СуммаСкидки / (РеализацияТоваровУслугУслуги.Доход + РеализацияТоваровУслугУслуги.СуммаНДС + РеализацияТоваровУслугУслуги.СуммаНСП)
	|		КОНЕЦ) КАК ЧИСЛО(15, 2))) КАК ДоходСоСкидкой,
	|	РеализацияТоваровУслугУслуги.СчетУчета,
	|	РеализацияТоваровУслугУслуги.СчетДохода,
	|	РеализацияТоваровУслугУслуги.СубконтоДоходов,
	|	РеализацияТоваровУслугУслуги.СуммаСкидки,
	|	РеализацияТоваровУслугУслуги.НомерСтроки,
	|	РеализацияТоваровУслугУслуги.СтавкаНДС,
	|	РеализацияТоваровУслугУслуги.СтавкаНСП,
	|	РеализацияТоваровУслугУслуги.Сотрудник,
	|	РеализацияТоваровУслугУслуги.СкидкаПроцент
	|ПОМЕСТИТЬ ВременнаяТаблицаУслуги
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	|ГДЕ
	|	РеализацияТоваровУслугУслуги.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.Ссылка,
	|	СУММА(РеализацияТоваровУслугТовары.Количество) КАК Количество,
	|	СУММА(РеализацияТоваровУслугТовары.Доход) КАК Доход,
	|	СУММА(РеализацияТоваровУслугТовары.СуммаНДС) КАК СуммаНДС,
	|	СУММА(РеализацияТоваровУслугТовары.СуммаСкидки) КАК СуммаСкидки,
	|	СУММА(РеализацияТоваровУслугТовары.СуммаНСП) КАК СуммаНСП,
	|	РеализацияТоваровУслугТовары.СчетУчета,
	|	СУММА(РеализацияТоваровУслугТовары.Себестоимость) КАК Себестоимость,
	|	РеализацияТоваровУслугТовары.СчетСебестоимости КАК СчетСебестоимости,
	|	РеализацияТоваровУслугТовары.предСтатусМБП КАК предСтатус,
	|	РеализацияТоваровУслугТовары.Номенклатура,
	|	РеализацияТоваровУслугТовары.СубконтоСписанияСебестоимости КАК СубконтоСписанияСебестоимости1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоСписанияСебестоимости2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоСписанияСебестоимости3
	|ПОМЕСТИТЬ ВременнаяТаблицаТоварыСГруппировкой
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслугТовары.Ссылка,
	|	РеализацияТоваровУслугТовары.СчетУчета,
	|	РеализацияТоваровУслугТовары.предСтатусМБП,
	|	РеализацияТоваровУслугТовары.Номенклатура,
	|	РеализацияТоваровУслугТовары.СчетСебестоимости,
	|	РеализацияТоваровУслугТовары.СубконтоСписанияСебестоимости
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.Ссылка,
	|	СУММА(РеализацияТоваровУслугТовары.Доход) КАК Доход,
	|	СУММА(РеализацияТоваровУслугТовары.СуммаНДС) КАК СуммаНДС,
	|	СУММА(РеализацияТоваровУслугТовары.СуммаНСП) КАК СуммаНСП,
	|	СУММА(РеализацияТоваровУслугТовары.СуммаСкидки) КАК СуммаСкидки,
	|	РеализацияТоваровУслугТовары.СчетДохода,
	|	РеализацияТоваровУслугТовары.СубконтоДоходов,
	|	СУММА(ВЫРАЗИТЬ(РеализацияТоваровУслугТовары.СуммаНДС * (1 - ВЫБОР
	|				КОГДА РеализацияТоваровУслугТовары.Доход + РеализацияТоваровУслугТовары.СуммаНДС + РеализацияТоваровУслугТовары.СуммаНСП = 0
	|					ТОГДА 0
	|				ИНАЧЕ РеализацияТоваровУслугТовары.СуммаСкидки / (РеализацияТоваровУслугТовары.Доход + РеализацияТоваровУслугТовары.СуммаНДС + РеализацияТоваровУслугТовары.СуммаНСП)
	|			КОНЕЦ) КАК ЧИСЛО(15, 2))) КАК СуммаНДССоСкидкой,
	|	СУММА(ВЫРАЗИТЬ(РеализацияТоваровУслугТовары.СуммаНСП * (1 - ВЫБОР
	|				КОГДА РеализацияТоваровУслугТовары.Доход + РеализацияТоваровУслугТовары.СуммаНДС + РеализацияТоваровУслугТовары.СуммаНСП = 0
	|					ТОГДА 0
	|				ИНАЧЕ РеализацияТоваровУслугТовары.СуммаСкидки / (РеализацияТоваровУслугТовары.Доход + РеализацияТоваровУслугТовары.СуммаНДС + РеализацияТоваровУслугТовары.СуммаНСП)
	|			КОНЕЦ) КАК ЧИСЛО(15, 2))) КАК СуммаНСПСоСкидкой,
	|	МАКСИМУМ(РеализацияТоваровУслугТовары.СтавкаНДС) КАК СтавкаНДС,
	|	СУММА(РеализацияТоваровУслугТовары.Итого - (ВЫРАЗИТЬ(РеализацияТоваровУслугТовары.СуммаНДС * (1 - ВЫБОР
	|				КОГДА РеализацияТоваровУслугТовары.Доход + РеализацияТоваровУслугТовары.СуммаНДС + РеализацияТоваровУслугТовары.СуммаНСП = 0
	|					ТОГДА 0
	|				ИНАЧЕ РеализацияТоваровУслугТовары.СуммаСкидки / (РеализацияТоваровУслугТовары.Доход + РеализацияТоваровУслугТовары.СуммаНДС + РеализацияТоваровУслугТовары.СуммаНСП)
	|			КОНЕЦ) КАК ЧИСЛО(15, 2))) - (ВЫРАЗИТЬ(РеализацияТоваровУслугТовары.СуммаНСП * (1 - ВЫБОР
	|				КОГДА РеализацияТоваровУслугТовары.Доход + РеализацияТоваровУслугТовары.СуммаНДС + РеализацияТоваровУслугТовары.СуммаНСП = 0
	|					ТОГДА 0
	|				ИНАЧЕ РеализацияТоваровУслугТовары.СуммаСкидки / (РеализацияТоваровУслугТовары.Доход + РеализацияТоваровУслугТовары.СуммаНДС + РеализацияТоваровУслугТовары.СуммаНСП)
	|			КОНЕЦ) КАК ЧИСЛО(15, 2)))) КАК ДоходСоСкидкой,
	|	РеализацияТоваровУслугТовары.Сотрудник
	|ПОМЕСТИТЬ ТаблицыСГруппировкойПоДоходам
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНДС.СрезПоследних КАК СтавкиНДССрезПоследних
	|		ПО РеализацияТоваровУслугТовары.СтавкаНДС = СтавкиНДССрезПоследних.СтавкаНДС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНСП.СрезПоследних КАК СтавкиНСПСрезПоследних
	|		ПО РеализацияТоваровУслугТовары.СтавкаНСП = СтавкиНСПСрезПоследних.СтавкаНСП
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
	|		ПО РеализацияТоваровУслугТовары.Ссылка = ВременнаяТаблицаШапка.Ссылка
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслугТовары.Ссылка,
	|	РеализацияТоваровУслугТовары.СчетДохода,
	|	РеализацияТоваровУслугТовары.Сотрудник,
	|	РеализацияТоваровУслугТовары.СубконтоДоходов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугУслуги.Ссылка,
	|	СУММА(РеализацияТоваровУслугУслуги.Доход),
	|	СУММА(РеализацияТоваровУслугУслуги.СуммаНДС),
	|	СУММА(РеализацияТоваровУслугУслуги.СуммаНСП),
	|	СУММА(РеализацияТоваровУслугУслуги.СуммаСкидки),
	|	РеализацияТоваровУслугУслуги.СчетДохода,
	|	РеализацияТоваровУслугУслуги.СубконтоДоходов,
	|	СУММА(ВЫРАЗИТЬ(РеализацияТоваровУслугУслуги.СуммаНДС * (1 - РеализацияТоваровУслугУслуги.СуммаСкидки / (РеализацияТоваровУслугУслуги.Доход + РеализацияТоваровУслугУслуги.СуммаНДС + РеализацияТоваровУслугУслуги.СуммаНСП)) КАК ЧИСЛО(15, 2))),
	|	СУММА(ВЫРАЗИТЬ(РеализацияТоваровУслугУслуги.СуммаНСП * (1 - РеализацияТоваровУслугУслуги.СуммаСкидки / (РеализацияТоваровУслугУслуги.Доход + РеализацияТоваровУслугУслуги.СуммаНДС + РеализацияТоваровУслугУслуги.СуммаНСП)) КАК ЧИСЛО(15, 2))),
	|	МАКСИМУМ(РеализацияТоваровУслугУслуги.СтавкаНДС),
	|	СУММА(РеализацияТоваровУслугУслуги.Итого - (ВЫРАЗИТЬ(РеализацияТоваровУслугУслуги.СуммаНДС * (1 - РеализацияТоваровУслугУслуги.СуммаСкидки / (РеализацияТоваровУслугУслуги.Доход + РеализацияТоваровУслугУслуги.СуммаНДС + РеализацияТоваровУслугУслуги.СуммаНСП)) КАК ЧИСЛО(15, 2))) - (ВЫРАЗИТЬ(РеализацияТоваровУслугУслуги.СуммаНСП * (1 - РеализацияТоваровУслугУслуги.СуммаСкидки / (РеализацияТоваровУслугУслуги.Доход + РеализацияТоваровУслугУслуги.СуммаНДС + РеализацияТоваровУслугУслуги.СуммаНСП)) КАК ЧИСЛО(15, 2)))),
	|	РеализацияТоваровУслугУслуги.Сотрудник
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНДС.СрезПоследних КАК СтавкиНДССрезПоследних
	|		ПО РеализацияТоваровУслугУслуги.СтавкаНДС = СтавкиНДССрезПоследних.СтавкаНДС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНСП.СрезПоследних КАК СтавкиНСПСрезПоследних
	|		ПО РеализацияТоваровУслугУслуги.СтавкаНСП = СтавкиНСПСрезПоследних.СтавкаНСП
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
	|		ПО РеализацияТоваровУслугУслуги.Ссылка = ВременнаяТаблицаШапка.Ссылка
	|ГДЕ
	|	РеализацияТоваровУслугУслуги.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслугУслуги.Ссылка,
	|	РеализацияТоваровУслугУслуги.СчетДохода,
	|	РеализацияТоваровУслугУслуги.Сотрудник,
	|	РеализацияТоваровУслугУслуги.СубконтоДоходов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицыСГруппировкой.Ссылка,
	|	СУММА(ТаблицыСГруппировкой.Доход) КАК Доход,
	|	СУММА(ТаблицыСГруппировкой.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ТаблицыСГруппировкой.СуммаНСП) КАК СуммаНСП,
	|	СУММА(ТаблицыСГруппировкой.СуммаСкидки) КАК СуммаСкидки,
	|	ТаблицыСГруппировкой.СчетДохода,
	|	ТаблицыСГруппировкой.СубконтоДоходов,
	|	СУММА(ТаблицыСГруппировкой.СуммаНДССоСкидкой) КАК СуммаНДССоСкидкой,
	|	СУММА(ТаблицыСГруппировкой.СуммаНСПСоСкидкой) КАК СуммаНСПСоСкидкой,
	|	МАКСИМУМ(ТаблицыСГруппировкой.СтавкаНДС) КАК СтавкаНДС,
	|	СУММА(ТаблицыСГруппировкой.ДоходСоСкидкой) КАК ДоходСоСкидкой,
	|	ТаблицыСГруппировкой.Сотрудник
	|ПОМЕСТИТЬ ВременнаяТаблицаОбщиеСуммыДоходы
	|ИЗ
	|	ТаблицыСГруппировкойПоДоходам КАК ТаблицыСГруппировкой
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицыСГруппировкой.Ссылка,
	|	ТаблицыСГруппировкой.СчетДохода,
	|	ТаблицыСГруппировкой.Сотрудник,
	|	ТаблицыСГруппировкой.СубконтоДоходов";		
	Запрос.УстановитьПараметр("Ссылка", 		ДокументСсылка);
	Запрос.УстановитьПараметр("Дата", 			ДокументСсылка.Дата);
	Запрос.УстановитьПараметр("СчетУчетаНДС", 	ПланыСчетов.Хозрасчетный.НДСКОплате);
	Запрос.УстановитьПараметр("СчетУчетаНСП", 	ПланыСчетов.Хозрасчетный.НалогСПродаж);
	Запрос.УстановитьПараметр("ПлательщикНДС", 	СтруктураДополнительныеСвойства.ДляПроведения.ПлательщикНДС);
	Запрос.УстановитьПараметр("ПлательщикНСП", 	СтруктураДополнительныеСвойства.ДляПроведения.ПлательщикНСП);
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СформироватьТаблицаЗапасы(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицаХозрасчетный(ДокументСсылка,СтруктураДополнительныеСвойства);
	СформироватьТаблицаРеализация(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицаБланкиСФ(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицаМБПСклад(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицаНДС(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРеализацияИтоги(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицаМБПЭксплуатация(ДокументСсылка, СтруктураДополнительныеСвойства);
	
КонецПроцедуры

#КонецОбласти	

#Область ИнтерфейсПечати

Функция ПечатьАкта(МассивОбъектов, ОбъектыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РеализацияТМЗ";
	ТабличныйДокумент.КлючПараметровПечати = "РеализацияТоваровУслуг";
	
	ТекстЗапроса =
	
	"ВЫБРАТЬ
	|	ТаблицаДокумента.Номер,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Ссылка,
	|	ТаблицаДокумента.Склад,
	|	ТаблицаДокумента.Организация.Наименование,
	|	ТаблицаДокумента.Организация.НаименованиеПолное,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.Контрагент.Наименование,
	|	ТаблицаДокумента.Контрагент.НаименованиеПолное,
	|	ТаблицаДокумента.ВидСкидки,
	|	ТаблицаДокумента.Услуги.(
	|		Ссылка,
	|		НомерСтроки,
	|		Количество,
	|		Цена,
	|		Всего КАК СуммаБезСкидки,
	|		Доход,
	|		Итого КАК Сумма,
	|		СтавкаНДС,
	|		СуммаНДС,
	|		СтавкаНСП,
	|		СуммаНСП,
	|		СчетУчета,
	|		СчетДохода,
	|		СкидкаПроцент,
	|		СпособОценки,
	|		СуммаСкидки КАК Скидка,
	|		ВЫБОР
	|			КОГДА ТаблицаДокумента.Услуги.СуммаСкидки <> 0
	|				ТОГДА ТаблицаДокумента.Услуги.СуммаСкидки / ТаблицаДокумента.Услуги.Всего * 100
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ПроцентСкидки,
	|		Номенклатура.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмерения,
	|		Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
	|		Номенклатура.Код КАК Код
	|	),
	|	ТаблицаДокумента.Организация.ИНН,
	|	ТаблицаДокумента.Организация.ОсновнойБанковскийСчет.Наименование КАК ОсновнойБанковскийСчет,
	|	ТаблицаДокумента.БанковскийСчет.Банк.Код КАК БИК,
	|	ТаблицаДокумента.Контрагент.ОсновнойБанковскийСчет.Наименование КАК ОсновнойБанковскийСчетКонтрагент,
	|	ТаблицаДокумента.Контрагент.ОсновнойБанковскийСчет.Банк.Код КАК БИККонтрагент,
	|	ТаблицаДокумента.Контрагент.ИНН КАК ИННКонтрагент
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка В(&СписокДокументов)";
				
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СписокДокументов", МассивОбъектов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровУслуг.Акт");
		
	Пока Выборка.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
	
		ДанныеПечати   = Новый Структура;
		
		ВременнаяТаблицаУслуги  = Выборка.Услуги.Выгрузить();                                      
		
		ТекстЗаголовка = "Акт №" + ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Выборка.Номер)
		               + " от "  + Формат(Выборка.Дата,"ДЛФ=DD");
		ДанныеПечати.Вставить("ТекстЗаголовка", ТекстЗаголовка);
		ДанныеПечати.Вставить("ПредставлениеПоставщика", Выборка.ОрганизацияНаименованиеПолное);
		ДанныеПечати.Вставить("Склад", Выборка.Склад);
		ДанныеПечати.Вставить("ПредставлениеПолучателя", Выборка.КонтрагентНаименованиеПолное);

		ДанныеПечати.Вставить("Всего", ВременнаяТаблицаУслуги.Итог("Сумма"));
		ДанныеПечати.Вставить("ВсегоНДС", ВременнаяТаблицаУслуги.Итог("СуммаНДС"));
		ДанныеПечати.Вставить("ВсегоНСП", ВременнаяТаблицаУслуги.Итог("СуммаНСП"));
						
		МассивОбластейМакета = Новый Массив;  
		МассивОбластейМакета.Добавить("Заголовок");
		МассивОбластейМакета.Добавить("Поставщик");
		МассивОбластейМакета.Добавить("Покупатель");
		
		Если ЗначениеЗаполнено(Выборка.ВидСкидки) Тогда 
			МассивОбластейМакета.Добавить("ШапкаТаблицыСоСкидкой"); 
		Иначе
			МассивОбластейМакета.Добавить("ШапкаТаблицы");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ВидСкидки) Тогда 
			МассивОбластейМакета.Добавить("СтрокаСоСкидкой"); 
		Иначе
			МассивОбластейМакета.Добавить("Строка");
		КонецЕсли;

		МассивОбластейМакета.Добавить("Итого");
		МассивОбластейМакета.Добавить("ИтогоНДС");      
	    МассивОбластейМакета.Добавить("ИтогоНСП");
		
		ИтоговаяСтрока = "Всего оказано услуг " 
					   + ВременнаяТаблицаУслуги.Итог ("Количество")
					   + ", на сумму "+ВременнаяТаблицаУслуги.Итог("Сумма");
		ДанныеПечати.Вставить("ИтоговаяСтрока", ИтоговаяСтрока);
        ДанныеПечати.Вставить("СуммаПрописью", БухгалтерскийУчетСервер.СформироватьСуммуПрописью(ДанныеПечати.Всего));

	    МассивОбластейМакета.Добавить("СуммаПрописью");
        МассивОбластейМакета.Добавить("Подписи");
		
		АдресОрганизации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Выборка.Организация, Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации); 
		АдресКонтрагента = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Выборка.Контрагент, Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента); 		
		
		Для Каждого ИмяОбласти Из МассивОбластейМакета Цикл
			ОбластьМакета = Макет.ПолучитьОбласть(ИмяОбласти);
			
			Если ИмяОбласти = "Строка" Или  
				 ИмяОбласти = "СтрокаСоСкидкой"  Тогда
				Для Каждого СтрокаТабличнойЧасти Из ВременнаяТаблицаУслуги Цикл 
					ОбластьМакета.Параметры.Заполнить(СтрокаТабличнойЧасти);
					ТабличныйДокумент.Вывести(ОбластьМакета);
				КонецЦикла;	
			ИначеЕсли ИмяОбласти = "Подписи" Тогда 
				//Исполнитель
				ОбластьМакета.Параметры.Организация    	 = Выборка.ОрганизацияНаименованиеПолное;
				ОбластьМакета.Параметры.ИННОрганизации 	 = Выборка.ОрганизацияИНН;
				ОбластьМакета.Параметры.АдресОрганизации = АдресОрганизации;
				ОбластьМакета.Параметры.РасчетныйСчетОрганизации = Выборка.ОсновнойБанковскийСчет;
				ОбластьМакета.Параметры.БИКОрганизации           = Выборка.БИК; 
				//Заказчик
				ОбластьМакета.Параметры.Контрагент    	 = Выборка.КонтрагентНаименованиеПолное;
				ОбластьМакета.Параметры.ИННКонтрагента 	 = Выборка.ИННКонтрагент;
				ОбластьМакета.Параметры.АдресКонтрагента = АдресКонтрагента;
				ОбластьМакета.Параметры.РасчетныйСчетКонтрагента = Выборка.ОсновнойБанковскийСчетКонтрагент;
				ОбластьМакета.Параметры.БИККонтрагента           = Выборка.БИККонтрагент; 
				ТабличныйДокумент.Вывести(ОбластьМакета);	
			Иначе
				
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			КонецЕсли;
		КонецЦикла;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб =Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПечатьНакладной(МассивОбъектов, ОбъектыПечати)
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РеализацияТМЗ";
	
	ТекстЗапроса =
	
	"ВЫБРАТЬ
	|	ТаблицаДокумента.Номер,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Организация.НаименованиеПолное,
	|	ТаблицаДокумента.Ссылка,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.Контрагент.НаименованиеПолное,
	|	ТаблицаДокумента.Склад,
	|	ТаблицаДокумента.ВидСкидки,
	|	ТаблицаДокумента.Товары.(
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК Товар,
	|		Номенклатура.Код КАК Код,
	|		Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		Количество,
	|		Цена,
	|		Всего КАК СуммаБезСкидки,
	|		СуммаНДС,
	|		СуммаНСП,
	|		СуммаСкидки КАК Скидка,
	|		Итого КАК Сумма
	|	)
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка В(&СписокДокументов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
				
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СписокДокументов", МассивОбъектов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "РеализацияТоваровУслуг";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровУслуг.НакладнаяНаСторону");
		
	Пока Выборка.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ДанныеПечати = Новый Структура;
		
		ВременнаяТаблицаТовары = Выборка.Товары.Выгрузить();                                      
		
		ТекстЗаголовка = "Расходная накладная № " + ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Выборка.Номер)
		               + " от "+Формат(Выборка.Дата,"ДЛФ=DD");
		ДанныеПечати.Вставить("ТекстЗаголовка", ТекстЗаголовка);
		ДанныеПечати.Вставить("ПредставлениеПоставщика", Выборка.ОрганизацияНаименованиеПолное);
		ДанныеПечати.Вставить("Склад", Выборка.Склад);
		ДанныеПечати.Вставить("ПредставлениеПолучателя", Выборка.КонтрагентНаименованиеПолное);

		ДанныеПечати.Вставить("Всего", ВременнаяТаблицаТовары.Итог("Сумма"));
		ДанныеПечати.Вставить("ВсегоНДС", ВременнаяТаблицаТовары.Итог("СуммаНДС"));
		ДанныеПечати.Вставить("ВсегоНСП", ВременнаяТаблицаТовары.Итог("СуммаНСП"));
			
		МассивОбластейМакета = Новый Массив;  
		МассивОбластейМакета.Добавить("Заголовок");
		МассивОбластейМакета.Добавить("Поставщик");
		МассивОбластейМакета.Добавить("Покупатель");

		Если ЗначениеЗаполнено(Выборка.ВидСкидки) Тогда 
			МассивОбластейМакета.Добавить("ШапкаТаблицыСоСкидкой"); 
		Иначе
			МассивОбластейМакета.Добавить("ШапкаТаблицы");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ВидСкидки) Тогда 
			МассивОбластейМакета.Добавить("СтрокаСоСкидкой"); 
		Иначе
			МассивОбластейМакета.Добавить("Строка");
		КонецЕсли;

		МассивОбластейМакета.Добавить("Итого");
		МассивОбластейМакета.Добавить("ИтогоНДС");      
	    МассивОбластейМакета.Добавить("ИтогоНСП");
		
		Если ЗначениеЗаполнено(Выборка.ВидСкидки) Тогда 
			МассивОбластейМакета.Добавить("ОблСкидка");
			Скидка = ВременнаяТаблицаТовары.Итог("Скидка");
  		КонецЕсли;
        
		ИтоговаяСтрока="Всего наименований "+ ВременнаяТаблицаТовары.Количество()+", на сумму "+ВременнаяТаблицаТовары.Итог("Сумма");
		ДанныеПечати.Вставить("ИтоговаяСтрока", ИтоговаяСтрока);
        ДанныеПечати.Вставить("СуммаПрописью", БухгалтерскийУчетСервер.СформироватьСуммуПрописью(ДанныеПечати.Всего));

	    МассивОбластейМакета.Добавить("СуммаПрописью");
        МассивОбластейМакета.Добавить("Подписи");

		Для Каждого ИмяОбласти Из МассивОбластейМакета Цикл
			ОбластьМакета = Макет.ПолучитьОбласть(ИмяОбласти);
			
			Если ИмяОбласти = "Строка" Или ИмяОбласти = "СтрокаСоСкидкой" Тогда
				Для Каждого СтрокаТабличнойЧасти Из ВременнаяТаблицаТовары Цикл 
					ОбластьМакета.Параметры.Заполнить(СтрокаТабличнойЧасти);
					ТабличныйДокумент.Вывести(ОбластьМакета);
				КонецЦикла;	
			ИначеЕсли ИмяОбласти = "ОблСкидка"  Тогда 
				 ОбластьМакета.Параметры.Скидка = Скидка;
				 ТабличныйДокумент.Вывести(ОбластьМакета);
			Иначе
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			КонецЕсли;
		КонецЦикла;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб=Истина;
	ТабличныйДокумент.ОриентацияСтраницы= ОриентацияСтраницы.Портрет;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПечатьСчетФактураНДС(МассивОбъектов, ОбъектыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РеализацияТоваровУслуг";
	ТабличныйДокумент.КлючПараметровПечати = "СчетФактураНДС";

	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщиеМакеты.СчетФактураНДС");
	
	ТекстЗапроса =
	
	"ВЫБРАТЬ
	|	ТаблицаДокумента.Номер,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Ссылка,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.Товары.(
	|		Номенклатура,
	|		Номенклатура.Код КАК Код,
	|		Номенклатура.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмерения,
	|		Количество,
	|		Цена,
	|		Всего,
	|		СуммаНДС,
	|		СтавкаНСП,
	|		СуммаНСП,
	|		НомерСтроки,
	|		СкидкаПроцент,
	|		СуммаСкидки,
	|		Доход,
	|		Итого
	|	),
	|	ТаблицаДокумента.Организация.ИНН КАК ИНН,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Организация.ЭтоГоловнаяОрганизация = ИСТИНА
	|			ТОГДА ТаблицаДокумента.Организация.ИНН
	|		ИНАЧЕ ТаблицаДокумента.Организация.ГоловнаяОрганизация.ИНН
	|	КОНЕЦ КАК ИННГоловнойОрганизации,
	|	ТаблицаДокумента.Организация.ОсновнойБанковскийСчет КАК ОснБанкСчет,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Организация.ЭтоГоловнаяОрганизация = ИСТИНА
	|			ТОГДА ТаблицаДокумента.Организация.ГНС
	|		ИНАЧЕ ТаблицаДокумента.Организация.ГоловнаяОрганизация.ГНС
	|	КОНЕЦ КАК ГНС,
	|	ТаблицаДокумента.Организация.НаименованиеПолное КАК НаименованиеПолное,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Организация.ЭтоГоловнаяОрганизация = ИСТИНА
	|			ТОГДА ТаблицаДокумента.Организация.НаименованиеПолное
	|		ИНАЧЕ ТаблицаДокумента.Организация.ГоловнаяОрганизация.НаименованиеПолное
	|	КОНЕЦ КАК НаименованиеГоловнойОрганизации,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Организация.ЭтоГоловнаяОрганизация = ИСТИНА
	|			ТОГДА ТаблицаДокумента.Организация
	|		ИНАЧЕ ТаблицаДокумента.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК ГоловнаяОрганизация,
	|	"""" КАК АдресПоставщика,
	|	ТаблицаДокумента.ТипПоставкиСФ КАК ТипПоставки,
	|	ТаблицаДокумента.ТипПоставкиСФ.Наименование КАК ИмяПоставки,
	|	ТаблицаДокумента.ВидПлатежа,
	|	ТаблицаДокумента.Контрагент.ОсновнойБанковскийСчет КАК ОснБанкСчет_Пок,
	|	ТаблицаДокумента.Услуги.(
	|		Номенклатура,
	|		Номенклатура.Код,
	|		Номенклатура.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмерения,
	|		Количество,
	|		Цена,
	|		Всего,
	|		Итого,
	|		СуммаНДС,
	|		СуммаНСП,
	|		СкидкаПроцент,
	|		СуммаСкидки,
	|		Доход,
	|		Итого КАК Итого1,
	|		СтавкаНСП
	|	),
	|	ТаблицаДокумента.БанковскийСчет,
	|	ТаблицаДокумента.Контрагент.КонтактнаяИнформация.(
	|		Город КАК Поле1,
	|		Страна КАК Поле2
	|	) КАК Контрагент1,
	|	ТаблицаДокумента.ДоговорКонтрагента.СтавкаНДС,
	|	СтавкиНДССрезПоследних.Ставка,
	|	СтавкиНСПСрезПоследних.СтавкаПлательщикНДС,
	|	СтавкиНСПСрезПоследних.СтавкаНеПлательщикНДС
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНДС.СрезПоследних КАК СтавкиНДССрезПоследних
	|		ПО ТаблицаДокумента.ДоговорКонтрагента.СтавкаНДС = СтавкиНДССрезПоследних.СтавкаНДС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНСП.СрезПоследних КАК СтавкиНСПСрезПоследних
	|		ПО ТаблицаДокумента.ДоговорКонтрагента.СтавкаНСП = СтавкиНСПСрезПоследних.СтавкаНСП
	|ГДЕ
	|	ТаблицаДокумента.Ссылка В(&СписокДокументов)";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СписокДокументов", МассивОбъектов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	СтавкаНСП = Новый ТаблицаЗначений;
	Пока Выборка.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ВременнаяТаблицаТовары = Выборка.Товары.Выгрузить();                                      
		ВременнаяТаблицаУслуги = Выборка.Услуги.Выгрузить();   
		СтавкаНСП = ВременнаяТаблицаТовары.Скопировать();
 		СтавкаНСП.Свернуть("СтавкаНСП", "СуммаНСП");
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		
		УправлениеЗапасами.ЗаполнитьШапкуСчетФактураНДС(Выборка, ОбластьМакета);
		
		
		ТабличныйДокумент.Вывести(ОбластьМакета);  

		ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокТаблицы");	                             
		ТабличныйДокумент.Вывести(ОбластьМакета);

		//////////////////////ТабЧасть НАЧАЛО/////////////////////////////////////
		ДанныеПечати = Новый Структура;
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");	 
		Для Каждого Стр Из ВременнаяТаблицаТовары Цикл 
			ОбластьМакета.Параметры.Заполнить(Стр);
			ДанныеПечати.Вставить("Всего",стр.Доход+стр.СуммаНДС);
			ДанныеПечати.Вставить("СтавкаНДС",Выборка.Ставка);
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		КонецЦикла;	
		Для Каждого Стр Из ВременнаяТаблицаУслуги Цикл 
			ОбластьМакета.Параметры.Заполнить(Стр);
			ДанныеПечати.Вставить("Всего",стр.Доход+стр.СуммаНДС);
			ДанныеПечати.Вставить("СтавкаНДС",Выборка.Ставка);
			ДанныеПечати.Вставить("СтавкаНСП", стр.СтавкаНСП);
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		КонецЦикла;	  		
		
		// Выборка из регистра накопления "Реализация"
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Реализация.Номенклатура,
		|	Реализация.СтавкаНДС,
		|	Реализация.СтавкаНСП,
		|	Реализация.Доход,
		|	Реализация.СуммаНДС,
		|	Реализация.СуммаНСП,
		|	Реализация.СуммаСкидки,
		|	Реализация.Количество,
		|	Реализация.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	СтавкиНСПСрезПоследних.СтавкаНСП КАК СтавкаНСП1,
		|	СтавкиНСПСрезПоследних.СтавкаПлательщикНДС,
		|	СтавкиНСПСрезПоследних.СтавкаНеПлательщикНДС
		|ИЗ
		|	РегистрНакопления.Реализация КАК Реализация
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНСП.СрезПоследних КАК СтавкиНСПСрезПоследних
		|		ПО Реализация.СтавкаНСП = СтавкиНСПСрезПоследних.СтавкаНСП
		|ГДЕ
		|	Реализация.Регистратор = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Реализация.НомерСтроки
		|АВТОУПОРЯДОЧИВАНИЕ";	
		
		Запрос.УстановитьПараметр("Ссылка",	МассивОбъектов[0].Ссылка);	
		Результат = Запрос.Выполнить();
		ТЗ = Результат.Выгрузить();
		НСП  =ВременнаяТаблицаТовары.Итог("СуммаНСП")+ВременнаяТаблицаУслуги.Итог("СуммаНСП");
		
		Если ТЗ.Итог("СуммаСкидки")<>0 Тогда		
			Доход=ВременнаяТаблицаТовары.Итог("Доход")+ВременнаяТаблицаУслуги.Итог("Доход")-тз.Итог("Доход");
			НДС  =ВременнаяТаблицаТовары.Итог("СуммаНДС")+ВременнаяТаблицаУслуги.Итог("СуммаНДС")-тз.Итог("СуммаНДС");
			
			
			ОбластьМакета = Макет.ПолучитьОбласть("Строка");	 
			ДанныеПечати.Вставить("Номенклатура", "Скидка");
			ДанныеПечати.Вставить("Доход",-Доход);
			ДанныеПечати.Вставить("СуммаНДС",-НДС);
			ДанныеПечати.Вставить("Всего",-Доход-НДС);
			
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		КонецЕсли;				
		//////////////////////ТабЧасть КОНЕЦ/////////////////////////////////////
		
		////////////////////////Итоги и подвал НАЧАЛО//////////////////////
		ОбластьМакета = Макет.ПолучитьОбласть("Итого");
		ОбластьМакета.Параметры.ИтогоКоличество = тз.Итог("Количество");
		ОбластьМакета.Параметры.ИтогоСумма = тз.Итог("Доход");
		ОбластьМакета.Параметры.ИтогоСуммаНДС   = тз.Итог("СуммаНДС");
		ИтогоСндс = тз.Итог("Доход") +	тз.Итог("СуммаНДС");
		ОбластьМакета.Параметры.ИтогоСндс      = ИтогоСндс;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ИтогоНСП");
		ОбластьМакета.Параметры.ИтогоНСП = НСП;
		ДанныеОСтавкеПлательщикНДС = БухгалтерскийУчетСервер.ПолучитьСтавкуНСП(Выборка.Дата, Выборка.Ставка, стр.СтавкаНСП);
		ОбластьМакета.Параметры.СтавкаНСП = Строка(ДанныеОСтавкеПлательщикНДС.Ставка) + "%";
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ИтогоВсего");
		ИтогоВсего    = тз.Итог("Доход")+тз.Итог("СуммаНДС")+тз.Итог("СуммаНСП");
		ОбластьМакета.Параметры.ИтогоВсего    =  ИтогоВсего;
		ОбластьМакета.Параметры.СуммаПрописью =   БухгалтерскийУчетСервер.СформироватьСуммуПрописью(ИтогоВсего);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		Руководители 	= БухгалтерскийУчетСервер.ОтветственныеЛицаОрганизаций(Выборка.Организация, КонецДня(Выборка.Дата));
		ОбластьМакета.Параметры.ФИОРуководителя 	= Руководители.Руководитель;
		ОбластьМакета.Параметры.ФИОГлавногоБухгалтера    	= Руководители.ГлавныйБухгалтер;
		ТабличныйДокумент.Вывести(ОбластьМакета);   
		////////////////////////Итоги и подвал КОНЕЦ//////////////////////
		   
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
		
КонецФункции

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	// Устанавливаем признак доступности печати покомплектно.
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	// Проверяем, нужно ли для макета формировать табличный документ.
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Акт") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"Акт", НСтр("ru = 'Акт выполненных работ'"), ПечатьАкта(МассивОбъектов, ОбъектыПечати),,
			"Документ.РеализацияТоваровУслуг.Акт");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "НакладнаяНаСторону") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
		"НакладнаяНаСторону", НСтр("ru = Накладная на сторону'"), ПечатьНакладной(МассивОбъектов, ОбъектыПечати),,
		"Документ.РеализацияТоваровУслуг.НакладнаяНаСторону");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СчетФактураНДС") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
		"СчетФактураНДС", НСтр("ru = Счет-фактура по НДС'"), ПечатьСчетФактураНДС(МассивОбъектов, ОбъектыПечати),,
		"ОбщиеМакеты.СчетФактураНДС");
	КонецЕсли;		
		
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Акт";
	КомандаПечати.Представление = НСтр("ru = 'Акт выполненных работ'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.Порядок = 1;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "НакладнаяНаСторону";
	КомандаПечати.Представление = НСтр("ru = 'Накладная на сторону'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.Порядок = 5;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "СчетФактураНДС";
	КомандаПечати.Представление = НСтр("ru = 'Счет-фактура НДС'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.Порядок = 10;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли