
#Область ОбработчикиСобытийФормы

// Процедура - обработчик события ПриСозданииНаСервере.
// В процедуре осуществляется
// - инициализация реквизитов формы,
// - установка параметров функциональных опций формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("ФизЛицо") Тогда 
		ФизическоеЛицо = Параметры.ФизЛицо;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

&НаКлиенте
Процедура СписокПослеУдаления(Элемент)
	
	Если НЕ ФизическоеЛицо.Пустая() тогда
		Оповестить("ИзмененоФИО", ФизическоеЛицо);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти




