#Область ОбработчикиСобытийФормы

// Процедура - обработчик события ПриСозданииНаСервере.
// В процедуре осуществляется
// - инициализация реквизитов формы,
// - установка параметров функциональных опций формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СозданиеНового = Объект.Ссылка.Пустая();
	РедактированиеПериодическихСведений.ПрочитатьЗаписьДляРедактированияВФорме(ЭтаФорма, "КоэфицентыНалогаНаИмущество", Объект.Ссылка);
	РедактированиеПериодическихСведений.ПрочитатьНаборЗаписей(ЭтаФорма, "КоэфицентыНалогаНаИмущество", Объект.Ссылка);

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ДополнительныеСвойства = Новый Структура;
	
	Если СозданиеНового Тогда
		ДополнительныеСвойства.Вставить("ОтключитьПроверкуДатыЗапретаИзменения", Истина);
	КонецЕсли;
	
	РедактированиеПериодическихСведений.ЗаписатьНаборЗаписей(
		ЭтаФорма,
		"КоэфицентыНалогаНаИмущество",
		ТекущийОбъект.Ссылка,
		,
		ДополнительныеСвойства);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКоэфицентыНалогаНаИмуществоНаборЗаписей

&НаКлиенте
Процедура КоэфицентыНалогаНаИмуществоНаборЗаписейПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда 
		// получаем текущую строку
		СтрокаТабличнойЧасти = Элемент.ТекущиеДанные;
		
		// не удалось получить- возвращаемся
		Если СтрокаТабличнойЧасти = Неопределено Тогда 
			Возврат;
		КонецЕсли;
		
		СтрокаТабличнойЧасти.Период = ТекущаяДата();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти



