#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура - Заполнить по умолчанию
// Выполняет первоночальное заполнение
Процедура ЗаполнитьПоУмолчанию() Экспорт 
	СправочникМенеджер = Справочники.СтрокиОтчетаПоСФКвартальному;
	
	СправочникОбъект = Справочники.СтрокиОтчетаПоСФКвартальному.ЧисленостьРаботающихЧеловекВсего.ПолучитьОбъект();
	СправочникОбъект.НомерСтроки = 1;
	БухгалтерскийУчетКлиентСервер.ЗаписатьСправочникОбъект(СправочникОбъект);
	
	СправочникОбъект = СправочникМенеджер.ФондПотребленияНаКоторыйНачисленыВзносыФОТВТомЧисле.ПолучитьОбъект();
	СправочникОбъект.НомерСтроки = 2;
	БухгалтерскийУчетКлиентСервер.ЗаписатьСправочникОбъект(СправочникОбъект);
	
	СправочникОбъект = СправочникМенеджер.ФондПотребленияИнвалидов1И2Группы.ПолучитьОбъект();
	СправочникОбъект.НомерСтроки = 3;
	БухгалтерскийУчетКлиентСервер.ЗаписатьСправочникОбъект(СправочникОбъект);

	СправочникОбъект = СправочникМенеджер.КоличествоИнвалидов1И2Группы.ПолучитьОбъект();
	СправочникОбъект.НомерСтроки = 4;
	БухгалтерскийУчетКлиентСервер.ЗаписатьСправочникОбъект(СправочникОбъект);
	
	СправочникОбъект = СправочникМенеджер.ФондПотребленияИностранныхГражданВременноПребывающихВКР.ПолучитьОбъект();
	СправочникОбъект.НомерСтроки = 5;
	БухгалтерскийУчетКлиентСервер.ЗаписатьСправочникОбъект(СправочникОбъект);
	
	СправочникОбъект = СправочникМенеджер.КолвоИнострГражданВременноПребыващихВКР.ПолучитьОбъект();
	СправочникОбъект.НомерСтроки = 6;
	БухгалтерскийУчетКлиентСервер.ЗаписатьСправочникОбъект(СправочникОбъект);
	
	СправочникОбъект = СправочникМенеджер.Фонд64_69.ПолучитьОбъект();
	СправочникОбъект.НомерСтроки = 7;
	БухгалтерскийУчетКлиентСервер.ЗаписатьСправочникОбъект(СправочникОбъект);
	
	СправочникОбъект = СправочникМенеджер.Кол64_69.ПолучитьОбъект();
	СправочникОбъект.НомерСтроки = 8;
	БухгалтерскийУчетКлиентСервер.ЗаписатьСправочникОбъект(СправочникОбъект);
	
	СправочникОбъект = СправочникМенеджер.ФондПотреблПенсионеров.ПолучитьОбъект();
	СправочникОбъект.НомерСтроки = 9;
	БухгалтерскийУчетКлиентСервер.ЗаписатьСправочникОбъект(СправочникОбъект);
	
	СправочникОбъект = СправочникМенеджер.КолвоПенсионеров.ПолучитьОбъект();
	СправочникОбъект.НомерСтроки = 10;
	БухгалтерскийУчетКлиентСервер.ЗаписатьСправочникОбъект(СправочникОбъект);
	
	СправочникОбъект = СправочникМенеджер.ФондПотрУчастнИнвалидовВОВ.ПолучитьОбъект();
	СправочникОбъект.НомерСтроки = 11;
	БухгалтерскийУчетКлиентСервер.ЗаписатьСправочникОбъект(СправочникОбъект);
	
	СправочникОбъект = СправочникМенеджер.КолУчастИнвалидовВОВ.ПолучитьОбъект();
	СправочникОбъект.НомерСтроки = 12;
	БухгалтерскийУчетКлиентСервер.ЗаписатьСправочникОбъект(СправочникОбъект);
	
	СправочникОбъект = СправочникМенеджер.ФондПотрМОП.ПолучитьОбъект();
	СправочникОбъект.НомерСтроки = 13;
	БухгалтерскийУчетКлиентСервер.ЗаписатьСправочникОбъект(СправочникОбъект);
	
	СправочникОбъект = СправочникМенеджер.КолвоМОП.ПолучитьОбъект();
	СправочникОбъект.НомерСтроки = 14;
	БухгалтерскийУчетКлиентСервер.ЗаписатьСправочникОбъект(СправочникОбъект);
	
	СправочникОбъект = СправочникМенеджер.Гонорар.ПолучитьОбъект();
	СправочникОбъект.НомерСтроки = 15;
	БухгалтерскийУчетКлиентСервер.ЗаписатьСправочникОбъект(СправочникОбъект);
	
	СправочникОбъект = СправочникМенеджер.КолвоПолучГонорар.ПолучитьОбъект();
	СправочникОбъект.НомерСтроки = 16;
	БухгалтерскийУчетКлиентСервер.ЗаписатьСправочникОбъект(СправочникОбъект);

	СправочникОбъект = СправочникМенеджер.ДополнительныйФондОплатыТруда.ПолучитьОбъект();
	СправочникОбъект.НомерСтроки = 17;
	БухгалтерскийУчетКлиентСервер.ЗаписатьСправочникОбъект(СправочникОбъект);
	   	   
КонецПроцедуры // ЗаполнитьПоУмолчанию()	

#КонецОбласти

#КонецЕсли

