#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиОбновления

Процедура ПерезаполнитьКонстантуИспользоватьНесколькоНоменклатурныхГрупп() Экспорт
	
	МенеджерКонстанты = Константы.ИспользоватьНесколькоНоменклатурныхГрупп.СоздатьМенеджерЗначения();
	МенеджерКонстанты.Значение = Истина;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(МенеджерКонстанты);
	
КонецПроцедуры

#КонецОбласти

#Область ИспользоватьНесколькоНоменклатурныхГрупп

Процедура ПроверитьЗначениеОпцииИспользоватьНесколькоНоменклатурныхГрупп() Экспорт

	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоНоменклатурныхГрупп") И КоличествоНоменклатурныхГрупп() > 1 Тогда
	
		УстановитьПривилегированныйРежим(Истина);
		Константы.ИспользоватьНесколькоНоменклатурныхГрупп.Установить(Истина);
		ОбновитьПовторноИспользуемыеЗначения();
	
	КонецЕсли;

КонецПроцедуры

Функция КоличествоНоменклатурныхГрупп()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(*) КАК Количество
		|ИЗ
		|	Справочник.НоменклатурныеГруппы КАК НоменклатурныеГруппы
		|ГДЕ
		|	НЕ НоменклатурныеГруппы.ЭтоГруппа";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Количество = Выборка.Количество;
	Иначе
		Количество = 0;
	КонецЕсли;
	
	Возврат Количество;
	
КонецФункции

#КонецОбласти

#КонецЕсли