#Область ОбработчикиСобытийФормы

// Процедура - обработчик события ПриСозданииНаСервере.
// В процедуре осуществляется
// - инициализация реквизитов формы,
// - установка параметров функциональных опций формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Параметры.Свойство("УникальныйИдентификаторФормыВладельца", УникальныйИдентификаторФормыВладельца);
	
	СписокДокументов.Параметры.УстановитьЗначениеПараметра("Организация", Параметры.Организация);
	СписокДокументов.Параметры.УстановитьЗначениеПараметра("Дата", Параметры.ДатаДокумента);
	СписокДокументов.Параметры.УстановитьЗначениеПараметра("ДатаНачала", НачалоДня(Параметры.ДатаОтбор));
	СписокДокументов.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", КонецДня(Параметры.ДатаОтбор));
	
	Если ЗначениеЗаполнено(Параметры.Контрагент) Тогда
		СписокДокументов.Параметры.УстановитьЗначениеПараметра("ИспользоватьОтборКонтрагента", Истина);
		СписокДокументов.Параметры.УстановитьЗначениеПараметра("Контрагент", Параметры.Контрагент);
		СписокДокументов.Параметры.УстановитьЗначениеПараметра("ИспользоватьОтборВалюты", Истина);
		СписокДокументов.Параметры.УстановитьЗначениеПараметра("Валюта", Параметры.Валюта);
	Иначе
		СписокДокументов.Параметры.УстановитьЗначениеПараметра("ИспользоватьОтборКонтрагента", Ложь);
		СписокДокументов.Параметры.УстановитьЗначениеПараметра("Контрагент", Справочники.Контрагенты.ПустаяСсылка());
		СписокДокументов.Параметры.УстановитьЗначениеПараметра("ИспользоватьОтборВалюты", Ложь);
		СписокДокументов.Параметры.УстановитьЗначениеПараметра("Валюта", Справочники.Валюты.ПустаяСсылка());
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Параметры.Договор) Тогда
		СписокДокументов.Параметры.УстановитьЗначениеПараметра("ИспользоватьОтборДоговора", Истина);
		СписокДокументов.Параметры.УстановитьЗначениеПараметра("ДоговорКонтрагента", Параметры.Договор);
		СписокДокументов.Параметры.УстановитьЗначениеПараметра("ИспользоватьОтборДопЕдиницы", Истина);
		СписокДокументов.Параметры.УстановитьЗначениеПараметра("ИспользоватьДопЕдиницы", Параметры.ИспользоватьДопЕдиницы);
	Иначе	
		СписокДокументов.Параметры.УстановитьЗначениеПараметра("ИспользоватьОтборДоговора", Ложь);
		СписокДокументов.Параметры.УстановитьЗначениеПараметра("ДоговорКонтрагента", Справочники.ДоговорыКонтрагентов.ПустаяСсылка());
		СписокДокументов.Параметры.УстановитьЗначениеПараметра("ИспользоватьОтборДопЕдиницы", Ложь);
		СписокДокументов.Параметры.УстановитьЗначениеПараметра("ИспользоватьДопЕдиницы", Параметры.ИспользоватьДопЕдиницы);
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокДокументовВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("МассивДокументов", 	Значение);
	Оповестить("ПодборДокументаПоступления", СтруктураВозврата, УникальныйИдентификаторФормыВладельца);
	Закрыть();
КонецПроцедуры

#КонецОбласти
