#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция - возвращает событие ОС по виду событий
//
// Параметры:
//  ВидСобытия	 - ПеречислениеСсылка.ВидыСобытийОС	 - Вид события ОС для отбора
// 
Функция СобытиеПоВидуСобытий(ВидСобытия) Экспорт 
	Событие = Справочники.СобытияОС.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СобытияОС.Ссылка КАК Событие
		|ИЗ
		|	Справочник.СобытияОС КАК СобытияОС
		|ГДЕ
		|	СобытияОС.ВидСобытияОС = &ВидСобытия
		|	И НЕ СобытияОС.ПометкаУдаления";
	Запрос.УстановитьПараметр("ВидСобытия", ВидСобытия);	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Событие = ВыборкаДетальныеЗаписи.Событие;
	КонецЕсли;
	
	Возврат Событие;
	
КонецФункции // СобытиеПоВидуСобытий()

#КонецОбласти

#КонецЕсли