#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Процедура - Заполнить по умолчанию
// Выполняет первоночальное заполнение
Процедура ЗаполнитьПоУмолчанию() Экспорт 
	СправочникМенеджер = Справочники.Номенклатура;
	
	КлассификаторXML = РегистрыСведений.СчетаУчетаНоменклатуры.ПолучитьМакет("МакетЗаполнения").ПолучитьТекст();
	КлассификаторТаблица = ОбщегоНазначения.ПрочитатьXMLВТаблицу(КлассификаторXML).Данные;
	
	НаборЗаписей = РегистрыСведений.СчетаУчетаНоменклатуры.СоздатьНаборЗаписей();
	НаборЗаписей.Очистить();                 
	
	Для Каждого СтрокаТаблицыЗначений Из КлассификаторТаблица Цикл
		Наименование = СокрЛП(СтрокаТаблицыЗначений.Наименование);
		Код = СокрЛП(СтрокаТаблицыЗначений.Код);
		СтруктураСчетаУчетаНоменклатуры = Новый Структура;
		СтруктураСчетаУчетаНоменклатуры.Вставить("СчетБУ",ПланыСчетов.Хозрасчетный.НайтиПоКоду(СтрокаТаблицыЗначений.СчетБУ));
		СтруктураСчетаУчетаНоменклатуры.Вставить("СчетДоходов",ПланыСчетов.Хозрасчетный.НайтиПоКоду(СтрокаТаблицыЗначений.СчетДоходов));
		СтруктураСчетаУчетаНоменклатуры.Вставить("СчетУчетаЗабалансовый",ПланыСчетов.Хозрасчетный.НайтиПоКоду(СтрокаТаблицыЗначений.СчетУчетаЗабалансовый));
		СтруктураСчетаУчетаНоменклатуры.Вставить("СчетПередачи",ПланыСчетов.Хозрасчетный.НайтиПоКоду(СтрокаТаблицыЗначений.СчетПередачи));
		СтруктураСчетаУчетаНоменклатуры.Вставить("СчетПередачиЗабалансовый",ПланыСчетов.Хозрасчетный.НайтиПоКоду(СтрокаТаблицыЗначений.СчетПередачиЗабалансовый));
       		
		Если СтрокаТаблицыЗначений.Наименование = "Готовая продукция" Тогда
			СправочникСсылка = Справочники.Номенклатура.ГотоваяПродукция;
		ИначеЕсли СтрокаТаблицыЗначений.Наименование = "Материалы"  Тогда
			СправочникСсылка = Справочники.Номенклатура.Материалы;
		ИначеЕсли СтрокаТаблицыЗначений.Наименование = "МБП"  Тогда
			СправочникСсылка = Справочники.Номенклатура.МБП;
		ИначеЕсли СтрокаТаблицыЗначений.Наименование = "Товары"  Тогда
			СправочникСсылка = Справочники.Номенклатура.Товары;
		ИначеЕсли СтрокаТаблицыЗначений.Наименование = "Услуги"  Тогда
			СправочникСсылка = Справочники.Номенклатура.Услуги;
		Иначе 
			СправочникСсылка = Справочники.Номенклатура.ПустаяСсылка();
		КонецЕсли;
		
		НоваяЗапись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, СтруктураСчетаУчетаНоменклатуры); 
		НоваяЗапись.Номенклатура = СправочникСсылка;
	КонецЦикла;
	
	Попытка
		НаборЗаписей.Записать();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры // ЗаполнитьПоУмолчанию()	

#КонецОбласти

#КонецЕсли