#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыПроведенияДокумента

Процедура СформироватьТаблицаСтавкиНалогаНаТранспорт(ДокументСсылка, СтруктураДополнительныеСвойства) 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаДокумента.Период,
		|	ТаблицаДокумента.ВидТранспорта,
		|	ТаблицаДокумента.ОтЛет,
		|	ТаблицаДокумента.ДоЛет,
		|	ТаблицаДокумента.Ставка
		|ИЗ
		|	ВременнаяТаблицаСтавкиНалогаНаТранспорт КАК ТаблицаДокумента";
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСтавкиНалогаНаТранспорт", РезультатЗапроса.Выгрузить());
		
КонецПроцедуры      

Процедура СформироватьТаблицаОценочнаяСтоимостьПоВидамМатериалов(ДокументСсылка, СтруктураДополнительныеСвойства) 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаДокумента.Период,
		|	ТаблицаДокумента.ВидМатериала КАК МатериалСтен,
		|	ТаблицаДокумента.ОтЛет,
		|	ТаблицаДокумента.ДоЛет,
		|	ТаблицаДокумента.Стоимость
		|ИЗ
		|	ВременнаяТаблицаОценочнаяСтоимостьПоВидамМатериалов КАК ТаблицаДокумента";
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОценочнаяСтоимостьПоВидамМатериалов", РезультатЗапроса.Выгрузить());
		
КонецПроцедуры   

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст = "";  
	
	Запрос.Текст =
			"ВЫБРАТЬ
			|	УстановкаПараметровРасчетаНалогаНаИмуществоТранспорт.Ссылка.Дата КАК Период,
			|	УстановкаПараметровРасчетаНалогаНаИмуществоТранспорт.ВидТранспорта,
			|	УстановкаПараметровРасчетаНалогаНаИмуществоТранспорт.ОтЛет,
			|	УстановкаПараметровРасчетаНалогаНаИмуществоТранспорт.ДоЛет,
			|	УстановкаПараметровРасчетаНалогаНаИмуществоТранспорт.Ставка
			|ПОМЕСТИТЬ ВременнаяТаблицаСтавкиНалогаНаТранспорт
			|ИЗ
			|	Документ.УстановкаПараметровРасчетаНалогаНаИмущество.Транспорт КАК УстановкаПараметровРасчетаНалогаНаИмуществоТранспорт
			|ГДЕ
			|	УстановкаПараметровРасчетаНалогаНаИмуществоТранспорт.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	УстановкаПараметровРасчетаНалогаНаИмуществоНедвижимость.Ссылка.Дата КАК Период,
			|	УстановкаПараметровРасчетаНалогаНаИмуществоНедвижимость.ОтЛет,
			|	УстановкаПараметровРасчетаНалогаНаИмуществоНедвижимость.ДоЛет,
			|	УстановкаПараметровРасчетаНалогаНаИмуществоНедвижимость.ВидМатериалаСтен КАК ВидМатериала,
			|	УстановкаПараметровРасчетаНалогаНаИмуществоНедвижимость.Стоимость
			|ПОМЕСТИТЬ ВременнаяТаблицаОценочнаяСтоимостьПоВидамМатериалов
			|ИЗ
			|	Документ.УстановкаПараметровРасчетаНалогаНаИмущество.Недвижимость КАК УстановкаПараметровРасчетаНалогаНаИмуществоНедвижимость
			|ГДЕ
			|	УстановкаПараметровРасчетаНалогаНаИмуществоНедвижимость.Ссылка = &Ссылка";
			
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
		Запрос.УстановитьПараметр("Период", ДокументСсылка.Дата);
		Запрос.Выполнить();        		
	
	СформироватьТаблицаСтавкиНалогаНаТранспорт(ДокументСсылка, СтруктураДополнительныеСвойства); 
	СформироватьТаблицаОценочнаяСтоимостьПоВидамМатериалов(ДокументСсылка, СтруктураДополнительныеСвойства);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

#КонецОбласти

#КонецЕсли
