
#Область ПрограммныйИнтерфейс

// Функция - Формат цены
//
// Параметры:
//  ТочностьЦены - Число	- Точность цены, для которой нужно получить формат
// 
// Возвращаемое значение:
//  Строка для установки формата
//
Функция ФорматЦены(ТочностьЦены) Экспорт

	Результат = "ЧЦ=15; ЧДЦ=2";
	
	Если ТочностьЦены = 3 Тогда
		Результат = "ЧЦ=15; ЧДЦ=3";
	ИначеЕсли ТочностьЦены = 4 Тогда
		Результат = "ЧЦ=15; ЧДЦ=4";
	ИначеЕсли ТочностьЦены = 5 Тогда
		Результат = "ЧЦ=15; ЧДЦ=5";
	ИначеЕсли ТочностьЦены = 6 Тогда
		Результат = "ЧЦ=15; ЧДЦ=6";
	ИначеЕсли ТочностьЦены = 7 Тогда
		Результат = "ЧЦ=15; ЧДЦ=7";
	ИначеЕсли ТочностьЦены = 8 Тогда
		Результат = "ЧЦ=15; ЧДЦ=8";
	КонецЕсли;	

	Возврат Результат;
	
КонецФункции

#КонецОбласти


