#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Функция ТекстЗапросаДанныеДляОбновленияЦенДокументов() Экспорт
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаДокумента.Номенклатура КАК Номенклатура,
		|	ТаблицаДокумента.Цена КАК Цена,
		|	&Валюта КАК Валюта,
		|	&СпособЗаполненияЦены КАК СпособЗаполненияЦены,
		|	&ЦенаВключаетНалоги КАК ЦенаВключаетНалоги
		|ПОМЕСТИТЬ ТаблицаНоменклатуры
		|ИЗ
		|	Документ.ВозвратТоваровПоставщику.Товары КАК ТаблицаДокумента
		|ГДЕ
		|	ТаблицаДокумента.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаДокумента.Номенклатура,
		|	ТаблицаДокумента.Цена,
		|	&Валюта,
		|	&СпособЗаполненияЦены,
		|	&ЦенаВключаетНалоги
		|ИЗ
		|	Документ.ВозвратТоваровПоставщику.Услуги КАК ТаблицаДокумента
		|ГДЕ
		|	ТаблицаДокумента.Ссылка = &Ссылка";
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияБПСервер.ТекстРазделителяЗапросовПакета();
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти
	
#Область ПроцедурыПроведенияДокумента

// Формирует таблицу значений, содержащую данные для проведения по регистру бухгалтерии Хозрасчетный.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаХозрасчетный(ДокументСсылка, СтруктураДополнительныеСвойства, Отказ)
	
	ПрямыеПроводки = ДокументСсылка.ПрямыеПроводки;
	
	// Подготовка данных	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.Ссылка КАК Регистратор,
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаШапка.Склад КАК Склад,
		|	ВременнаяТаблицаШапка.Контрагент КАК Контрагент,
		|	ВременнаяТаблицаШапка.ВалютаДокумента КАК ВалютаВзаиморасчетов,
		|	&Содержание КАК Содержание
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	""Товары"" КАК ИмяСписка,
		|	&СинонимСписка КАК СинонимСписка,
		|	ВременнаяТаблицаТовары.НомерСтроки КАК НомерСтроки,
		|	ВременнаяТаблицаТовары.СчетУчета КАК СчетУчета,
		|	ВременнаяТаблицаТовары.Номенклатура КАК Номенклатура,
		|	ВременнаяТаблицаШапка.Склад КАК Склад,
		|	НЕОПРЕДЕЛЕНО КАК Партия,
		|	0 КАК Себестоимость,
		|	ВременнаяТаблицаТовары.Количество КАК Количество,
		|	ВременнаяТаблицаШапка.СчетРасчетов КАК КорСчетСписания,
		|	ВременнаяТаблицаШапка.Контрагент КАК КорСубконто1,
		|	ВременнаяТаблицаШапка.ДоговорКонтрагента КАК КорСубконто2,
		|	НЕОПРЕДЕЛЕНО КАК КорСубконто3,
		|	0 КАК СуммаСписания,
		|	&Содержание КАК Содержание,
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	НЕОПРЕДЕЛЕНО КАК ДокументОприходования,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|			ТОГДА ВременнаяТаблицаТовары.Сумма - ВременнаяТаблицаТовары.СуммаАкциза
		|		ИНАЧЕ ВЫРАЗИТЬ(ВременнаяТаблицаТовары.Сумма * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность КАК ЧИСЛО(15, 2))
		|	КОНЕЦ КАК Сумма,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|			ТОГДА ВЫРАЗИТЬ((ВременнаяТаблицаТовары.Сумма - ВременнаяТаблицаТовары.СуммаАкциза) / ВременнаяТаблицаШапка.Курс * ВременнаяТаблицаШапка.Кратность КАК ЧИСЛО(15, 2))
		|		ИНАЧЕ ВременнаяТаблицаТовары.Сумма
		|	КОНЕЦ КАК СуммаВзаиморасчетов,
		|	ИСТИНА КАК СебестоимостьУказанаВДокументе
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаТовары КАК ВременнаяТаблицаТовары
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВременнаяТаблицаТовары.СчетУчета <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МБП)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	""Товары"" КАК ИмяСписка,
		|	&СинонимСписка КАК СинонимСписка,
		|	ВременнаяТаблицаТовары.НомерСтроки КАК НомерСтроки,
		|	ВременнаяТаблицаТовары.СчетУчета КАК СчетУчета,
		|	ВременнаяТаблицаТовары.Номенклатура КАК Номенклатура,
		|	ВременнаяТаблицаШапка.Склад КАК Склад,
		|	НЕОПРЕДЕЛЕНО КАК Партия,
		|	0 КАК Себестоимость,
		|	ВременнаяТаблицаТовары.Количество КАК Количество,
		|	ВременнаяТаблицаШапка.СчетРасчетов КАК КорСчетСписания,
		|	ВременнаяТаблицаШапка.Контрагент КАК КорСубконто1,
		|	ВременнаяТаблицаШапка.ДоговорКонтрагента КАК КорСубконто2,
		|	НЕОПРЕДЕЛЕНО КАК КорСубконто3,
		|	0 КАК СуммаСписания,
		|	&Содержание КАК Содержание,
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	НЕОПРЕДЕЛЕНО КАК ДокументОприходования,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|			ТОГДА ВременнаяТаблицаТовары.Сумма - ВременнаяТаблицаТовары.СуммаАкциза
		|		ИНАЧЕ ВЫРАЗИТЬ(ВременнаяТаблицаТовары.Сумма * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность КАК ЧИСЛО(15, 2))
		|	КОНЕЦ КАК Сумма,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|			ТОГДА ВЫРАЗИТЬ((ВременнаяТаблицаТовары.Сумма - ВременнаяТаблицаТовары.СуммаАкциза) / ВременнаяТаблицаШапка.Курс * ВременнаяТаблицаШапка.Кратность КАК ЧИСЛО(15, 2))
		|		ИНАЧЕ ВременнаяТаблицаТовары.Сумма
		|	КОНЕЦ КАК СуммаВзаиморасчетов,
		|	ИСТИНА КАК СебестоимостьУказанаВДокументе
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаТовары КАК ВременнаяТаблицаТовары
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВременнаяТаблицаТовары.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МБП)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	Запрос.УстановитьПараметр("Содержание", НСтр("ru = 'Возврат товаров поставщику'")); 
	Запрос.УстановитьПараметр("СинонимСписка", НСтр("ru = 'Товары'"));
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ТаблицаРеквизиты = МассивРезультатов[0].Выгрузить(); 
	ТаблицаТовары 	 = МассивРезультатов[1].Выгрузить();
	ТаблицаМБП 		 = МассивРезультатов[2].Выгрузить();
	
	ТаблицаСписанныеТовары 	= УчетТоваров.ПодготовитьТаблицуСписанныеТовары(ТаблицаТовары, ТаблицаРеквизиты, Отказ);
	ТаблицаСписанныеМБП 	= УчетМБП.ПодготовитьТаблицуСписанныеМБП(ТаблицаМБП, ТаблицаРеквизиты, Отказ);
	
	МассивЧисло = Новый Массив;
	МассивЧисло.Добавить(Тип("Число"));
	
	ТаблицаСписанныеТовары.Колонки.Добавить("СуммаАкциза", Новый ОписаниеТипов(МассивЧисло, Новый КвалификаторыЧисла(15, 2)));
	ТаблицаСписанныеМБП.Колонки.Добавить("СуммаАкциза", Новый ОписаниеТипов(МассивЧисло, Новый КвалификаторыЧисла(15, 2)));
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВременнаяТаблицаТовары.Номенклатура КАК Номенклатура,
		|	ВременнаяТаблицаТовары.СуммаАкциза КАК СуммаАкциза
		|ИЗ
		|	ВременнаяТаблицаТовары КАК ВременнаяТаблицаТовары
		|ГДЕ
		|	ВременнаяТаблицаТовары.СуммаАкциза > 0";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 0 Тогда
		Пока Выборка.Следующий() Цикл	
			МассивСтрок = ТаблицаСписанныеТовары.НайтиСтроки(Новый Структура("Номенклатура", Выборка.Номенклатура));
			
			Если МассивСтрок.Количество() = 0 Тогда
				МассивСтрок = ТаблицаСписанныеМБП.НайтиСтроки(Новый Структура("Номенклатура", Выборка.Номенклатура));	
			КонецЕсли;	
			
			МассивКоэффициентов = Новый Массив();
			
			Для Каждого СтрокаМассива Из МассивСтрок Цикл
				МассивКоэффициентов.Добавить(СтрокаМассива.СуммаСписания);	
			КонецЦикла;	
				
			МассивСумм 	= ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(Выборка.СуммаАкциза, МассивКоэффициентов);
			Индекс 		= 0;
			
			Для Каждого СтрокаМассива Из МассивСумм Цикл
				МассивСтрок[Индекс].СуммаАкциза = СтрокаМассива;
				МассивСтрок[Индекс].СуммаСписания = МассивСтрок[Индекс].СуммаСписания - СтрокаМассива;
				Индекс = Индекс + 1;
			КонецЦикла;	
		КонецЦикла;	
	КонецЕсли;
	
	// Если проводки не прямые, т.е. 1610-3110 то суммы записываются с минусом, т.к. это возврат.
	// Также необходимо поменять местами счета и их субконто, это делается в общем модуле 
	// "УчетТоваров", процедура "СформироватьДвиженияВозвратТоваровПоставщику".
	Если НЕ ПрямыеПроводки Тогда	
		Для Каждого СтрокаТаблицы Из ТаблицаСписанныеТовары Цикл	
			СтрокаТаблицы.СуммаСписания = -СтрокаТаблицы.СуммаСписания;
			СтрокаТаблицы.Количество	= -СтрокаТаблицы.Количество;
		КонецЦикла;
		
		Для Каждого СтрокаТаблицы Из ТаблицаСписанныеМБП Цикл	
			СтрокаТаблицы.СуммаСписания = -СтрокаТаблицы.СуммаСписания;
			СтрокаТаблицы.Количество	= -СтрокаТаблицы.Количество;
		КонецЦикла;
	КонецЕсли;	
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРеквизиты", ТаблицаРеквизиты);
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаТовары", ТаблицаТовары);
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСписанныеТовары", ТаблицаСписанныеТовары);
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаМБП", ТаблицаМБП);
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСписанныеМБП", ТаблицаСписанныеМБП);

	// Корректировка себестоимости и НДС
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		// 1 и 2. Распределение сумм на себестоимость и сумму НДС		
		// 3. Итог сумм по пункту 1-2
		// 4. СуммаСписания из сформированной таблиц "ТаблицаСписанныеТовары" 
		// 5 и 6. СуммаСписания из временных таблиц "ТаблицаСписанныеТоварыПредварительно" и "ТаблицаСписанныеУслуги"
		// 7. Итог по СуммаСписания из 4-5 пункта
		// 8. Соединение пункта 3 и данных из шапки документа
		// 9. Формирование данных для проводок по возврату услуг, корректировки себестоимости возвращаемых товаров и по НДС
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаТовары.ЗачетНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Себестоимость)
		|				И &УказыватьПризнакЗачетаНДС
		|			ТОГДА ВременнаяТаблицаТовары.Сумма + ВременнаяТаблицаТовары.СуммаНДС + ВременнаяТаблицаТовары.СуммаНСП
		|		ИНАЧЕ ВременнаяТаблицаТовары.Сумма + ВременнаяТаблицаТовары.СуммаНСП
		|	КОНЕЦ КАК Сумма,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаТовары.ЗачетНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Себестоимость)
		|				И &УказыватьПризнакЗачетаНДС
		|			ТОГДА 0
		|		ИНАЧЕ ВременнаяТаблицаТовары.СуммаНДС
		|	КОНЕЦ КАК СуммаНДС,
		|	ВременнаяТаблицаТовары.СуммаАкциза КАК СуммаАкциза
		|ПОМЕСТИТЬ ВременнаяТаблицаРаспределенныеСуммы
		|ИЗ
		|	ВременнаяТаблицаТовары КАК ВременнаяТаблицаТовары
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаУслуги.ЗачетНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Себестоимость)
		|				И &УказыватьПризнакЗачетаНДС
		|			ТОГДА ВременнаяТаблицаУслуги.Сумма + ВременнаяТаблицаУслуги.СуммаНДС + ВременнаяТаблицаУслуги.СуммаНСП
		|		ИНАЧЕ ВременнаяТаблицаУслуги.Сумма + ВременнаяТаблицаУслуги.СуммаНСП
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаУслуги.ЗачетНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Себестоимость)
		|				И &УказыватьПризнакЗачетаНДС
		|			ТОГДА 0
		|		ИНАЧЕ ВременнаяТаблицаУслуги.СуммаНДС
		|	КОНЕЦ,
		|	ВременнаяТаблицаУслуги.СуммаАкциза
		|ИЗ
		|	ВременнаяТаблицаУслуги КАК ВременнаяТаблицаУслуги
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВременнаяТаблицаСуммы.Сумма) КАК Сумма,
		|	СУММА(ВременнаяТаблицаСуммы.СуммаНДС) КАК СуммаНДС,
		|	СУММА(ВременнаяТаблицаСуммы.СуммаАкциза) КАК СуммаАкциза
		|ПОМЕСТИТЬ ВременнаяТаблицаГотовыеСуммы
		|ИЗ
		|	ВременнаяТаблицаРаспределенныеСуммы КАК ВременнаяТаблицаСуммы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаСписанныеТовары.СуммаСписания КАК СуммаСписания,
		|	ТаблицаСписанныеТовары.СуммаАкциза КАК СуммаАкциза,
		|	ТаблицаСписанныеТовары.Номенклатура КАК Номенклатура,
		|	ТаблицаСписанныеТовары.СчетУчета КАК СчетУчета
		|ПОМЕСТИТЬ ВременнаяТаблицаСписанныеТоварыПредварительно
		|ИЗ
		|	&ТаблицаСписанныеТовары КАК ТаблицаСписанныеТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаСписанныеМБП.СуммаСписания КАК СуммаСписания,
		|	ТаблицаСписанныеМБП.СуммаАкциза КАК СуммаАкциза,
		|	ТаблицаСписанныеМБП.Номенклатура КАК Номенклатура,
		|	ТаблицаСписанныеМБП.СчетУчета КАК СчетУчета
		|ПОМЕСТИТЬ ВременнаяТаблицаСписанныеМБППредварительно
		|ИЗ
		|	&ТаблицаСписанныеМБП КАК ТаблицаСписанныеМБП
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИСТИНА КАК Товар,
		|	ТаблицаСписанныеТовары.СуммаСписания КАК Сумма,
		|	ТаблицаСписанныеТовары.СуммаАкциза КАК СуммаАкциза,
		|	ТаблицаСписанныеТовары.Номенклатура КАК Номенклатура,
		|	ТаблицаСписанныеТовары.СчетУчета КАК Счет,
		|	НЕОПРЕДЕЛЕНО КАК Субконто1,
		|	НЕОПРЕДЕЛЕНО КАК Субконто2,
		|	НЕОПРЕДЕЛЕНО КАК Субконто3
		|ПОМЕСТИТЬ ВременнаяТаблицаСписанныеТовары
		|ИЗ
		|	ВременнаяТаблицаСписанныеТоварыПредварительно КАК ТаблицаСписанныеТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИСТИНА,
		|	ТаблицаСписанныеМБП.СуммаСписания,
		|	ТаблицаСписанныеМБП.СуммаАкциза,
		|	ТаблицаСписанныеМБП.Номенклатура,
		|	ТаблицаСписанныеМБП.СчетУчета,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	ВременнаяТаблицаСписанныеМБППредварительно КАК ТаблицаСписанныеМБП
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛОЖЬ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВЫБОР
		|					КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|						ТОГДА ТаблицаСписанныеУслуги.Сумма - ТаблицаСписанныеУслуги.СуммаАкциза
		|					ИНАЧЕ ТаблицаСписанныеУслуги.Сумма
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|					ТОГДА -(ТаблицаСписанныеУслуги.Сумма - ТаблицаСписанныеУслуги.СуммаАкциза)
		|				ИНАЧЕ -ТаблицаСписанныеУслуги.Сумма
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ТаблицаСписанныеУслуги.СуммаАкциза,
		|	НЕОПРЕДЕЛЕНО,
		|	ТаблицаСписанныеУслуги.СчетРасходов,
		|	ТаблицаСписанныеУслуги.Субконто1,
		|	ТаблицаСписанныеУслуги.Субконто2,
		|	ТаблицаСписанныеУслуги.Субконто3
		|ИЗ
		|	ВременнаяТаблицаУслуги КАК ТаблицаСписанныеУслуги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВременнаяТаблицаСписанныеТовары.Сумма) КАК Сумма
		|ПОМЕСТИТЬ ВременнаяТаблицаСуммаСписанныхТоваров
		|ИЗ
		|	ВременнаяТаблицаСписанныеТовары КАК ВременнаяТаблицаСписанныеТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаШапка.СчетРасчетов КАК СчетРасчетов,
		|	ВременнаяТаблицаШапка.ПризнакСтраны КАК ПризнакСтраны,
		|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоВозвратамПоставщикам) КАК СчетРасходов,
		|	ВременнаяТаблицаШапка.Контрагент КАК Контрагент,
		|	ВременнаяТаблицаШапка.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ВременнаяТаблицаШапка.ВалютаДокумента КАК Валюта,
		|	ВременнаяТаблицаГотовыеСуммы.Сумма - ВременнаяТаблицаГотовыеСуммы.СуммаАкциза КАК Сумма,
		|	ВременнаяТаблицаШапка.Курс КАК Курс,
		|	ВременнаяТаблицаШапка.Кратность КАК Кратность,
		|	&СодержаниеКорректировка КАК Содержание
		|ПОМЕСТИТЬ ВременнаяТаблицаСуммаВозвратаСДанными
		|ИЗ
		|	ВременнаяТаблицаГотовыеСуммы КАК ВременнаяТаблицаГотовыеСуммы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВременнаяТаблицаШапка.СчетРасчетов
		|		ИНАЧЕ ВременнаяТаблицаУслуги.СчетРасходов
		|	КОНЕЦ КАК СчетДт,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВременнаяТаблицаУслуги.СчетРасходов
		|		ИНАЧЕ ВременнаяТаблицаШапка.СчетРасчетов
		|	КОНЕЦ КАК СчетКт,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВременнаяТаблицаШапка.Контрагент
		|		ИНАЧЕ ВременнаяТаблицаУслуги.Субконто1
		|	КОНЕЦ КАК СубконтоДт1,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВременнаяТаблицаШапка.ДоговорКонтрагента
		|		ИНАЧЕ ВременнаяТаблицаУслуги.Субконто2
		|	КОНЕЦ КАК СубконтоДт2,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ВременнаяТаблицаУслуги.Субконто3
		|	КОНЕЦ КАК СубконтоДт3,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВременнаяТаблицаУслуги.Субконто1
		|		ИНАЧЕ ВременнаяТаблицаШапка.Контрагент
		|	КОНЕЦ КАК СубконтоКт1,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВременнаяТаблицаУслуги.Субконто2
		|		ИНАЧЕ ВременнаяТаблицаШапка.ДоговорКонтрагента
		|	КОНЕЦ КАК СубконтоКт2,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВременнаяТаблицаУслуги.Субконто3
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК СубконтоКт3,
		|	ВременнаяТаблицаШапка.ВалютаДокумента КАК ВалютаДт,
		|	ВременнаяТаблицаШапка.ВалютаДокумента КАК ВалютаКт,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВЫБОР
		|					КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|						ТОГДА ВременнаяТаблицаУслуги.Сумма - ВременнаяТаблицаУслуги.СуммаАкциза
		|					ИНАЧЕ ВЫРАЗИТЬ(ВременнаяТаблицаУслуги.Сумма * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность КАК ЧИСЛО(15, 2))
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|					ТОГДА -(ВременнаяТаблицаУслуги.Сумма - ВременнаяТаблицаУслуги.СуммаАкциза)
		|				ИНАЧЕ -(ВЫРАЗИТЬ(ВременнаяТаблицаУслуги.Сумма * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность КАК ЧИСЛО(15, 2)))
		|			КОНЕЦ
		|	КОНЕЦ КАК Сумма,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВЫБОР
		|					КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|						ТОГДА ВЫРАЗИТЬ((ВременнаяТаблицаУслуги.Сумма - ВременнаяТаблицаУслуги.СуммаАкциза) / ВременнаяТаблицаШапка.Курс * ВременнаяТаблицаШапка.Кратность КАК ЧИСЛО(15, 2))
		|					ИНАЧЕ ВременнаяТаблицаУслуги.Сумма
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|					ТОГДА -(ВЫРАЗИТЬ((ВременнаяТаблицаУслуги.Сумма - ВременнаяТаблицаУслуги.СуммаАкциза) / ВременнаяТаблицаШапка.Курс * ВременнаяТаблицаШапка.Кратность КАК ЧИСЛО(15, 2)))
		|				ИНАЧЕ -ВременнаяТаблицаУслуги.Сумма
		|			КОНЕЦ
		|	КОНЕЦ КАК ВалютнаяСуммаДт,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВЫБОР
		|					КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|						ТОГДА ВЫРАЗИТЬ((ВременнаяТаблицаУслуги.Сумма - ВременнаяТаблицаУслуги.СуммаАкциза) / ВременнаяТаблицаШапка.Курс * ВременнаяТаблицаШапка.Кратность КАК ЧИСЛО(15, 2))
		|					ИНАЧЕ ВременнаяТаблицаУслуги.Сумма
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|					ТОГДА -(ВЫРАЗИТЬ((ВременнаяТаблицаУслуги.Сумма - ВременнаяТаблицаУслуги.СуммаАкциза) / ВременнаяТаблицаШапка.Курс * ВременнаяТаблицаШапка.Кратность КАК ЧИСЛО(15, 2)))
		|				ИНАЧЕ -ВременнаяТаблицаУслуги.Сумма
		|			КОНЕЦ
		|	КОНЕЦ КАК ВалютнаяСуммаКт,
		|	&СодержаниеВозвратУслуг КАК Содержание,
		|	ВременнаяТаблицаУслуги.Количество КАК КоличествоДт,
		|	ВременнаяТаблицаУслуги.Количество КАК КоличествоКт
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаУслуги КАК ВременнаяТаблицаУслуги
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВременнаяТаблицаУслуги.Сумма <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаСуммаВозвратаСДанными.Период,
		|	ТаблицаСуммаВозвратаСДанными.Организация,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ТаблицаСуммаВозвратаСДанными.СчетРасчетов
		|		ИНАЧЕ ТаблицаСуммаВозвратаСДанными.СчетРасходов
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ТаблицаСуммаВозвратаСДанными.СчетРасходов
		|		ИНАЧЕ ТаблицаСуммаВозвратаСДанными.СчетРасчетов
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ТаблицаСуммаВозвратаСДанными.Контрагент
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ТаблицаСуммаВозвратаСДанными.ДоговорКонтрагента
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	НЕОПРЕДЕЛЕНО,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ТаблицаСуммаВозвратаСДанными.Контрагент
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ТаблицаСуммаВозвратаСДанными.ДоговорКонтрагента
		|	КОНЕЦ,
		|	НЕОПРЕДЕЛЕНО,
		|	ТаблицаСуммаВозвратаСДанными.Валюта,
		|	ТаблицаСуммаВозвратаСДанными.Валюта,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ТаблицаСуммаВозвратаСДанными.Сумма - ТаблицаСуммаСписанныхТоваров.Сумма
		|		ИНАЧЕ -(ТаблицаСуммаВозвратаСДанными.Сумма + ТаблицаСуммаСписанныхТоваров.Сумма)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВЫРАЗИТЬ((ТаблицаСуммаВозвратаСДанными.Сумма - ТаблицаСуммаСписанныхТоваров.Сумма) / ТаблицаСуммаВозвратаСДанными.Курс * ТаблицаСуммаВозвратаСДанными.Кратность КАК ЧИСЛО(15, 2))
		|		ИНАЧЕ -(ВЫРАЗИТЬ((ТаблицаСуммаВозвратаСДанными.Сумма + ТаблицаСуммаСписанныхТоваров.Сумма) / ТаблицаСуммаВозвратаСДанными.Курс * ТаблицаСуммаВозвратаСДанными.Кратность КАК ЧИСЛО(15, 2)))
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВЫРАЗИТЬ((ТаблицаСуммаВозвратаСДанными.Сумма - ТаблицаСуммаСписанныхТоваров.Сумма) / ТаблицаСуммаВозвратаСДанными.Курс * ТаблицаСуммаВозвратаСДанными.Кратность КАК ЧИСЛО(15, 2))
		|		ИНАЧЕ -(ВЫРАЗИТЬ((ТаблицаСуммаВозвратаСДанными.Сумма + ТаблицаСуммаСписанныхТоваров.Сумма) / ТаблицаСуммаВозвратаСДанными.Курс * ТаблицаСуммаВозвратаСДанными.Кратность КАК ЧИСЛО(15, 2)))
		|	КОНЕЦ,
		|	ТаблицаСуммаВозвратаСДанными.Содержание,
		|	0,
		|	0
		|ИЗ
		|	ВременнаяТаблицаСуммаВозвратаСДанными КАК ТаблицаСуммаВозвратаСДанными
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаСуммаСписанныхТоваров КАК ТаблицаСуммаСписанныхТоваров
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ПрямыеПроводки
		|				ТОГДА ТаблицаСуммаВозвратаСДанными.Сумма - ТаблицаСуммаСписанныхТоваров.Сумма <> 0
		|			ИНАЧЕ ТаблицаСуммаСписанныхТоваров.Сумма + ТаблицаСуммаВозвратаСДанными.Сумма <> 0
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВЫБОР
		|					КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|						ТОГДА ВременнаяТаблицаШапка.СчетРасчетовГНС
		|					ИНАЧЕ ВременнаяТаблицаШапка.СчетРасчетов
		|				КОНЕЦ
		|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДС_ПодлежащийВозмещению)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДС_ПодлежащийВозмещению)
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|					ТОГДА ВременнаяТаблицаШапка.СчетРасчетовГНС
		|				ИНАЧЕ ВременнаяТаблицаШапка.СчетРасчетов
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВЫБОР
		|					КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|						ТОГДА ВременнаяТаблицаШапка.КонтрагентГНС
		|					ИНАЧЕ ВременнаяТаблицаШапка.Контрагент
		|				КОНЕЦ
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВЫБОР
		|					КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|						ТОГДА ВременнаяТаблицаШапка.ДоговорКонтрагентаГНС
		|					ИНАЧЕ ВременнаяТаблицаШапка.ДоговорКонтрагента
		|				КОНЕЦ
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	НЕОПРЕДЕЛЕНО,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|					ТОГДА ВременнаяТаблицаШапка.КонтрагентГНС
		|				ИНАЧЕ ВременнаяТаблицаШапка.Контрагент
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|					ТОГДА ВременнаяТаблицаШапка.ДоговорКонтрагентаГНС
		|				ИНАЧЕ ВременнаяТаблицаШапка.ДоговорКонтрагента
		|			КОНЕЦ
		|	КОНЕЦ,
		|	НЕОПРЕДЕЛЕНО,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|			ТОГДА &ВалютаРегламентированногоУчета
		|		ИНАЧЕ ВременнаяТаблицаШапка.ВалютаДокумента
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|			ТОГДА &ВалютаРегламентированногоУчета
		|		ИНАЧЕ ВременнаяТаблицаШапка.ВалютаДокумента
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВЫБОР
		|					КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|						ТОГДА ВременнаяТаблицаГотовыеСуммы.СуммаНДС
		|					ИНАЧЕ ВЫРАЗИТЬ(ВременнаяТаблицаГотовыеСуммы.СуммаНДС * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность КАК ЧИСЛО(15, 2))
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|					ТОГДА -ВременнаяТаблицаГотовыеСуммы.СуммаНДС
		|				ИНАЧЕ -(ВЫРАЗИТЬ(ВременнаяТаблицаГотовыеСуммы.СуммаНДС * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность КАК ЧИСЛО(15, 2)))
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВременнаяТаблицаГотовыеСуммы.СуммаНДС
		|		ИНАЧЕ -ВременнаяТаблицаГотовыеСуммы.СуммаНДС
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВременнаяТаблицаГотовыеСуммы.СуммаНДС
		|		ИНАЧЕ -ВременнаяТаблицаГотовыеСуммы.СуммаНДС
		|	КОНЕЦ,
		|	&СодержаниеНДС,
		|	0,
		|	0
		|ИЗ
		|	ВременнаяТаблицаГотовыеСуммы КАК ВременнаяТаблицаГотовыеСуммы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|ГДЕ
		|	НЕ ВременнаяТаблицаГотовыеСуммы.СуммаНДС = 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Акцизы)
		|		ИНАЧЕ ВременнаяТаблицаСписанныеТовары.Счет
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВременнаяТаблицаСписанныеТовары.Счет
		|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Акцизы)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ВременнаяТаблицаСписанныеТовары.Субконто1
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ВременнаяТаблицаСписанныеТовары.Субконто2
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ВременнаяТаблицаСписанныеТовары.Субконто3
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВременнаяТаблицаСписанныеТовары.Субконто1
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВременнаяТаблицаСписанныеТовары.Субконто2
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВременнаяТаблицаСписанныеТовары.Субконто3
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	&ВалютаРегламентированногоУчета,
		|	&ВалютаРегламентированногоУчета,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВременнаяТаблицаСписанныеТовары.СуммаАкциза
		|		ИНАЧЕ -ВременнаяТаблицаСписанныеТовары.СуммаАкциза
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВременнаяТаблицаСписанныеТовары.СуммаАкциза
		|		ИНАЧЕ -ВременнаяТаблицаСписанныеТовары.СуммаАкциза
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВременнаяТаблицаСписанныеТовары.СуммаАкциза
		|		ИНАЧЕ -ВременнаяТаблицаСписанныеТовары.СуммаАкциза
		|	КОНЕЦ,
		|	&СодержаниеАкциз,
		|	0,
		|	0
		|ИЗ
		|	ВременнаяТаблицаСписанныеТовары КАК ВременнаяТаблицаСписанныеТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|ГДЕ
		|	НЕ ВременнаяТаблицаСписанныеТовары.СуммаАкциза = 0
		|	И НЕ ВременнаяТаблицаСписанныеТовары.Товар
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Акцизы)
		|		ИНАЧЕ ВременнаяТаблицаСписанныеТовары.Счет
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВременнаяТаблицаСписанныеТовары.Счет
		|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Акцизы)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ВременнаяТаблицаСписанныеТовары.Номенклатура
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ВременнаяТаблицаШапка.Склад
		|	КОНЕЦ,
		|	НЕОПРЕДЕЛЕНО,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВременнаяТаблицаСписанныеТовары.Номенклатура
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВременнаяТаблицаШапка.Склад
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	НЕОПРЕДЕЛЕНО,
		|	&ВалютаРегламентированногоУчета,
		|	&ВалютаРегламентированногоУчета,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВременнаяТаблицаСписанныеТовары.СуммаАкциза
		|		ИНАЧЕ -ВременнаяТаблицаСписанныеТовары.СуммаАкциза
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВременнаяТаблицаСписанныеТовары.СуммаАкциза
		|		ИНАЧЕ -ВременнаяТаблицаСписанныеТовары.СуммаАкциза
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВременнаяТаблицаСписанныеТовары.СуммаАкциза
		|		ИНАЧЕ -ВременнаяТаблицаСписанныеТовары.СуммаАкциза
		|	КОНЕЦ,
		|	&СодержаниеАкциз,
		|	0,
		|	0
		|ИЗ
		|	ВременнаяТаблицаСписанныеТовары КАК ВременнаяТаблицаСписанныеТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|ГДЕ
		|	НЕ ВременнаяТаблицаСписанныеТовары.СуммаАкциза = 0
		|	И ВременнаяТаблицаСписанныеТовары.Товар
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВременнаяТаблицаШапка.СчетРасчетов
		|		ИНАЧЕ ВременнаяТаблицаОС.СчетУчета
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВременнаяТаблицаОС.СчетУчета
		|		ИНАЧЕ ВременнаяТаблицаШапка.СчетРасчетов
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВременнаяТаблицаШапка.Контрагент
		|		ИНАЧЕ ВременнаяТаблицаОС.ОсновноеСредство
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВременнаяТаблицаШапка.ДоговорКонтрагента
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	НЕОПРЕДЕЛЕНО,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВременнаяТаблицаОС.ОсновноеСредство
		|		ИНАЧЕ ВременнаяТаблицаШапка.Контрагент
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ВременнаяТаблицаШапка.ДоговорКонтрагента
		|	КОНЕЦ,
		|	НЕОПРЕДЕЛЕНО,
		|	ВременнаяТаблицаШапка.ВалютаДокумента,
		|	ВременнаяТаблицаШапка.ВалютаДокумента,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВременнаяТаблицаОС.СуммаВозврат
		|		ИНАЧЕ -ВременнаяТаблицаОС.СуммаВозврат
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВременнаяТаблицаОС.СуммаВалютнаяВозврат
		|		ИНАЧЕ -ВременнаяТаблицаОС.СуммаВалютнаяВозврат
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВременнаяТаблицаОС.СуммаВалютнаяВозврат
		|		ИНАЧЕ -ВременнаяТаблицаОС.СуммаВалютнаяВозврат
		|	КОНЕЦ,
		|	&СодержаниеОС,
		|	0,
		|	0
		|ИЗ
		|	ВременнаяТаблицаОС КАК ВременнаяТаблицаОС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВЫБОР
		|					КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|						ТОГДА ВременнаяТаблицаШапка.СчетРасчетовГНС
		|					ИНАЧЕ ВременнаяТаблицаШапка.СчетРасчетов
		|				КОНЕЦ
		|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДС_ПодлежащийВозмещению)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДС_ПодлежащийВозмещению)
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|					ТОГДА ВременнаяТаблицаШапка.СчетРасчетовГНС
		|				ИНАЧЕ ВременнаяТаблицаШапка.СчетРасчетов
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВЫБОР
		|					КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|						ТОГДА ВременнаяТаблицаШапка.КонтрагентГНС
		|					ИНАЧЕ ВременнаяТаблицаШапка.Контрагент
		|				КОНЕЦ
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВЫБОР
		|					КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|						ТОГДА ВременнаяТаблицаШапка.ДоговорКонтрагентаГНС
		|					ИНАЧЕ ВременнаяТаблицаШапка.ДоговорКонтрагента
		|				КОНЕЦ
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	НЕОПРЕДЕЛЕНО,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|					ТОГДА ВременнаяТаблицаШапка.КонтрагентГНС
		|				ИНАЧЕ ВременнаяТаблицаШапка.Контрагент
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|					ТОГДА ВременнаяТаблицаШапка.ДоговорКонтрагентаГНС
		|				ИНАЧЕ ВременнаяТаблицаШапка.ДоговорКонтрагента
		|			КОНЕЦ
		|	КОНЕЦ,
		|	НЕОПРЕДЕЛЕНО,
		|	ВременнаяТаблицаШапка.ВалютаДокумента,
		|	ВременнаяТаблицаШапка.ВалютаДокумента,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА СУММА(ВременнаяТаблицаОС.СуммаНДСВозврат)
		|		ИНАЧЕ -СУММА(ВременнаяТаблицаОС.СуммаНДСВозврат)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА СУММА(ВременнаяТаблицаОС.СуммаНДСВалютнаяВозврат)
		|		ИНАЧЕ -СУММА(ВременнаяТаблицаОС.СуммаНДСВалютнаяВозврат)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА СУММА(ВременнаяТаблицаОС.СуммаНДСВалютнаяВозврат)
		|		ИНАЧЕ -СУММА(ВременнаяТаблицаОС.СуммаНДСВалютнаяВозврат)
		|	КОНЕЦ,
		|	&СодержаниеОСНДС,
		|	0,
		|	0
		|ИЗ
		|	ВременнаяТаблицаОС КАК ВременнаяТаблицаОС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВременнаяТаблицаШапка.ПлательщикНДС
		|	И НЕ ВременнаяТаблицаОС.СуммаНДСВозврат = 0
		|	И ВЫБОР
		|			КОГДА &УказыватьПризнакЗачетаНДС
		|				ТОГДА НЕ ВременнаяТаблицаОС.ЗачетНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Себестоимость)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВЫБОР
		|					КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|						ТОГДА ВременнаяТаблицаШапка.СчетРасчетовГНС
		|					ИНАЧЕ ВременнаяТаблицаШапка.СчетРасчетов
		|				КОНЕЦ
		|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДС_ПодлежащийВозмещению)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДС_ПодлежащийВозмещению)
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|					ТОГДА ВременнаяТаблицаШапка.СчетРасчетовГНС
		|				ИНАЧЕ ВременнаяТаблицаШапка.СчетРасчетов
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВЫБОР
		|					КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|						ТОГДА ВременнаяТаблицаШапка.КонтрагентГНС
		|					ИНАЧЕ ВременнаяТаблицаШапка.Контрагент
		|				КОНЕЦ
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВЫБОР
		|					КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|						ТОГДА ВременнаяТаблицаШапка.ДоговорКонтрагентаГНС
		|					ИНАЧЕ ВременнаяТаблицаШапка.ДоговорКонтрагента
		|				КОНЕЦ
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|					ТОГДА ВременнаяТаблицаШапка.КонтрагентГНС
		|				ИНАЧЕ ВременнаяТаблицаШапка.Контрагент
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|					ТОГДА ВременнаяТаблицаШапка.ДоговорКонтрагентаГНС
		|				ИНАЧЕ ВременнаяТаблицаШапка.ДоговорКонтрагента
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВременнаяТаблицаШапка.ВалютаДокумента,
		|	ВременнаяТаблицаШапка.ВалютаДокумента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВременнаяТаблицаШапка.СчетРасчетов
		|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоВозвратамПоставщикам)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоВозвратамПоставщикам)
		|		ИНАЧЕ ВременнаяТаблицаШапка.СчетРасчетов
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВременнаяТаблицаШапка.Контрагент
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВременнаяТаблицаШапка.ДоговорКонтрагента
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	НЕОПРЕДЕЛЕНО,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ВременнаяТаблицаШапка.Контрагент
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ВременнаяТаблицаШапка.ДоговорКонтрагента
		|	КОНЕЦ,
		|	НЕОПРЕДЕЛЕНО,
		|	ВременнаяТаблицаШапка.ВалютаДокумента,
		|	ВременнаяТаблицаШапка.ВалютаДокумента,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА СУММА(ВременнаяТаблицаОС.СуммаВозврат - ВременнаяТаблицаОС.СуммаПоступление)
		|		ИНАЧЕ -СУММА(ВременнаяТаблицаОС.СуммаВозврат - ВременнаяТаблицаОС.СуммаПоступление)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА СУММА(ВременнаяТаблицаОС.СуммаВалютнаяВозврат - ВременнаяТаблицаОС.СуммаВалютнаяПоступление)
		|		ИНАЧЕ -СУММА(ВременнаяТаблицаОС.СуммаВалютнаяВозврат - ВременнаяТаблицаОС.СуммаВалютнаяПоступление)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА СУММА(ВременнаяТаблицаОС.СуммаВалютнаяВозврат - ВременнаяТаблицаОС.СуммаВалютнаяПоступление)
		|		ИНАЧЕ -СУММА(ВременнаяТаблицаОС.СуммаВалютнаяВозврат - ВременнаяТаблицаОС.СуммаВалютнаяПоступление)
		|	КОНЕЦ,
		|	&СодержаниеОСКорректировка,
		|	0,
		|	0
		|ИЗ
		|	ВременнаяТаблицаОС КАК ВременнаяТаблицаОС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВременнаяТаблицаШапка.ДокументОснование <> ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровУслуг.ПустаяСсылка)
		|	И ВременнаяТаблицаОС.СуммаВозврат - ВременнаяТаблицаОС.СуммаПоступление <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВременнаяТаблицаШапка.СчетРасчетов
		|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоВозвратамПоставщикам)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоВозвратамПоставщикам)
		|		ИНАЧЕ ВременнаяТаблицаШапка.СчетРасчетов
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВременнаяТаблицаШапка.Контрагент
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВременнаяТаблицаШапка.ДоговорКонтрагента
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ВременнаяТаблицаШапка.Контрагент
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ВременнаяТаблицаШапка.ДоговорКонтрагента
		|	КОНЕЦ,
		|	ВременнаяТаблицаШапка.ВалютаДокумента,
		|	ВременнаяТаблицаШапка.ВалютаДокумента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВЫБОР
		|					КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|						ТОГДА ВременнаяТаблицаШапка.СчетРасчетовГНС
		|					ИНАЧЕ ВременнаяТаблицаШапка.СчетРасчетов
		|				КОНЕЦ
		|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоВозвратамПоставщикам)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоВозвратамПоставщикам)
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|					ТОГДА ВременнаяТаблицаШапка.СчетРасчетовГНС
		|				ИНАЧЕ ВременнаяТаблицаШапка.СчетРасчетов
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВЫБОР
		|					КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|						ТОГДА ВременнаяТаблицаШапка.КонтрагентГНС
		|					ИНАЧЕ ВременнаяТаблицаШапка.Контрагент
		|				КОНЕЦ
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВЫБОР
		|					КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|						ТОГДА ВременнаяТаблицаШапка.ДоговорКонтрагентаГНС
		|					ИНАЧЕ ВременнаяТаблицаШапка.ДоговорКонтрагента
		|				КОНЕЦ
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	НЕОПРЕДЕЛЕНО,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|					ТОГДА ВременнаяТаблицаШапка.КонтрагентГНС
		|				ИНАЧЕ ВременнаяТаблицаШапка.Контрагент
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|					ТОГДА ВременнаяТаблицаШапка.ДоговорКонтрагентаГНС
		|				ИНАЧЕ ВременнаяТаблицаШапка.ДоговорКонтрагента
		|			КОНЕЦ
		|	КОНЕЦ,
		|	НЕОПРЕДЕЛЕНО,
		|	ВременнаяТаблицаШапка.ВалютаДокумента,
		|	ВременнаяТаблицаШапка.ВалютаДокумента,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА СУММА(ВременнаяТаблицаОС.СуммаНДСВозврат - ВременнаяТаблицаОС.СуммаНДСПоступление)
		|		ИНАЧЕ -СУММА(ВременнаяТаблицаОС.СуммаНДСВозврат - ВременнаяТаблицаОС.СуммаНДСПоступление)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА СУММА(ВременнаяТаблицаОС.СуммаНДСВалютнаяВозврат - ВременнаяТаблицаОС.СуммаНДСВалютнаяПоступление)
		|		ИНАЧЕ -СУММА(ВременнаяТаблицаОС.СуммаНДСВалютнаяВозврат - ВременнаяТаблицаОС.СуммаНДСВалютнаяПоступление)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА СУММА(ВременнаяТаблицаОС.СуммаНДСВалютнаяВозврат - ВременнаяТаблицаОС.СуммаНДСВалютнаяПоступление)
		|		ИНАЧЕ -СУММА(ВременнаяТаблицаОС.СуммаНДСВалютнаяВозврат - ВременнаяТаблицаОС.СуммаНДСВалютнаяПоступление)
		|	КОНЕЦ,
		|	&СодержаниеОСКорректировкаНДС,
		|	0,
		|	0
		|ИЗ
		|	ВременнаяТаблицаОС КАК ВременнаяТаблицаОС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВременнаяТаблицаШапка.ДокументОснование <> ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровУслуг.ПустаяСсылка)
		|	И ВременнаяТаблицаОС.СуммаНДСВозврат - ВременнаяТаблицаОС.СуммаНДСПоступление <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВЫБОР
		|					КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|						ТОГДА ВременнаяТаблицаШапка.СчетРасчетовГНС
		|					ИНАЧЕ ВременнаяТаблицаШапка.СчетРасчетов
		|				КОНЕЦ
		|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоВозвратамПоставщикам)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоВозвратамПоставщикам)
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|					ТОГДА ВременнаяТаблицаШапка.СчетРасчетовГНС
		|				ИНАЧЕ ВременнаяТаблицаШапка.СчетРасчетов
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВЫБОР
		|					КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|						ТОГДА ВременнаяТаблицаШапка.КонтрагентГНС
		|					ИНАЧЕ ВременнаяТаблицаШапка.Контрагент
		|				КОНЕЦ
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА ВЫБОР
		|					КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|						ТОГДА ВременнаяТаблицаШапка.ДоговорКонтрагентаГНС
		|					ИНАЧЕ ВременнаяТаблицаШапка.ДоговорКонтрагента
		|				КОНЕЦ
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|					ТОГДА ВременнаяТаблицаШапка.КонтрагентГНС
		|				ИНАЧЕ ВременнаяТаблицаШапка.Контрагент
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПрямыеПроводки
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|					ТОГДА ВременнаяТаблицаШапка.ДоговорКонтрагентаГНС
		|				ИНАЧЕ ВременнаяТаблицаШапка.ДоговорКонтрагента
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВременнаяТаблицаШапка.ВалютаДокумента,
		|	ВременнаяТаблицаШапка.ВалютаДокумента";
		
	Запрос.УстановитьПараметр("ТаблицаСписанныеТовары", ТаблицаСписанныеТовары);
	Запрос.УстановитьПараметр("ТаблицаСписанныеМБП", ТаблицаСписанныеМБП);
	Запрос.УстановитьПараметр("ПрямыеПроводки", ПрямыеПроводки);
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", СтруктураДополнительныеСвойства.ДляПроведения.ВалютаРегламентированногоУчета);
	Запрос.УстановитьПараметр("СодержаниеКорректировка", НСтр("ru = 'Корректировка суммы возврата'"));
	Запрос.УстановитьПараметр("СодержаниеВозвратУслуг", НСтр("ru = 'Возврат услуг'"));
	Запрос.УстановитьПараметр("СодержаниеНДС", НСтр("ru = 'Возврат товаров поставщику (НДС)'"));
	Запрос.УстановитьПараметр("СодержаниеАкциз", НСтр("ru = 'Акциз'"));
	Запрос.УстановитьПараметр("СодержаниеОС", НСтр("ru = 'Возврат ОС'"));
	Запрос.УстановитьПараметр("СодержаниеОСНДС", НСтр("ru = 'Возврат ОС (НДС)'"));
	Запрос.УстановитьПараметр("СодержаниеОСКорректировка", НСтр("ru = 'Корректировка суммы возврата (ОС)'"));
	Запрос.УстановитьПараметр("СодержаниеОСКорректировкаНДС", НСтр("ru = 'Корректировка суммы возврата НДС (ОС)'"));
	Запрос.УстановитьПараметр("УказыватьПризнакЗачетаНДС", СтруктураДополнительныеСвойства.УчетнаяПолитика.УказыватьПризнакЗачетаНДСПриПоступлении);
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаХозрасчетный", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру бухгалтерии Хозрасчетный.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаПоступлениеТоваров(ДокументСсылка, СтруктураДополнительныеСвойства) 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаШапка.Контрагент,
		|	ВременнаяТаблицаШапка.ДоговорКонтрагента КАК Договор,
		|	ВременнаяТаблицаТовары.Номенклатура,
		|	ВременнаяТаблицаШапка.ЗначениеСтавкиНДС,
		|	ВременнаяТаблицаШапка.ЗначениеСтавкиНСП,
		|	ВременнаяТаблицаШапка.БезналичныйРасчет,
		|	-ВременнаяТаблицаТовары.СуммаНДС КАК СуммаНДС,
		|	-ВременнаяТаблицаТовары.Сумма КАК Сумма,
		|	-ВременнаяТаблицаТовары.СуммаНСП КАК СуммаНСП,
		|	-ВременнаяТаблицаТовары.Количество КАК Количество
		|ИЗ
		|	ВременнаяТаблицаТовары КАК ВременнаяТаблицаТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)";
	РезультатЗапроса = Запрос.Выполнить();
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПоступлениеТоваров", РезультатЗапроса.Выгрузить());
		
КонецПроцедуры 

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаСведенияОПоступлении(СтруктураДополнительныеСвойства) 
	
	// Переход на ЭСФ.
	Если СтруктураДополнительныеСвойства.ДляПроведения.Дата < Дата(2020, 07, 01) Тогда 
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ВременнаяТаблицаШапка.Ссылка КАК ДокументСсылка,
			|	ВременнаяТаблицаШапка.Организация КАК Организация,
			|	ВременнаяТаблицаШапка.Контрагент КАК Контрагент,
			|	ВременнаяТаблицаШапка.ДоговорКонтрагента КАК ДоговорКонтрагента,
			|	ВременнаяТаблицаШапка.Дата КАК ДатаПоставки,
			|	ВременнаяТаблицаШапка.СерияБланкаСФ КАК СерияБланкаСФ,
			|	ВременнаяТаблицаШапка.НомерБланкаСФ КАК НомерБланкаСФ,
			|	ВременнаяТаблицаШапка.ДатаСФ КАК ДатаСФ,
			|	ВременнаяТаблицаШапка.Контрагент.ПризнакСтраны КАК ПризнакСтраны,
			|	ВременнаяТаблицаТовары.Сумма КАК Сумма,
			|	ВременнаяТаблицаТовары.СуммаНДС КАК СуммаНДС,
			|	ВременнаяТаблицаТовары.СуммаНСП КАК СуммаНСП
			|ПОМЕСТИТЬ ВременнаяТаблицаСтроки
			|ИЗ
			|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаТовары КАК ВременнаяТаблицаТовары
			|		ПО (ИСТИНА)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВременнаяТаблицаШапка.Ссылка,
			|	ВременнаяТаблицаШапка.Организация,
			|	ВременнаяТаблицаШапка.Контрагент,
			|	ВременнаяТаблицаШапка.ДоговорКонтрагента,
			|	ВременнаяТаблицаШапка.Дата,
			|	ВременнаяТаблицаШапка.СерияБланкаСФ,
			|	ВременнаяТаблицаШапка.НомерБланкаСФ,
			|	ВременнаяТаблицаШапка.ДатаСФ,
			|	ВременнаяТаблицаШапка.ПризнакСтраны,
			|	ВременнаяТаблицаУслуги.Сумма,
			|	ВременнаяТаблицаУслуги.СуммаНДС,
			|	ВременнаяТаблицаУслуги.СуммаНСП
			|ИЗ
			|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаУслуги КАК ВременнаяТаблицаУслуги
			|		ПО (ИСТИНА)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВременнаяТаблицаШапка.Ссылка,
			|	ВременнаяТаблицаШапка.Организация,
			|	ВременнаяТаблицаШапка.Контрагент,
			|	ВременнаяТаблицаШапка.ДоговорКонтрагента,
			|	ВременнаяТаблицаШапка.Дата,
			|	ВременнаяТаблицаШапка.СерияБланкаСФ,
			|	ВременнаяТаблицаШапка.НомерБланкаСФ,
			|	ВременнаяТаблицаШапка.ДатаСФ,
			|	ВременнаяТаблицаШапка.ПризнакСтраны,
			|	ВременнаяТаблицаОС.Сумма,
			|	ВременнаяТаблицаОС.СуммаНДС,
			|	ВременнаяТаблицаОС.СуммаНСП
			|ИЗ
			|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаОС КАК ВременнаяТаблицаОС
			|		ПО (ИСТИНА)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВременнаяТаблицаСтроки.ДокументСсылка КАК ДокументСсылка,
			|	ВременнаяТаблицаСтроки.Организация КАК Организация,
			|	ВременнаяТаблицаСтроки.Контрагент КАК Контрагент,
			|	ВременнаяТаблицаСтроки.ДоговорКонтрагента КАК ДоговорКонтрагента,
			|	ВременнаяТаблицаСтроки.ДатаПоставки КАК ДатаПоставки,
			|	ВременнаяТаблицаСтроки.СерияБланкаСФ КАК СерияБланкаСФ,
			|	ВременнаяТаблицаСтроки.НомерБланкаСФ КАК НомерБланкаСФ,
			|	ВременнаяТаблицаСтроки.ДатаСФ КАК ДатаСФ,
			|	-СУММА(ВременнаяТаблицаСтроки.Сумма) КАК Сумма,
			|	-СУММА(ВременнаяТаблицаСтроки.СуммаНДС) КАК СуммаНДС,
			|	-СУММА(ВременнаяТаблицаСтроки.СуммаНСП) КАК СуммаНСП
			|ИЗ
			|	ВременнаяТаблицаСтроки КАК ВременнаяТаблицаСтроки
			|ГДЕ
			|	ВременнаяТаблицаСтроки.ПризнакСтраны <> ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ИмпортЭкспорт)
			|	И ВременнаяТаблицаСтроки.СерияБланкаСФ <> """"
			|	И (ВременнаяТаблицаСтроки.Сумма <> 0
			|			ИЛИ ВременнаяТаблицаСтроки.СуммаНДС <> 0
			|			ИЛИ ВременнаяТаблицаСтроки.СуммаНСП <> 0)
			|
			|СГРУППИРОВАТЬ ПО
			|	ВременнаяТаблицаСтроки.ДокументСсылка,
			|	ВременнаяТаблицаСтроки.Организация,
			|	ВременнаяТаблицаСтроки.Контрагент,
			|	ВременнаяТаблицаСтроки.ДоговорКонтрагента,
			|	ВременнаяТаблицаСтроки.ДатаПоставки,
			|	ВременнаяТаблицаСтроки.СерияБланкаСФ,
			|	ВременнаяТаблицаСтроки.НомерБланкаСФ,
			|	ВременнаяТаблицаСтроки.ДатаСФ";
	Иначе 
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ВременнаяТаблицаШапка.Ссылка КАК ДокументСсылка,
			|	ВременнаяТаблицаШапка.Организация КАК Организация,
			|	ВременнаяТаблицаШапка.Контрагент КАК Контрагент,
			|	ВременнаяТаблицаШапка.ДоговорКонтрагента КАК ДоговорКонтрагента,
			|	ВременнаяТаблицаШапка.Контрагент.ПризнакСтраны КАК ПризнакСтраны,
			|	ВременнаяТаблицаТовары.Сумма КАК Сумма,
			|	ВременнаяТаблицаТовары.СуммаНДС КАК СуммаНДС,
			|	ВременнаяТаблицаТовары.СуммаНСП КАК СуммаНСП
			|ПОМЕСТИТЬ ВременнаяТаблицаСтроки
			|ИЗ
			|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаТовары КАК ВременнаяТаблицаТовары
			|		ПО (ИСТИНА)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВременнаяТаблицаШапка.Ссылка,
			|	ВременнаяТаблицаШапка.Организация,
			|	ВременнаяТаблицаШапка.Контрагент,
			|	ВременнаяТаблицаШапка.ДоговорКонтрагента,
			|	ВременнаяТаблицаШапка.ПризнакСтраны,
			|	ВременнаяТаблицаУслуги.Сумма,
			|	ВременнаяТаблицаУслуги.СуммаНДС,
			|	ВременнаяТаблицаУслуги.СуммаНСП
			|ИЗ
			|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаУслуги КАК ВременнаяТаблицаУслуги
			|		ПО (ИСТИНА)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВременнаяТаблицаШапка.Ссылка,
			|	ВременнаяТаблицаШапка.Организация,
			|	ВременнаяТаблицаШапка.Контрагент,
			|	ВременнаяТаблицаШапка.ДоговорКонтрагента,
			|	ВременнаяТаблицаШапка.ПризнакСтраны,
			|	ВременнаяТаблицаОС.Сумма,
			|	ВременнаяТаблицаОС.СуммаНДС,
			|	ВременнаяТаблицаОС.СуммаНСП
			|ИЗ
			|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаОС КАК ВременнаяТаблицаОС
			|		ПО (ИСТИНА)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВременнаяТаблицаСтроки.ДокументСсылка КАК ДокументСсылка,
			|	ВременнаяТаблицаСтроки.Организация КАК Организация,
			|	ВременнаяТаблицаСтроки.Контрагент КАК Контрагент,
			|	ВременнаяТаблицаСтроки.ДоговорКонтрагента КАК ДоговорКонтрагента,
			|	СведенияОбЭСФ.ДатаПоставки КАК ДатаПоставки,
			|	"""" КАК СерияБланкаСФ,
			|	СведенияОбЭСФ.НомерЭСФ КАК НомерБланкаСФ,
			|	СведенияОбЭСФ.Дата КАК ДатаСФ,
			|	-СУММА(ВременнаяТаблицаСтроки.Сумма) КАК Сумма,
			|	-СУММА(ВременнаяТаблицаСтроки.СуммаНДС) КАК СуммаНДС,
			|	-СУММА(ВременнаяТаблицаСтроки.СуммаНСП) КАК СуммаНСП
			|ИЗ
			|	ВременнаяТаблицаСтроки КАК ВременнаяТаблицаСтроки
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбЭСФ КАК СведенияОбЭСФ
			|		ПО ВременнаяТаблицаСтроки.Организация = СведенияОбЭСФ.Организация
			|			И ВременнаяТаблицаСтроки.ДокументСсылка = СведенияОбЭСФ.ДокументОснование
			|ГДЕ
			|	ВременнаяТаблицаСтроки.ПризнакСтраны <> ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ИмпортЭкспорт)
			|	И (ВременнаяТаблицаСтроки.Сумма <> 0
			|			ИЛИ ВременнаяТаблицаСтроки.СуммаНДС <> 0
			|			ИЛИ ВременнаяТаблицаСтроки.СуммаНСП <> 0)
			|
			|СГРУППИРОВАТЬ ПО
			|	ВременнаяТаблицаСтроки.ДокументСсылка,
			|	ВременнаяТаблицаСтроки.Организация,
			|	ВременнаяТаблицаСтроки.Контрагент,
			|	ВременнаяТаблицаСтроки.ДоговорКонтрагента,
			|	СведенияОбЭСФ.ДатаПоставки,
			|	СведенияОбЭСФ.НомерЭСФ,
			|	СведенияОбЭСФ.Дата";		
	КонецЕсли;	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСведенияОПоступлении", Запрос.Выполнить().Выгрузить());		
КонецПроцедуры 

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРеестрПриобретенныхМатериальныхРесурсов(ДокументСсылка, СтруктураДополнительныеСвойства) 
	                   
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаТовары.ЗачетНДС КАК ЗачетНДС,
		|	ЕСТЬNULL(СУММА(ВременнаяТаблицаТовары.Сумма), 0) КАК Сумма,
		|	ЕСТЬNULL(СУММА(ВременнаяТаблицаТовары.СуммаНДС), 0) КАК СуммаНДС
		|ПОМЕСТИТЬ ВременнаяТаблицаДанныеТабличныхЧастейПервичная
		|ИЗ
		|	ВременнаяТаблицаТовары КАК ВременнаяТаблицаТовары
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаТовары.ЗачетНДС
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаУслуги.ЗачетНДС,
		|	ЕСТЬNULL(СУММА(ВременнаяТаблицаУслуги.Сумма), 0),
		|	ЕСТЬNULL(СУММА(ВременнаяТаблицаУслуги.СуммаНДС), 0)
		|ИЗ
		|	ВременнаяТаблицаУслуги КАК ВременнаяТаблицаУслуги
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаУслуги.ЗачетНДС
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаОС.ЗачетНДС,
		|	ЕСТЬNULL(СУММА(ВременнаяТаблицаОС.Сумма), 0),
		|	ЕСТЬNULL(СУММА(ВременнаяТаблицаОС.СуммаНДС), 0)
		|ИЗ
		|	ВременнаяТаблицаОС КАК ВременнаяТаблицаОС
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаОС.ЗачетНДС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаДанныеТабличныхЧастейПервичная.ЗачетНДС КАК ЗачетНДС,
		|	СУММА(ВременнаяТаблицаДанныеТабличныхЧастейПервичная.Сумма) КАК Сумма,
		|	СУММА(ВременнаяТаблицаДанныеТабличныхЧастейПервичная.СуммаНДС) КАК СуммаНДС
		|ПОМЕСТИТЬ ВременнаяТаблицаДанныеТабличныхЧастей
		|ИЗ
		|	ВременнаяТаблицаДанныеТабличныхЧастейПервичная КАК ВременнаяТаблицаДанныеТабличныхЧастейПервичная
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаДанныеТабличныхЧастейПервичная.ЗачетНДС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.ДатаСФ КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаШапка.Контрагент КАК Контрагент,
		|	ВременнаяТаблицаДанныеТабличныхЧастей.ЗачетНДС КАК ЗачетНДС,
		|	ВременнаяТаблицаШапка.СерияБланкаСФ КАК СерияБланкаСФ,
		|	ВременнаяТаблицаШапка.НомерБланкаСФ КАК НомерБланкаСФ,
		|	ВременнаяТаблицаШапка.КорСерияБланкаСФ КАК КорСерияБланкаСФ,
		|	ВременнаяТаблицаШапка.КорНомерБланкаСФ КАК КорНомерБланкаСФ,
		|	-(ВЫРАЗИТЬ(ВременнаяТаблицаДанныеТабличныхЧастей.СуммаНДС * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность КАК ЧИСЛО(15, 2))) КАК СуммаНДС,
		|	-(ВЫРАЗИТЬ(ВременнаяТаблицаДанныеТабличныхЧастей.Сумма * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность КАК ЧИСЛО(15, 2))) КАК Сумма
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаДанныеТабличныхЧастей КАК ВременнаяТаблицаДанныеТабличныхЧастей
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВременнаяТаблицаШапка.ПлательщикНДС
		|	И НЕ ВременнаяТаблицаШапка.Контрагент.СЭЗ
		|	И ВременнаяТаблицаШапка.Дата < ДАТАВРЕМЯ(2020, 7, 1)
		|	И ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|	И ВременнаяТаблицаШапка.СерияБланкаСФ <> """"
		|	И ВременнаяТаблицаШапка.НомерБланкаСФ <> """"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СведенияОбЭСФ.ДатаПоставки,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаШапка.Контрагент,
		|	ВременнаяТаблицаДанныеТабличныхЧастей.ЗачетНДС,
		|	"""",
		|	СведенияОбЭСФ.НомерЭСФ,
		|	СведенияОбЭСФ.СерияКорректируемогоСФ,
		|	СведенияОбЭСФ.НомерКорректируемогоЭСФ,
		|	-(ВЫРАЗИТЬ(ВременнаяТаблицаДанныеТабличныхЧастей.СуммаНДС * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность КАК ЧИСЛО(15, 2))),
		|	-(ВЫРАЗИТЬ(ВременнаяТаблицаДанныеТабличныхЧастей.Сумма * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность КАК ЧИСЛО(15, 2)))
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаДанныеТабличныхЧастей КАК ВременнаяТаблицаДанныеТабличныхЧастей
		|		ПО (ИСТИНА)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбЭСФ КАК СведенияОбЭСФ
		|		ПО ВременнаяТаблицаШапка.Организация = СведенияОбЭСФ.Организация
		|			И ВременнаяТаблицаШапка.Ссылка = СведенияОбЭСФ.ДокументОснование
		|ГДЕ
		|	ВременнаяТаблицаШапка.ПлательщикНДС
		|	И НЕ ВременнаяТаблицаШапка.Контрагент.СЭЗ
		|	И ВременнаяТаблицаШапка.Дата >= ДАТАВРЕМЯ(2020, 7, 1)
		|	И ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)";
	Запрос.УстановитьПараметр("УказыватьПризнакЗачетаНДС", СтруктураДополнительныеСвойства.УчетнаяПолитика.УказыватьПризнакЗачетаНДСПриПоступлении);
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРеестрПриобретенныхМатериальныхРесурсов", Запрос.Выполнить().Выгрузить());		
КонецПроцедуры 

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРеестрВвезенных(СтруктураДополнительныеСвойства) 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаТовары.ЗачетНДС КАК ЗачетНДС,
		|	ЕСТЬNULL(СУММА(ВременнаяТаблицаТовары.СуммаНДС), 0) КАК СуммаНДС,
		|	ЕСТЬNULL(СУММА(ВременнаяТаблицаТовары.Сумма), 0) КАК Сумма,
		|	ЕСТЬNULL(СУММА(ВременнаяТаблицаТовары.СуммаАкциза), 0) КАК СуммаАкциза
		|ПОМЕСТИТЬ ВременнаяТаблицаТаблицыДокумента
		|ИЗ
		|	ВременнаяТаблицаТовары КАК ВременнаяТаблицаТовары
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаТовары.ЗачетНДС
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаУслуги.ЗачетНДС,
		|	ЕСТЬNULL(СУММА(ВременнаяТаблицаУслуги.СуммаНДС), 0),
		|	ЕСТЬNULL(СУММА(ВременнаяТаблицаУслуги.Сумма), 0),
		|	ЕСТЬNULL(СУММА(ВременнаяТаблицаУслуги.СуммаАкциза), 0)
		|ИЗ
		|	ВременнаяТаблицаУслуги КАК ВременнаяТаблицаУслуги
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаУслуги.ЗачетНДС
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаОС.ЗачетНДС,
		|	ЕСТЬNULL(СУММА(ВременнаяТаблицаОС.СуммаНДС), 0),
		|	ЕСТЬNULL(СУММА(ВременнаяТаблицаОС.Сумма), 0),
		|	ЕСТЬNULL(СУММА(ВременнаяТаблицаОС.СуммаАкциза), 0)
		|ИЗ
		|	ВременнаяТаблицаОС КАК ВременнаяТаблицаОС
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаОС.ЗачетНДС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаТаблицыДокумента.ЗачетНДС КАК ЗачетНДС,
		|	ВременнаяТаблицаТаблицыДокумента.СуммаНДС КАК СуммаНДС,
		|	ВременнаяТаблицаТаблицыДокумента.Сумма КАК Сумма,
		|	ВременнаяТаблицаТаблицыДокумента.СуммаАкциза КАК СуммаАкциза
		|ПОМЕСТИТЬ ВТСуммыРеестрВвезенных
		|ИЗ
		|	ВременнаяТаблицаТаблицыДокумента КАК ВременнаяТаблицаТаблицыДокумента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.НомерБланкаСФ <> """"
		|			ТОГДА ВременнаяТаблицаШапка.НомерБланкаСФ
		|		ИНАЧЕ ВременнаяТаблицаШапка.Номер
		|	КОНЕЦ КАК Номер,
		|	ВременнаяТаблицаШапка.ДатаСФ КАК ДатаСФ,
		|	ВременнаяТаблицаШапка.Контрагент КАК Контрагент,
		|	-ВТСуммыРеестрВвезенных.СуммаНДС КАК СуммаНДС,
		|	-ВТСуммыРеестрВвезенных.Сумма КАК Сумма,
		|	-ВТСуммыРеестрВвезенных.СуммаАкциза КАК СуммаАкциза,
		|	ВТСуммыРеестрВвезенных.ЗачетНДС КАК ЗачетНДС
		|ИЗ
		|	ВТСуммыРеестрВвезенных КАК ВТСуммыРеестрВвезенных
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВременнаяТаблицаШапка.ПлательщикНДС
		|	И ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)";
		//|	И ВТСуммыРеестрВвезенных.СуммаНДС <> 0";	
	Запрос.УстановитьПараметр("УказыватьПризнакЗачетаНДС", СтруктураДополнительныеСвойства.УчетнаяПолитика.УказыватьПризнакЗачетаНДСПриПоступлении);
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРеестрВвезенных", Запрос.Выполнить().Выгрузить());		
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаНДСНаИмпорт(ДокументСсылка, СтруктураДополнительныеСвойства) 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ИмпортОсвобожденныйОтНДС <> ЗНАЧЕНИЕ(Перечисление.ИмпортОсвобожденныйОтНДС.ПустаяСсылка)
		|			ТОГДА ВременнаяТаблицаШапка.ИмпортОсвобожденныйОтНДС
		|		ИНАЧЕ ВременнаяТаблицаТовары.ИмпортОсвобожденныйОтНДС
		|	КОНЕЦ КАК ИмпортОсвобожденныйОтНДС,
		|	ВременнаяТаблицаШапка.ПоказательИмпорта КАК ПоказательИмпорта,
		|	-ВременнаяТаблицаТовары.СуммаНДС КАК СуммаНДС,
		|	-ВременнаяТаблицаТовары.Сумма КАК Сумма
		|ПОМЕСТИТЬ ВременнаяТаблицаНДСНаИмпорт
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаТовары КАК ВременнаяТаблицаТовары
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ИмпортОсвобожденныйОтНДС <> ЗНАЧЕНИЕ(Перечисление.ИмпортОсвобожденныйОтНДС.ПустаяСсылка)
		|			ТОГДА ВременнаяТаблицаШапка.ИмпортОсвобожденныйОтНДС
		|		ИНАЧЕ ВременнаяТаблицаОСПредварительно.ИмпортОсвобожденныйОтНДС
		|	КОНЕЦ,
		|	ВременнаяТаблицаШапка.ПоказательИмпорта,
		|	-ВременнаяТаблицаОСПредварительно.СуммаНДС,
		|	-ВременнаяТаблицаОСПредварительно.Сумма
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаОСПредварительно КАК ВременнаяТаблицаОСПредварительно
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаНДСНаИмпорт.Период КАК Период,
		|	ВременнаяТаблицаНДСНаИмпорт.Организация КАК Организация,
		|	ВременнаяТаблицаНДСНаИмпорт.ИмпортОсвобожденныйОтНДС КАК ИмпортОсвобожденныйОтНДС,
		|	ВременнаяТаблицаНДСНаИмпорт.ПоказательИмпорта КАК ПоказательИмпорта,
		|	СУММА(ВременнаяТаблицаНДСНаИмпорт.СуммаНДС) КАК СуммаНДС,
		|	СУММА(ВременнаяТаблицаНДСНаИмпорт.Сумма) КАК Сумма
		|ИЗ
		|	ВременнаяТаблицаНДСНаИмпорт КАК ВременнаяТаблицаНДСНаИмпорт
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаНДСНаИмпорт.Организация,
		|	ВременнаяТаблицаНДСНаИмпорт.ИмпортОсвобожденныйОтНДС,
		|	ВременнаяТаблицаНДСНаИмпорт.ПоказательИмпорта,
		|	ВременнаяТаблицаНДСНаИмпорт.Период";
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаНДСНаИмпорт", РезультатЗапроса.Выгрузить());
		
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру бухгалтерии Хозрасчетный.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРеестрЗакупок(ДокументСсылка, СтруктураДополнительныеСвойства) 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаШапка.Контрагент КАК Контрагент,
		|	ВременнаяТаблицаТовары.Номенклатура КАК Номенклатура,
		|	ВременнаяТаблицаШапка.ЗначениеСтавкиНДС КАК ЗначениеСтавкиНДС,
		|	ВременнаяТаблицаШапка.ЗначениеСтавкиНСП КАК ЗначениеСтавкиНСП,
		|	-ВременнаяТаблицаТовары.СуммаНДС КАК СуммаНДС,
		|	-ВременнаяТаблицаТовары.Сумма КАК Сумма,
		|	-ВременнаяТаблицаТовары.СуммаНСП КАК СуммаНСП,
		|	-ВременнаяТаблицаТовары.Количество КАК Количество
		|ИЗ
		|	ВременнаяТаблицаТовары КАК ВременнаяТаблицаТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВременнаяТаблицаШапка.ПризнакСтраны <> ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ИмпортЭкспорт)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаШапка.Контрагент,
		|	ВременнаяТаблицаУслуги.Номенклатура,
		|	ВременнаяТаблицаШапка.ЗначениеСтавкиНДС,
		|	ВременнаяТаблицаШапка.ЗначениеСтавкиНСП,
		|	-ВременнаяТаблицаУслуги.СуммаНДС КАК СуммаНДС,
		|	-ВременнаяТаблицаУслуги.Сумма КАК Сумма,
		|	-ВременнаяТаблицаУслуги.СуммаНСП КАК СуммаНСП,
		|	-ВременнаяТаблицаУслуги.Количество КАК Количество
		|ИЗ
		|	ВременнаяТаблицаУслуги КАК ВременнаяТаблицаУслуги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаШапка.Контрагент,
		|	ВременнаяТаблицаОС.ОсновноеСредство,
		|	ВременнаяТаблицаШапка.ЗначениеСтавкиНДС,
		|	ВременнаяТаблицаШапка.ЗначениеСтавкиНСП,
		|	-ВременнаяТаблицаОС.СуммаНДС КАК СуммаНДС,
		|	-ВременнаяТаблицаОС.Сумма КАК Сумма,
		|	-ВременнаяТаблицаОС.СуммаНСП КАК СуммаНСП,
		|	-1 КАК Количество
		|ИЗ
		|	ВременнаяТаблицаОС КАК ВременнаяТаблицаОС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)";
	РезультатЗапроса = Запрос.Выполнить();
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРеестрЗакупок", РезультатЗапроса.Выгрузить());
		
КонецПроцедуры 

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьСведенияПоПоказателямИмпорта(ДокументСсылка, СтруктураДополнительныеСвойства) 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.Дата КАК Дата,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаШапка.Ссылка КАК ДокументСсылка,
		|	ВременнаяТаблицаШапка.Контрагент КАК Поставщик,
		|	ВременнаяТаблицаШапка.Страна КАК Страна,
		|	ВременнаяТаблицаШапка.ХарактерСделки КАК ХарактерСделки,
		|	ВременнаяТаблицаШапка.КоммерческийДокумент КАК КоммерческиеДокументы,
		|	ВременнаяТаблицаШапка.Транспортировка КАК Транспортировка,
		|	ВременнаяТаблицаШапка.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
		|	ВременнаяТаблицаШапка.ВидТранспорта КАК ВидТранспорта,
		|	ВременнаяТаблицаШапка.НомерКонтракта КАК НомерКонтракта,
		|	ВременнаяТаблицаШапка.ДатаКонтракта КАК ДатаКонтракта,
		|	ВременнаяТаблицаТовары.Номенклатура КАК Номенклатура,
		|	-СУММА(ВременнаяТаблицаТовары.Вес) КАК Вес,
		|	-СУММА(ВременнаяТаблицаТовары.Количество) КАК Количество,
		|	-СУММА(ВременнаяТаблицаТовары.Сумма) КАК Сумма,
		|	-СУММА(ВЫРАЗИТЬ(ВременнаяТаблицаТовары.Сумма / ВременнаяТаблицаКурсДоллара.Курс * ВременнаяТаблицаКурсДоллара.Кратность КАК ЧИСЛО(15, 2))) КАК СуммаВДолларах
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаТовары КАК ВременнаяТаблицаТовары
		|		ПО (ИСТИНА)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсДоллара КАК ВременнаяТаблицаКурсДоллара
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|	И ВременнаяТаблицаШапка.ДокументОснование <> ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровУслуг.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаШапка.Транспортировка,
		|	ВременнаяТаблицаШапка.Ссылка,
		|	ВременнаяТаблицаШапка.КоммерческийДокумент,
		|	ВременнаяТаблицаШапка.ДополнительнаяИнформация,
		|	ВременнаяТаблицаШапка.НомерКонтракта,
		|	ВременнаяТаблицаШапка.Контрагент,
		|	ВременнаяТаблицаШапка.Дата,
		|	ВременнаяТаблицаШапка.ДатаКонтракта,
		|	ВременнаяТаблицаШапка.ВидТранспорта,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаШапка.Страна,
		|	ВременнаяТаблицаШапка.ХарактерСделки,
		|	ВременнаяТаблицаТовары.Номенклатура";
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСведенияПоПоказателямИмпорта", РезультатЗапроса.Выгрузить());
		
КонецПроцедуры 

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаСостоянияОС(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаОС.ОсновноеСредство,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыСостоянийОС.Передано) КАК Состояние
		|ИЗ
		|	ВременнаяТаблицаОС КАК ВременнаяТаблицаОС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)";
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСостоянияОС", РезультатЗапроса.Выгрузить()); 

КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаСобытияОС(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.Дата КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Списание) КАК Событие,
		|	ВременнаяТаблицаШапка.Номер КАК НомерДокумента,
		|	ВременнаяТаблицаШапка.Ссылка КАК НазваниеДокумента,
		|	ВременнаяТаблицаОС.ОсновноеСредство КАК ОсновноеСредство
		|ИЗ
		|	ВременнаяТаблицаОС КАК ВременнаяТаблицаОС
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)";
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСобытияОС", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства, Отказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВозвратТоваровПоставщику.Ссылка КАК Ссылка,
		|	ВозвратТоваровПоставщику.Организация КАК Организация,
		|	ВозвратТоваровПоставщику.Дата КАК Дата,
		|	ВозвратТоваровПоставщику.Номер КАК Номер,
		|	ВозвратТоваровПоставщику.ВидОперации КАК ВидОперации,
		|	ВозвратТоваровПоставщику.Контрагент КАК Контрагент,
		|	ВозвратТоваровПоставщику.ВалютаДокумента КАК ВалютаДокумента,
		|	ВозвратТоваровПоставщику.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	&КонтрагентГНС КАК КонтрагентГНС,
		|	&ДоговорКонтрагентаГНС КАК ДоговорКонтрагентаГНС,
		|	&СчетРасчетовГНС КАК СчетРасчетовГНС,
		|	&ПлательщикНДС КАК ПлательщикНДС,
		|	ВозвратТоваровПоставщику.Склад КАК Склад,
		|	ВозвратТоваровПоставщику.ЗначениеСтавкиНДС КАК ЗначениеСтавкиНДС,
		|	ВозвратТоваровПоставщику.ЗначениеСтавкиНСП КАК ЗначениеСтавкиНСП,
		|	ВозвратТоваровПоставщику.БезналичныйРасчет КАК БезналичныйРасчет,
		|	ВозвратТоваровПоставщику.ДокументОснование КАК ДокументОснование,
		|	ВозвратТоваровПоставщику.Курс КАК Курс,
		|	ВозвратТоваровПоставщику.Кратность КАК Кратность,
		|	ВозвратТоваровПоставщику.СчетРасчетов КАК СчетРасчетов,
		|	ВозвратТоваровПоставщику.СерияБланкаСФ КАК СерияБланкаСФ,
		|	ВозвратТоваровПоставщику.НомерБланкаСФ КАК НомерБланкаСФ,
		|	ВозвратТоваровПоставщику.ДатаСФ КАК ДатаСФ,
		|	ВозвратТоваровПоставщику.Контрагент.ПризнакСтраны КАК ПризнакСтраны,
		|	ВозвратТоваровПоставщику.Контрагент.СтранаРезидентства КАК Страна,
		|	ПоступлениеТоваровУслуг.СерияБланкаСФ КАК КорСерияБланкаСФ,
		|	ПоступлениеТоваровУслуг.НомерБланкаСФ КАК КорНомерБланкаСФ,
		|	ПоступлениеТоваровУслуг.ИмпортОсвобожденныйОтНДС КАК ИмпортОсвобожденныйОтНДС,
		|	ПоступлениеТоваровУслуг.ПоказательИмпорта КАК ПоказательИмпорта,
		|	ПоступлениеТоваровУслуг.ХарактерСделки КАК ХарактерСделки,
		|	ПоступлениеТоваровУслуг.КоммерческийДокумент КАК КоммерческийДокумент,
		|	ПоступлениеТоваровУслуг.Транспортировка КАК Транспортировка,
		|	ПоступлениеТоваровУслуг.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
		|	ПоступлениеТоваровУслуг.ВидТранспорта КАК ВидТранспорта,
		|	ПоступлениеТоваровУслуг.НомерКонтракта КАК НомерКонтракта,
		|	ПоступлениеТоваровУслуг.ДатаКонтракта КАК ДатаКонтракта
		
		|ПОМЕСТИТЬ ВременнаяТаблицаШапка
		|ИЗ
		|	Документ.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		|		ПО ВозвратТоваровПоставщику.ДокументОснование = ПоступлениеТоваровУслуг.Ссылка
		|ГДЕ
		|	ВозвратТоваровПоставщику.Ссылка = &ДокументСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВозвратТоваровПоставщикуТовары.НомерСтроки КАК НомерСтроки,
		|	ВозвратТоваровПоставщикуТовары.Номенклатура КАК Номенклатура,
		|	ВозвратТоваровПоставщикуТовары.Количество КАК Количество,
		|	ВозвратТоваровПоставщикуТовары.Сумма КАК Сумма,
		|	ВозвратТоваровПоставщикуТовары.СуммаНДС КАК СуммаНДС,
		|	ВозвратТоваровПоставщикуТовары.СуммаНСП КАК СуммаНСП,
		|	ВозвратТоваровПоставщикуТовары.СуммаАкциза КАК СуммаАкциза,
		|	ВозвратТоваровПоставщикуТовары.СчетУчета КАК СчетУчета,
		|	ВозвратТоваровПоставщикуТовары.Всего КАК Всего,
		|	ВозвратТоваровПоставщикуТовары.ЗачетНДС КАК ЗачетНДС,
		|	ВозвратТоваровПоставщикуТовары.ИмпортОсвобожденныйОтНДС КАК ИмпортОсвобожденныйОтНДС,
		|	ВозвратТоваровПоставщикуТовары.Вес КАК Вес
		|ПОМЕСТИТЬ ВременнаяТаблицаТовары
		|ИЗ
		|	Документ.ВозвратТоваровПоставщику.Товары КАК ВозвратТоваровПоставщикуТовары
		|ГДЕ
		|	ВозвратТоваровПоставщикуТовары.Ссылка = &ДокументСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВозвратТоваровПоставщикуУслуги.НомерСтроки КАК НомерСтроки,
		|	ВозвратТоваровПоставщикуУслуги.Номенклатура КАК Номенклатура,
		|	ВозвратТоваровПоставщикуУслуги.Количество КАК Количество,
		|	ВозвратТоваровПоставщикуУслуги.Сумма КАК Сумма,
		|	ВозвратТоваровПоставщикуУслуги.СуммаНДС КАК СуммаНДС,
		|	ВозвратТоваровПоставщикуУслуги.СуммаНСП КАК СуммаНСП,
		|	ВозвратТоваровПоставщикуУслуги.СуммаАкциза КАК СуммаАкциза,
		|	ВозвратТоваровПоставщикуУслуги.Всего КАК Всего,
		|	ВозвратТоваровПоставщикуУслуги.ЗачетНДС КАК ЗачетНДС,
		|	ВозвратТоваровПоставщикуУслуги.СчетРасходов КАК СчетРасходов,
		|	ВозвратТоваровПоставщикуУслуги.Субконто1 КАК Субконто1,
		|	ВозвратТоваровПоставщикуУслуги.Субконто2 КАК Субконто2,
		|	ВозвратТоваровПоставщикуУслуги.Субконто3 КАК Субконто3
		|ПОМЕСТИТЬ ВременнаяТаблицаУслуги
		|ИЗ
		|	Документ.ВозвратТоваровПоставщику.Услуги КАК ВозвратТоваровПоставщикуУслуги
		|ГДЕ
		|	ВозвратТоваровПоставщикуУслуги.Ссылка = &ДокументСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВозвратТоваровПоставщикуОС.НомерСтроки КАК НомерСтроки,
		|	ВозвратТоваровПоставщикуОС.ОсновноеСредство КАК ОсновноеСредство,
		|	ВозвратТоваровПоставщикуОС.Сумма КАК Сумма,
		|	ВозвратТоваровПоставщикуОС.СуммаНДС КАК СуммаНДС,
		|	ВозвратТоваровПоставщикуОС.СуммаНСП КАК СуммаНСП,
		|	ВозвратТоваровПоставщикуОС.СуммаАкциза КАК СуммаАкциза,
		|	ВозвратТоваровПоставщикуОС.Всего КАК Всего,
		|	ВозвратТоваровПоставщикуОС.СуммаПоПоступлению КАК СуммаПоПоступлению,
		|	ВозвратТоваровПоставщикуОС.СуммаНДСПоПоступлению КАК СуммаНДСПоПоступлению,
		|	ВозвратТоваровПоставщикуОС.СуммаНСППоПоступлению КАК СуммаНСППоПоступлению,
		|	ВозвратТоваровПоставщикуОС.ВсегоПоПоступлению КАК ВсегоПоПоступлению,
		|   ВозвратТоваровПоставщикуОС.СчетУчета КАК СчетУчета,
		|	ВозвратТоваровПоставщикуОС.ЗачетНДС КАК ЗачетНДС,
		|	ВозвратТоваровПоставщикуОС.ИмпортОсвобожденныйОтНДС КАК ИмпортОсвобожденныйОтНДС
		|ПОМЕСТИТЬ ВременнаяТаблицаОСПредварительно
		|ИЗ
		|	Документ.ВозвратТоваровПоставщику.ОС КАК ВозвратТоваровПоставщикуОС
		|ГДЕ
		|	ВозвратТоваровПоставщикуОС.Ссылка = &ДокументСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|   ВременнаяТаблицаОСПредварительно.ОсновноеСредство,	
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаОСПредварительно.ЗачетНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Себестоимость) И &УказыватьПризнакЗачетаНДС
		|			ТОГДА ВременнаяТаблицаОСПредварительно.Сумма + ВременнаяТаблицаОСПредварительно.СуммаНДС
		|		ИНАЧЕ 	ВЫБОР
		|					КОГДА ВременнаяТаблицаШапка.ПлательщикНДС
		|						ТОГДА ВременнаяТаблицаОСПредварительно.Сумма + ВременнаяТаблицаОСПредварительно.СуммаНСП
		|					ИНАЧЕ ВременнаяТаблицаОСПредварительно.Сумма + ВременнаяТаблицаОСПредварительно.СуммаНДС + ВременнаяТаблицаОСПредварительно.СуммаНСП
		|				КОНЕЦ 
		|	КОНЕЦ КАК Сумма,
		|	ВременнаяТаблицаОСПредварительно.Всего КАК СуммаВалютная,
		|	ВременнаяТаблицаОСПредварительно.СуммаНДС КАК СуммаНДС
		|ПОМЕСТИТЬ ВременнаяТаблицаСуммыВозврата
		|ИЗ
		|	ВременнаяТаблицаОСПредварительно КАК ВременнаяТаблицаОСПредварительно
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВременнаяТаблицаШапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВозвратТоваровПоставщику.ВозвратПоставщику)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|   ВременнаяТаблицаОСПредварительно.ОсновноеСредство,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаОСПредварительно.ЗачетНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Себестоимость) И &УказыватьПризнакЗачетаНДС
		|			ТОГДА ВременнаяТаблицаОСПредварительно.СуммаПоПоступлению + ВременнаяТаблицаОСПредварительно.СуммаНДСПоПоступлению
		|		ИНАЧЕ 	ВЫБОР
		|					КОГДА ВременнаяТаблицаШапка.ПлательщикНДС
		|						ТОГДА ВременнаяТаблицаОСПредварительно.СуммаПоПоступлению + ВременнаяТаблицаОСПредварительно.СуммаНСППоПоступлению
		|					ИНАЧЕ ВременнаяТаблицаОСПредварительно.СуммаПоПоступлению + ВременнаяТаблицаОСПредварительно.СуммаНДСПоПоступлению + ВременнаяТаблицаОСПредварительно.СуммаНСППоПоступлению
		|				КОНЕЦ 
		|	КОНЕЦ КАК Сумма,
		|	ВременнаяТаблицаОСПредварительно.ВсегоПоПоступлению КАК СуммаВалютная,
		|	ВременнаяТаблицаОСПредварительно.СуммаНДСПоПоступлению КАК СуммаНДС
		|ПОМЕСТИТЬ ВременнаяТаблицаСуммыПоступления
		|ИЗ
		|	ВременнаяТаблицаОСПредварительно КАК ВременнаяТаблицаОСПредварительно
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВременнаяТаблицаШапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВозвратТоваровПоставщику.ВозвратПоставщику)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаОСПредварительно.НомерСтроки КАК НомерСтроки,
		|	ВременнаяТаблицаОСПредварительно.ОсновноеСредство КАК ОсновноеСредство,
		|	ВременнаяТаблицаОСПредварительно.Сумма КАК Сумма,
		|	ВременнаяТаблицаОСПредварительно.СуммаНДС КАК СуммаНДС,
		|	ВременнаяТаблицаОСПредварительно.СуммаНСП КАК СуммаНСП,
		|	ВременнаяТаблицаОСПредварительно.СуммаАкциза КАК СуммаАкциза,
		|	ВременнаяТаблицаОСПредварительно.Всего КАК Всего,
		|	ВременнаяТаблицаОСПредварительно.СуммаНДСПоПоступлению КАК СуммаНДСВалютнаяПоступление,
		|   ВременнаяТаблицаОСПредварительно.СчетУчета КАК СчетУчета,
		|	ВременнаяТаблицаОСПредварительно.ЗачетНДС КАК ЗачетНДС,
		|	ВременнаяТаблицаСуммыВозврата.Сумма КАК СуммаВозврат,
		|	ВременнаяТаблицаСуммыВозврата.СуммаВалютная КАК СуммаВалютнаяВозврат,
		|	ВременнаяТаблицаСуммыВозврата.СуммаНДС КАК СуммаНДСВозврат,
		|	ВременнаяТаблицаОСПредварительно.СуммаНДС КАК СуммаНДСВалютнаяВозврат,
		|	ВременнаяТаблицаСуммыПоступления.Сумма КАК СуммаПоступление,
		|	ВременнаяТаблицаСуммыПоступления.СуммаВалютная КАК СуммаВалютнаяПоступление,
		|	ВременнаяТаблицаСуммыПоступления.СуммаНДС КАК СуммаНДСПоступление
		|ПОМЕСТИТЬ ВременнаяТаблицаОС
		|ИЗ
		|	ВременнаяТаблицаОСПредварительно КАК ВременнаяТаблицаОСПредварительно
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСуммыВозврата КАК ВременнаяТаблицаСуммыВозврата
		|		ПО ВременнаяТаблицаОСПредварительно.ОсновноеСредство = ВременнаяТаблицаСуммыВозврата.ОсновноеСредство
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСуммыПоступления КАК ВременнаяТаблицаСуммыПоступления
		|		ПО ВременнаяТаблицаОСПредварительно.ОсновноеСредство = ВременнаяТаблицаСуммыПоступления.ОсновноеСредство
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КурсыВалютСрезПоследних.Курс КАК Курс,
		|	КурсыВалютСрезПоследних.Кратность КАК Кратность
		|ПОМЕСТИТЬ ВременнаяТаблицаКурсДоллара
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних(&Период, Валюта.Код = ""840"") КАК КурсыВалютСрезПоследних";	
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	Запрос.УстановитьПараметр("Период", ?(ЗначениеЗаполнено(ДокументСсылка.ДокументОснование.Дата), 
									ДокументСсылка.ДокументОснование.Дата, СтруктураДополнительныеСвойства.ДляПроведения.Дата));
	Запрос.УстановитьПараметр("ПлательщикНДС", СтруктураДополнительныеСвойства.УчетнаяПолитика.ПлательщикНДС);								
	Запрос.УстановитьПараметр("УказыватьПризнакЗачетаНДС", СтруктураДополнительныеСвойства.УчетнаяПолитика.УказыватьПризнакЗачетаНДСПриПоступлении);
	
	// Параметры для отражения НДС.
	КонтрагентГНС = СтруктураДополнительныеСвойства.ДляПроведения.Организация.КонтрагентГНС;
	
	СписокВидовДоговора = Новый СписокЗначений;
	СписокВидовДоговора.Добавить(Перечисления.ВидыДоговоровКонтрагентов.Прочее);
	ДоговорКонтрагентаГНС = Справочники.ДоговорыКонтрагентов.ПолучитьДоговорПоУмолчаниюПоОрганизацииВидуДоговора(КонтрагентГНС, 
		СтруктураДополнительныеСвойства.ДляПроведения.Организация, СписокВидовДоговора);
		
	СчетаУчета = БухгалтерскийУчетСервер.ПолучитьСчетаРасчетовСКонтрагентом(СтруктураДополнительныеСвойства.ДляПроведения.Организация, 
		КонтрагентГНС, ДоговорКонтрагентаГНС);
		
	Запрос.УстановитьПараметр("КонтрагентГНС", КонтрагентГНС);
	Запрос.УстановитьПараметр("ДоговорКонтрагентаГНС", ДоговорКонтрагентаГНС);
	Запрос.УстановитьПараметр("СчетРасчетовГНС", СчетаУчета.СчетРасчетовПоставщика);
	
	Запрос.Выполнить();    		
		
	СформироватьТаблицаХозрасчетный(ДокументСсылка, СтруктураДополнительныеСвойства, Отказ);	
	СформироватьТаблицаПоступлениеТоваров(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицаСведенияОПоступлении(СтруктураДополнительныеСвойства);
	СформироватьТаблицаРеестрВвезенных(СтруктураДополнительныеСвойства);
	СформироватьТаблицаНДСНаИмпорт(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРеестрЗакупок(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьСведенияПоПоказателямИмпорта(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицаСостоянияОС(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицаСобытияОС(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРеестрПриобретенныхМатериальныхРесурсов(ДокументСсылка, СтруктураДополнительныеСвойства);
КонецПроцедуры // ИнициализироватьДанныеДокумента()

#КонецОбласти

#Область ВерсионированиеОбъектов

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область ИнтерфейсПечати

// Функция формирует табличный документ с печатной формой ПечатьНакладной
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьНакладной(МассивОбъектов, ОбъектыПечати)
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВозвратТоваровПоставщику.Ссылка КАК Ссылка,
		|	ВозвратТоваровПоставщику.Номер КАК Номер,
		|	ВозвратТоваровПоставщику.Дата КАК Дата,
		|	ВозвратТоваровПоставщику.Организация КАК Организация,
		|	ВозвратТоваровПоставщику.Организация.НаименованиеПолное КАК ОрганизацияНаименованиеПолное,
		|	ВозвратТоваровПоставщику.ВалютаДокумента КАК ВалютаДокумента,
		|	ВозвратТоваровПоставщику.Контрагент КАК Контрагент,
		|	ВозвратТоваровПоставщику.Контрагент.НаименованиеПолное КАК КонтрагентНаименованиеПолное,
		|	ВозвратТоваровПоставщику.Склад КАК Склад,
		|	ПРЕДСТАВЛЕНИЕ(ВозвратТоваровПоставщику.Склад) КАК СкладПредставление,
		|	ВозвратТоваровПоставщику.Товары.(
		|		НомерСтроки КАК НомерСтроки,
		|		Номенклатура КАК Номенклатура,
		|		Номенклатура.НаименованиеПолное КАК НоменклатураПредставление,
		|		ПРЕДСТАВЛЕНИЕ(Номенклатура.КодТНВЭД) КАК КодПоКлассификатору,
		|		ПРЕДСТАВЛЕНИЕ(ВозвратТоваровПоставщику.Товары.Номенклатура.ЕдиницаИзмерения) КАК ЕИ,
		|		Количество КАК Количество,
		|		Цена КАК Цена,
		|		Сумма КАК Сумма,
		|		СуммаНДС КАК СуммаНДС,
		|		СуммаНСП КАК СуммаНСП
		|	) КАК Товары,
		|	ВозвратТоваровПоставщику.Услуги.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		Номенклатура КАК Номенклатура,
		|		ПРЕДСТАВЛЕНИЕ(Номенклатура.КодГКЭД) КАК КодПоКлассификатору,
		|		Номенклатура.НаименованиеПолное КАК НоменклатураПредставление,
		|		Номенклатура.ЕдиницаИзмерения.Представление КАК ЕИ,
		|		Количество КАК Количество,
		|		Цена КАК Цена,
		|		Сумма КАК Сумма,
		|		СуммаНДС КАК СуммаНДС,
		|		СуммаНСП КАК СуммаНСП
		|	) КАК Услуги,
		|	ВозвратТоваровПоставщику.ОС.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		ОсновноеСредство КАК Номенклатура,
		|		ПРЕДСТАВЛЕНИЕ(ОсновноеСредство.КодТНВЭД) КАК КодПоКлассификатору,
		|		ОсновноеСредство.НаименованиеПолное КАК НоменклатураПредставление,
		|		НЕОПРЕДЕЛЕНО КАК ЕИ,
		|		1 КАК Количество,
		|		Сумма КАК Цена,
		|		Сумма КАК Сумма,
		|		СуммаНДС КАК СуммаНДС,
		|		СуммаНСП КАК СуммаНСП
		|	) КАК ОС
		|ИЗ
		|	Документ.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику
		|ГДЕ
		|	ВозвратТоваровПоставщику.Ссылка В(&СписокДокументов)";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СписокДокументов", МассивОбъектов);
	
	Шапка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ВозвратТоваровПоставщику_Накладная";

	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ВозвратТоваровПоставщику.ПФ_MXL_Накладная");
	
	Пока Шапка.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Подготовка данных
		ДанныеПечати = Новый Структура;
		
		ТекстЗаголовка = СформироватьЗаголовокДокумента(Шапка, НСтр("ru = 'Накладная на возврат поставщику'"));
		ДанныеПечати.Вставить("ТекстЗаголовка", ТекстЗаголовка);
		ДанныеПечати.Вставить("ОрганизацияНаименованиеПолное", Шапка.ОрганизацияНаименованиеПолное);
		ДанныеПечати.Вставить("СкладПредставление", Шапка.СкладПредставление);
		ДанныеПечати.Вставить("КонтрагентНаименованиеПолное", Шапка.КонтрагентНаименованиеПолное);
		
		ТаблицаТовары 	= Шапка.Товары.Выгрузить();
		ТаблицаУслуги 	= Шапка.Услуги.Выгрузить();
		ТаблицаОС 		= Шапка.ОС.Выгрузить();
		
		Если ТаблицаТовары.Количество() > 0
			Или ТаблицаОС.Количество() > 0 Тогда 
			ДанныеПечати.Вставить("НаименованиеКлассификатора", НСтр("ru = 'Код ТНВЭД'"));
		ИначеЕсли ТаблицаУслуги.Количество() > 0 Тогда  
			ДанныеПечати.Вставить("НаименованиеКлассификатора", НСтр("ru = 'Код ГКЭД'"));	
		КонецЕсли;	
		
		Всего = ТаблицаТовары.Итог("Сумма") 		+ ТаблицаУслуги.Итог("Сумма") 	 + ТаблицаОС.Итог("Сумма");
		ВсегоНДС = ТаблицаТовары.Итог("СуммаНДС")	+ ТаблицаУслуги.Итог("СуммаНДС") + ТаблицаОС.Итог("СуммаНДС");
		ВсегоНСП = ТаблицаТовары.Итог("СуммаНСП")	+ ТаблицаУслуги.Итог("СуммаНСП") + ТаблицаОС.Итог("СуммаНСП");
		КоличествоНаименований = ТаблицаТовары.Количество() + ТаблицаУслуги.Количество() + ТаблицаОС.Количество();		
		
		ДанныеПечати.Вставить("Всего", Всего);
		ДанныеПечати.Вставить("ВсегоНДС", ВсегоНДС);
		ДанныеПечати.Вставить("ВсегоНСП", ВсегоНСП);
		ДанныеПечати.Вставить("ИтоговаяСтрока", 
			СтрШаблон(НСтр("ru = 'Всего наименований %1, на сумму %2'"), 
			Формат(КоличествоНаименований, "ЧН=0; ЧГ=0"), Формат(ДанныеПечати.Всего, "ЧЦ=15; ЧДЦ=2")));
		ДанныеПечати.Вставить("СуммаПрописью", БухгалтерскийУчетСервер.СформироватьСуммуПрописью(ДанныеПечати.Всего, Шапка.ВалютаДокумента));

		// Области
		МассивОбластейМакета = Новый Массив;
		МассивОбластейМакета.Добавить("Заголовок");
		МассивОбластейМакета.Добавить("ШапкаТаблицы");
		МассивОбластейМакета.Добавить("Строка");
		МассивОбластейМакета.Добавить("Подвал");
		МассивОбластейМакета.Добавить("Итоги");
		МассивОбластейМакета.Добавить("ИтогиНДС");
		МассивОбластейМакета.Добавить("ИтогиНСП");
		МассивОбластейМакета.Добавить("СуммаПрописью");
		МассивОбластейМакета.Добавить("Подписи");

		Для Каждого ИмяОбласти Из МассивОбластейМакета Цикл
			ОбластьМакета = Макет.ПолучитьОбласть(ИмяОбласти);
			Если ИмяОбласти <> "Строка" Тогда
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			ИначеЕсли ИмяОбласти = "Строка" Тогда
				НомерСтроки = 1;
				Для Каждого СтрокаТаблицы Из ТаблицаТовары Цикл
					ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
					ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
					ТабличныйДокумент.Вывести(ОбластьМакета);
					НомерСтроки = НомерСтроки + 1;
				КонецЦикла;
				Для Каждого СтрокаТаблицы Из ТаблицаУслуги Цикл
					ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
					ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
					ТабличныйДокумент.Вывести(ОбластьМакета);
					НомерСтроки = НомерСтроки + 1
				КонецЦикла;
				Для Каждого СтрокаТаблицы Из ТаблицаОС Цикл
					ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
					ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
					ТабличныйДокумент.Вывести(ОбластьМакета);
					НомерСтроки = НомерСтроки + 1
				КонецЦикла;
			КонецЕсли;	
		КонецЦикла;
		
		БухгалтерскиеОтчеты.ВыводПодписиРуководителей(ТабличныйДокумент, Шапка);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Накладная") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"Накладная", НСтр("ru = 'Накладная'"), ПечатьНакладной(МассивОбъектов, ОбъектыПечати),,
			"Документ.ВозвратТоваровПоставщику.ПФ_MXL_Накладная");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТТН") Тогда
		МассивДокументовТТН = ПодготовитьМассивДокументовТТН(МассивОбъектов);
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		Документы.ТТНИсходящая.Печать(МассивДокументовТТН, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТТНВВалюте") Тогда
		МассивДокументовТТН = ПодготовитьМассивДокументовТТН(МассивОбъектов);
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		Документы.ТТНИсходящая.Печать(МассивДокументовТТН, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	КонецЕсли;

КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Накладная";
	КомандаПечати.Представление = НСтр("ru = 'Накладная'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 1;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ТТН";
	КомандаПечати.Представление = НСтр("ru = 'ТТН'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 2;

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ТТНВВалюте";
	КомандаПечати.Представление = НСтр("ru = 'ТТН в валюте'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 3;	
	
	// Реестр документов
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор  = "РеестрВозвратТоваровПоставщику";
	КомандаПечати.Представление  = НСтр("ru = 'Реестр документов'");
	КомандаПечати.ЗаголовокФормы = НСтр("ru = 'Реестр документов ""Возврат товаров поставщику""'");
	КомандаПечати.Обработчик     = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечатиРеестраДокументов";
	КомандаПечати.СписокФорм     = "ФормаСписка";
	КомандаПечати.Порядок        = 100;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает заголовок документа для печатной формы.
//
// Параметры:
//  Шапка - любая структура с полями:
//           Номер         - Строка или Число - номер документа;
//           Дата          - Дата - дата документа;
//           Представление - Строка - (необязательный) платформенное представление ссылки на документ.
//                                    Если параметр НазваниеДокумента не задан, то название документа будет вычисляться
//                                    из этого параметра.
//  НазваниеДокумента - Строка - название документа (например, "Счет на оплату").
//
// Возвращаемое значение:
//  Строка - заголовок документа.
//
Функция СформироватьЗаголовокДокумента(Шапка, Знач НазваниеДокумента = "")
	
	ДанныеДокумента = Новый Структура("Номер,Дата,Представление");
	ЗаполнитьЗначенияСвойств(ДанныеДокумента, Шапка);
	
	// Если название документа не передано, получим название по представлению документа.
	Если ПустаяСтрока(НазваниеДокумента) И ЗначениеЗаполнено(ДанныеДокумента.Представление) Тогда
		ПоложениеНомера = СтрНайти(ДанныеДокумента.Представление, ДанныеДокумента.Номер);
		Если ПоложениеНомера > 0 Тогда
			НазваниеДокумента = СокрЛП(Лев(ДанныеДокумента.Представление, ПоложениеНомера - 1));
		КонецЕсли;
	КонецЕсли;

	НомерНаПечать = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеДокумента.Номер);
	Возврат СтрШаблон(НСтр("ru = '%1 № %2 от %3'"),
		НазваниеДокумента, НомерНаПечать, Формат(ДанныеДокумента.Дата, "ДЛФ=DD"));
	
КонецФункции

Функция ПодготовитьМассивДокументовТТН(МассивОбъектов)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТТНИсходящая.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ТТНИсходящая КАК ТТНИсходящая
		|ГДЕ
		|	ТТНИсходящая.ДокументОснование В(&МассивОбъектов)";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции // ПодготовитьМассивДокументовТТН()

#КонецОбласти

#КонецЕсли