///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.РежимВыбора Тогда
		Элементы.Список.РежимВыбора = Истина;
	КонецЕсли;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура КомандаПодборИзКлассификатора(Команда)
	
	ПодобратьИзКлассификатора();
	ОбновитьОтображениеДанных();
		
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	ПодобратьИзКлассификатора();
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура ПодобратьИзКлассификатора()
	
	ЗарплатаКадрыКлиент.ОткрытьФормуПодбораИзКлассификатора(
		"ЯзыкиНародовМира",	"Справочник.ЯзыкиНародовМира.КлассификаторЯзыковНародовМира", НСтр("ru='Языки народов мира'"), ЭтаФорма);
	
КонецПроцедуры
